{
  "Interviews": [
    {
      "Name": "Famitsu Weekly (KH Ultimania)",
      "Link": "https://www.kh13.com/interviews/kingdom-hearts-ultimania-x-tetsuya-nomura/",
      "ReleaseDate": "2002-06-13T00:00:00",
      "AdditionalLink": "",
      "Conversation": [
        {
          "Order": 0,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Having Disney's Princesses be captured and held in the same place, and in that way having them appear in the game together, worked well, didn't it?"
        },
        {
          "Order": 1,
          "Speaker": "Nomura",
          "Line": "To begin with, I wanted to put in a scene where all the Princesses were captured and being held at Hollow Bastion, and the various movies' Princes come to save them. That idea in itself ended up being no good, but we managed to keep the part with the Princesses in the final game."
        },
        {
          "Order": 2,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Did you yourself decide which Disney properties to include as worlds in the game?"
        },
        {
          "Order": 3,
          "Speaker": "Nomura",
          "Line": "When I was working on the game by myself at the start, I did most of the choosing of worlds. At that time, there were a lot more worlds. Including original worlds, I think there were more than 20. Ultimately, talking with the design staff, we cut worlds here and there and ended up with the current number."
        },
        {
          "Order": 4,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "What sort of criteria did you use to select worlds?"
        },
        {
          "Order": 5,
          "Speaker": "Nomura",
          "Line": "Well, as you'd have thought, popularity was at the top of our list. We chose worlds which are reasonably well-known. We also chose those with characters who looked like they would be fun to put in motion, and who would make interesting, involving settings."
        },
        {
          "Order": 6,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "By the way, is there a reason why Mickey Mouse, who you might call Disney's symbol character, only appears in one scene?"
        },
        {
          "Order": 7,
          "Speaker": "Nomura",
          "Line": "Actually, due to contractual issues, we were only able to use him in one scene. So I thought hard about where to put him in."
        },
        {
          "Order": 8,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Oh, so you had that sort of contractual restrictions then? If so, you used him in a very effective way, didn't you."
        },
        {
          "Order": 9,
          "Speaker": "Nomura",
          "Line": "Disney gave us permission for a role such as waving from the back of a crowd of people in town, but if we were going to use him, I thought we should use him in a single shot to leave the greatest impression. So there was only that one place that we could use him in, really."
        },
        {
          "Order": 10,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Also, about Cloud, isn't the left-hand side of his design modelled on FFVII's Vincent?"
        },
        {
          "Order": 11,
          "Speaker": "Nomura",
          "Line": "Yes, his left arm is in Vincent's image. This time, in this setting, Cloud is leaning towards the dark side, and I wanted to make him a bit more demon-like. And, since Vincent was exactly that kind of design, I just added it in. Although I would have liked to put Vincent in the game too..."
        },
        {
          "Order": 12,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "We'd also like to ask a setting-type question about Cloud. Was he originally from Hollow Bastion?"
        },
        {
          "Order": 13,
          "Speaker": "Nomura",
          "Line": "In the Kingdom Hearts setting, at any rate, yes."
        },
        {
          "Order": 14,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "In which case, when Cid took the others and escaped from Hollow Bastion, was Cloud left behind?"
        },
        {
          "Order": 15,
          "Speaker": "Nomura",
          "Line": "He was just lost in the confusion, he wasn't really left behind (laughs). Because presumably Cid and co were escaping in the midst of the disarray."
        },
        {
          "Order": 16,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Okay then, so the person who Cloud is searching for is Aeris, right?"
        },
        {
          "Order": 17,
          "Speaker": "Nomura",
          "Line": "Well, what do you think? If indeed it was Aeris, then the bit in the ending was the answer. You might say it was made so that you can take it that way. Cloud is a popular character, and I don't really want to decide myself, yes he is like this. Because players make strong conclusions by themselves, I want to leave room for everyone's line of thought."
        },
        {
          "Order": 18,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Mr. Nomura, what did you most want to portray in this project's story?"
        },
        {
          "Order": 19,
          "Speaker": "Nomura",
          "Line": "For the story, simply put, \"connections\"...... I wanted to portray the idea that people are not physically connected. Well, I think that is already thoroughly incorporated in the story though. Even apart, things which are connected are still connected."
        },
        {
          "Order": 20,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "When we heard it was a Disney game, we were expecting a much simpler story, but in fact it's really a story that allows the player to think about many different things, isn't it?"
        },
        {
          "Order": 21,
          "Speaker": "Nomura",
          "Line": "Yeah, regarding that, we talked about concentrating on the gameplay and just making a simple story, and we also thought about Disney's target age range, and though maybe we should avoid a complex story. But at a point when we had the project set out to a certain degree, I got a talk from Mr. Sakaguchi, saying that if we didn't aim for the level that FF does, this project would be a failure. Well, I understood what he was saying. So, for the game's contents...... The gameplay was always the same sort of thing from the start, but we improved the story greatly. At the beginning, we were thinking we'd make the story extremely simple. At that time, when characters like Ansem didn't even exist, we were thinking that you'd kill Maleficent and the game would end there."
        },
        {
          "Order": 22,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Right then, we'd like to ask you some questions about that improved story. First, was Kairi coming to Destiny Islands fate, or was it just coincidence?"
        },
        {
          "Order": 23,
          "Speaker": "Nomura",
          "Line": "It was both. It's not shown in this game, and it's a delicate issue whether I can call this a living setting, but anyway Kairi was sent out from Hollow Bastion by Ansem's hand. And the reason why Ansem sent her was to find the Keyblade. There was actually evidence of that in the jail at the End of the World. Ansem thought that girls who are princesses would be sure to make it to the place of the Keyblade. So Kairi coming to the place with Sora and Riku was both chance, and also fate."
        },
        {
          "Order": 24,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Do you mean to say that there are other \"Keyblade Heroes\"?"
        },
        {
          "Order": 25,
          "Speaker": "Nomura",
          "Line": "Well, undoubtedly there are other \"Keyblade Heroes\", but it just so happened that this time, Kairi made it to the world where Riku and Sora were. That's all."
        },
        {
          "Order": 26,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "About Riku being the rightful owner of the Keyblade - why is it that Sora had the Keyblade first?"
        },
        {
          "Order": 27,
          "Speaker": "Nomura",
          "Line": "That part is also a bit vague. In the Destiny Islands when Riku is swallowed by the darkness, there's a sparkle of light, and next comes the scene where Sora first gets the Keyblade, right? In my setting, the darkness wrapping itself around those two is the darkness of Riku's heart. At the moment when Sora enters that darkness, the light you can see is the light of the heart. Sora, trying to help Riku, struggling in the darkness, touches that light and temporarily the Keyblade goes to Sora."
        },
        {
          "Order": 28,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Also, Kairi's grandmother tells her a story about \"the world once perishing and being recreated by the light of the children.\" Is this \"world recreated by the light of the children\" in fact referring to all the worlds in the game?"
        },
        {
          "Order": 29,
          "Speaker": "Nomura",
          "Line": "Yes, that's right. But that story wasn't history, it was a fairy tale. It doesn't mean that story equals the world's history precisely. Although, there is a certain degree of overlapping."
        },
        {
          "Order": 30,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "When you look at the computer in the \"World's Prison\", there is a message with a very deep meaning. It says, \"Two will seal the Door of Darkness.\" Who specifically is it referring to?"
        },
        {
          "Order": 31,
          "Speaker": "Nomura",
          "Line": "Well, judging by what happens (in the game), one of them is obviously Sora. As for the other one, you could take it as either; there's both Riku and the King. And for the \"two keys\" after that, there are both the keys that Sora and the King have, but also there's the presence of Sora and Riku."
        },
        {
          "Order": 32,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "At the end, it seems Kairi is left in the Destiny Islands. Doesn't she return to Hollow Bastion?"
        },
        {
          "Order": 33,
          "Speaker": "Nomura",
          "Line": "Right. I often get asked about this part, but it's actually explained in the game. The Princesses tell Sora that everyone will be able to return to the place they were when their world was destroyed. Kairi disappeared in the Destiny Islands, so she returned there. Because she was physically sent from Hollow Bastion to the Destiny Islands, so she never actually \"disappeared\" from there."
        },
        {
          "Order": 34,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "In the ending, Riku and the King are on the other side of the door. Why is that?"
        },
        {
          "Order": 35,
          "Speaker": "Nomura",
          "Line": "As far as the King is concerned, he was on the other side from the beginning. He disappeared because he went to the world on the other side in order to find one of the two keys. There, he has his own adventure in the same way as Sora. As for Riku: his body stolen by Ansem, his heart did not remain in this world. The other side of the door is, just as it appears, darkness. So Riku's heart went to the world on the other side, that is to say just as Ansem was saying at the end, the world of darkness. Thus, when Ansem disappears and Riku returns to his original body, he is in the world of darkness."
        },
        {
          "Order": 36,
          "Speaker": "Kingdom Hearts Ultimania",
          "Line": "Well then, when Riku has returned to his own body, why doesn't he come back to the world on this side?"
        },
        {
          "Order": 37,
          "Speaker": "Nomura",
          "Line": "That's another thing I've been asked by lots of people, but the answer is actually written in the World's Prison computer message. It is implied there that only darkness can pass through that door. Riku and the King are not creatures of darkness, so they can't come out through that door."
        }
      ],
      "GameNames": [
        "Kingdom Hearts"
      ],
      "Participants": [
        "Kingdom Hearts Ultimania",
        "Nomura"
      ],
      "Provider": "KH13",
      "Translator": "Kingdom Hearts Ultimania"
    },
    {
      "Name": "Behind the scenes: Kingdom Hearts",
      "Link": "https://www.kh13.com/interviews/behind-the-scenes-kingdom-hearts-x-various-people/",
      "ReleaseDate": "2003-01-01T00:00:00",
      "AdditionalLink": "https://www.youtube.com/watch?v=ZeZ4ariFYm8",
      "Conversation": [],
      "GameNames": [
        "Kingdom Hearts"
      ],
      "Participants": [],
      "Provider": "KH13",
      "Translator": "Unknown"
    }
  ]
}