{
  "AnsemReports": [
    {
      "Name": "Ansem's Report 1",
      "Text": "Much of my life has been dedicated to the pursuit of knowledge.\nThat knowledge has guarded this world well. Not a soul doubts that.\n I am blessed with people's smiles and respect. But though I am called a sage, there are things I do not understand.\nI believe darkness sleeps in every heart, no matter how pure. Given the chance, the smallest drop can spread and swallow the heart. I have witnessed it many times.\nDarkness...Darkness of the heart. How is it born?\nHow does it come to affect us so?\nAs ruler of this world, I must find the answers. I must find them before the world is lost to those taken by the darkness.",
      "Location": "After defeating Jafar (Genie)"
    },
    {
      "Name": "Ansem's Report 2",
      "Text": "It is my duty to expose what this darkness really is. I shall conduct the following experiments:\nExtract the darkness from a person's heart.\nCultivate darkness in a pure heart.\nBoth suppress and amplify the darkness within.\nThe experiments caused the test subjects' hearts to collapse, including those of the most stalwart. How fragile our hearts are! My treatment produced no signs of recovery. I confined those who had completely lost their hearts beneath the castle.\nSome time later, I went below and was greeted by the strangest sight. Creatures that seemed born of darkness...What are they? Are they truly sentient beings? Could they be the shadows of those who lost their hearts in my experiments?",
      "Location": "After speaking with Aerith in the Library."
    },
    {
      "Name": "Ansem's Report 3",
      "Text": "The shadows that crawl beneath the castle... Are they the people who lost their hearts, or incarnations of darkness? Or something entirely beyond my imagination?\nAll my knowledge has provided no answer. One thing I am sure of is that they are entirely devoid of emotion. Perhaps further study will unlock the mysteries of the heart.\nFortunately, there is no shortage of test samples. They are multiplying underground even as I write this report. They still need a name. Those who lack hearts... I will call them the Heartless.",
      "Location": "After defeating Ursula's second form"
    },
    {
      "Name": "Ansem's Report 4",
      "Text": "The Heartless appear in groups, and are multiplying rapidly. I've provided them both living and nonliving samples. They've responded only to the living. They seem to multiply after absorbing something from the living creatures. Their prey vanishes without a trace.\nI believe the Heartless are taking hearts. They are born from those who've lost their hearts, and thrive on hearts seized from others. The hearts taken by the Heartless become Heartless themselves.\nThough I lack proof, I am confident in this hypothesis. I must also study their behavioral principles. Though they lack emotions, they do seem to have some intelligence. How to communicate with them?\nIt's just occurred to me: Could they be the darkness in people's hearts?",
      "Location": "After speaking with Aerith in the Library"
    },
    {
      "Name": "Ansem's Report 5",
      "Text": "To study the Heartless behavior, I picked one out for observation. It wiggled its antennae and, as if sensing a target, headed deep into the castle. In the deepest part of the castle, its antennae began vibrating, as if searching for something. Suddenly, a strange door appeared. I'd never known of its existence.\nIt had a large keyhole, but didn't seem to be locked. So I opened the door. What I saw on the other side mystified me. What was that powerful mass of energy? That night I observed a great meteor shower in the sky. Could it be related to the door that I have opened?",
      "Location": "After defeating Maleficent"
    },
    {
      "Name": "Ansem's Report 6",
      "Text": "A massive core of energy lay beyond the door sought by the Heartless. It may be the ultimate goal of the Heartless. But what is that energy? I have devised a hypothesis, based upon my observations of the Heartless.\nThe Heartless feed on other's hearts, and they yearn for that energy core. That thing beyond the door must be a heart, too--the heart of this world. There is no proof, but, having felt that immense energy, I am certain. That was the heart of the world.\nThe Heartless are trying to take hearts not only from all living creatures, but from the planet itself. But what do they mean to do with the heart of the world?",
      "Location": "After speaking with Aerith in the Library"
    },
    {
      "Name": "Ansem's Report 7",
      "Text": "I am studying material from the meteors that rained down that fateful night. What a find! The material is foreign to our world. It is elastic to the touch, and when two pieces are combined, they bond easily. None of the records even mention such a substance.\nWas it introduced to this world when I opened the door? I wonder how many other such materials drift through the atmosphere of this tiny world... I wish I could soar off and find out! Could there be uncharted worlds up there? My curiosity never ceases to grow.\nBut I should stop speaking of such unrealistic dreams. For now, there is no way to venture outside this world. My people and I are all but prisoners of this tiny place.",
      "Location": "After defeating Oogie Boogie"
    },
    {
      "Name": "Ansem's Report 8",
      "Text": "There is no doubt that the Heartless are deeply connected to the people's hearts. Further study may unravel both their motivations and the mysteries shrouding the heart.\nAs a start, I have built a device that artificially creates Heartless. By recreating the conditions that spawn the Heartless naturally, I should be able to produce them artificially. This device is the culmination of all my research thus far. The machine's test run successfully created a Heartless.\nThis may be a step toward creating a heart from nothing. The artificially and naturally created Heartless showed nearly identical traits. But the two types remain distinct for the purpose of the experiment. So, I will mark the ones that are created artificially.",
      "Location": "After defeating Hades"
    },
    {
      "Name": "Ansem's Report 9",
      "Text": "Simply astonishing! Today I had a guest from another world. He is a king, and his vessel is built of the material that composed the meteors. He called the pieces \"gummi blocks\". It seemed that my opening the door has opened a path to interworld travel.\nWe talked for countless hours, but one story in particular caught my interest: that of a key called the \"Keyblade\". The Keyblade is said to hold phenomenal power.\nOne legend says its wielder saved the world, while another says that he wrought chaos and ruin upon it. I must know what this Keyblade is. A key opens doors. It must be connected to the door I have opened.",
      "Location": "After defeating Captain Hook"
    },
    {
      "Name": "Ansem's Report 10",
      "Text": "Just as people have hearts, so do worlds. The same can be said of stars in the night sky. And deep within each world lies a door to its heart. The Heartless desire those hearts. Born out of darkness in people's hearts, they seek to return to a greater heart.\nYes that's it. The Heartless come from people's hearts, as does the darkness. Is the core of the world's heart the world of the Heartless? I will pursue the answer there and become all knowing.\nMy path is set. I shall seek out the wielder of the Keyblade, and the princesses. My body is too frail for such a journey, but I must do this. I will cast it off and plunge into the depths of darkness.",
      "Location": "After speaking with Aerith in the Library"
    },
    {
      "Name": "Ansem's Report 11",
      "Text": "Opening the door to a world's heart causes its walls to crumble.\nThese fragments are seen as shooting stars.\nThis explains why these \"gummi blocks\" can travel freely to other worlds.\nI know the catalyst of this collapse—the appearance of the Heartless. However, it will take time search out the worlds' doors and to retrieve each heart.\nFurthermore, the doors can be locked using a Keyblade, making the heart forever unattainable. I must take action before the wielder of the key appears in this world.\nIf the princesses and the Keyblade are connected, they should resonate.\nI've chosen a girl. I don't know if she holds the princesses' powers, but I will find out. She may lead me to the key bearer.\nI shall set her free and observe.",
      "Location": "After defeating the Kurt Zisa"
    },
    {
      "Name": "Ansem's Report 12",
      "Text": "The body is gone; the heart should have returned to the Heartless. And yet, nothing.\nThis one is unlike any other. Its memories remain and it has yet to take the form of a Heartless.\nA close eye must be kept on the situation. Much is still unknown.\nTo get to the realm of Darkness, one must go through the doors of Kingdom Hearts, the place where the world's hearts connect.\nBeyond this world is a place in which darkness reigns. (Details shall be archived in a separate report.)\nThere are many worlds in existence, some of which we know nothing about.\nThe world in which we live. The realm of Darkness. The realm of Light.\nAnd the world in between.\nWherein lies true nirvana?",
      "Location": ""
    },
    {
      "Name": "Ansem's Report 13",
      "Text": "Where does the body go when it separates from the heart? If the soul remains within the body, is it still considered to be deceased?\nWhen the heart returns to the Heartless, the physical form disappears. But that is merely true in this world. Perhaps the body exists in another form in another world.\nIf that is the case, then it is possible for one to exist in two worlds.\nA being that is neither darkness nor light; belonging nowhere; abandoned by its heart; a mere shell of its former self.\nThe relation between the heart and body is complex. However, I am certain that if your self exists here, then by definition, the other cannot truly \"exist.\"\nThe other, the one which does not exist, shall be dubbed, \"Nobody.\"",
      "Location": "After defeating the Unknown"
    }
  ]
}