{
  "Roxas'sDiary'": [
    {
      "Day": "Day 7",
      "Name": "Entry 1",
      "Text": "It's been a week since I got here. Saïx told me to keep a diary, but he said nobody would check it. What am I supposed to write about?\nToday they told us to go to the Round Room, where we met our new member, No. XIV. Was I like that when I first got here? I think I was. But I don't remember too well."
    },
    {
      "Day": "Day 8",
      "Name": "Entry 2",
      "Text": "Axel and I went to Twilight Town today. He taught me a lot.\nBefore we RTC'd (Returned To the Castle) we swung by the clock tower and had some sea-salt ice cream. Axel called it the \"icing on the cake\" after a successful mission. Well, except there was no cake—just the ice cream.\nI don't know what to write in this thing!"
    },
    {
      "Day": "Day 9",
      "Name": "Entry 3",
      "Text": "The past few days, the other members have been showing me how to fight and do mission stuff. They also told me more about the Organization, and about myself.\nI still don't really get what a \"heart\" is. But apparently, it's a vital piece of who I am—so I've decided to cooperate. If I collect enough hearts, I can complete Kingdom Hearts. Then I'll be whole."
    },
    {
      "Day": "Day 14",
      "Name": "Entry 4",
      "Text": "    Me and Axel went on a mission to Twilight Town. Afterwards, we went and had ice cream again up on the clock tower.\nHe said friends do stuff like that. Or they laugh together. So does that mean me and him are friends?"
    },
    {
      "Day": "Day 15",
      "Name": "Entry 5",
      "Text": "The other members have been teaching me more about how to fight and stuff. It's going, I guess.\nEvery day after work, I've been meeting Axel at the clock tower to have sea-salt ice cream. It really is salty! But still sweet, too. How come it tastes so familiar?"
    },
    {
      "Day": "Day 22",
      "Name": "Entry 6",
      "Text": "    Axel is going to some place called Castle Oblivion. He told me because we're friends.\nHe had to go home early to get ready, and after he left I noticed the word WINNER on my ice cream stick. I wonder what I won... I'll ask him when I see him tomorrow."
    },
    {
      "Day": "Day 23",
      "Name": "Entry 7",
      "Text": "Axel left before I woke up this morning. I never got to ask him about the ice cream stick.\nI was partnered up with No. XIV for today's mission. Xion wore a hood the whole time and wouldn't say a word to me. Come to think of it, I didn't have a whole lot to say, either.\nAfterwards I went and had ice cream by myself."
    },
    {
      "Day": "Day 24",
      "Name": "Entry 8",
      "Text": "I teamed up with No. XIV again today. We finally talked a little—Xion even said my name for the first time.\nAfterwards I had ice cream by myself again. The lady at the shop said you can trade the WINNER stick for an extra bar. But I can't eat more than one."
    },
    {
      "Day": "Day 25",
      "Name": "Entry 9",
      "Text": "Today was my third day with Xion. I've gotten to know a little more about her. That's right—she's a girl, with black hair, and she can use the Keyblade just like me!\nI took her out for ice cream afterwards, but I'm saving the WINNER stick. Axel deserves a reward when he gets back. Xion wants to have ice cream with us from now on. Maybe we'll be friends."
    },
    {
      "Day": "Day 26",
      "Name": "How Long?",
      "Text": "I only remember part of this day. I heard somebody sent to Castle Oblivion was terminated. Saïx said it may have been Axel.\nI tried to ask Xigbar about it on the day's mission, and he said nothing's left of Nobodies once we're gone, because we have no hearts to leave behind. I don't remember much after that. They say I collapsed and wouldn't wake up..."
    },
    {
      "Day": "Day 50",
      "Name": "Xion's Seashells",
      "Text": " I must have missed a lot. It's like I had the longest dream. I woke up to find a bunch of seashells by my pillow. I counted them—one for each day they said I was asleep.\nI was wondering who left them there, but then when I got to the clock tower, Xion gave me another one. I held it up to my ear, and I could hear the ocean... Why did it sound so familiar?\nThe stuff I dreamed about felt strangely familiar too. I remember being in a white room with somebody the same age as me wearing red clothes...and then he sort of disappeared into the white.\nAnd there was a girl's voice—she said she knew I'd be \"snoozing.\" Why would she know that? The voice was a little like Xion's."
    },
    {
      "Day": "Day 51",
      "Name": "Annihilated",
      "Text": "It sounds like the worst has come to pass: the whole C.O. team, wiped from existence. It's hard to come to grips with the idea that Axel is gone. I feel...choked up? I don't know what you'd call it. I've never had this kind of sensation.\nI went up to the clock tower to have ice cream, but nobody else showed up."
    },
    {
      "Day": "Day 52",
      "Name": "Ice Cream Alone",
      "Text": "I sit up on the clock tower, but no one comes. Not Axel, not even Xion. That weird lump in my throat won't go away.\nSomething else is bothering me. This is gonna sound crazy (good thing this is a private diary!) but these pictures keep flashing through my head. Not all the time, just sometimes... Ever since I collapsed.\nIt happens when I'm awake, too—on missions—so I don't think it's a dream. Where are the pictures coming from?"
    },
    {
      "Day": "Day 71",
      "Name": "Axel's Back",
      "Text": "After work, Axel turned up. Just like that, out of nowhere. I didn't know what to say. I thought we'd lost him for good.\nWe went up to the clock tower and talked for a while. I told him about Xion.\nThe choked-up sensation has gone away."
    },
    {
      "Day": "Day 72",
      "Name": "Ice Cream with Axel",
      "Text": "Me and Axel went to Agrabah. He seems different now that he's back from C.O. Ice cream was just the two of us today.\nI wonder when me and Axel and Xion will all get to have ice cream together."
    },
    {
      "Day": "Day 73",
      "Name": "Where's Xion?",
      "Text": "After I finished my mission I wanted all three of us to have ice cream, but I couldn't find Xion. It's been at least ten days since I've seen her.\nAxel said he'd ask Saïx what was going on. Speaking of Axel, I didn't see him at the clock tower today."
    },
    {
      "Day": "Day 74",
      "Name": "The Three of Us",
      "Text": "My job today was to help Axel find Xion. It turns out she had gone missing, but we managed to find her.\nWe finally got to all have ice cream together, which was nice, but Xion can't use her Keyblade anymore. Axel says friends help each other out, so I'm gonna go on missions with her until she remembers how to work the Keyblade herself."
    },
    {
      "Day": "Day 75",
      "Name": "Inseparable",
      "Text": "Me and Xion are working together now. The Genie we met in Agrabah said he and his friend Al are \"inseparable.\" Axel told us best friends can be inseparable even if they're not always together, but it sounded like he wasn't too sure about it himself.\nI thought Axel knew everything. Oh well...\nThat reminds me, those weird pictures flashed through my head again while I was in Agrabah. The guy in red I wrote about before... Has he been to Agrabah or something?"
    },
    {
      "Day": "Day 94",
      "Name": "Kingdom Hearts",
      "Text": "Xemnas summoned us. Nothing he says ever makes sense to me. He showed us Kingdom Hearts, a big heart-shaped moon floating up there in the night sky, and said the human heart will never have power over us. Great...I guess? So why are we trying to get hearts again?\nAxel said I'll understand better once I have a heart, but I'm not so sure..."
    },
    {
      "Day": "Day 95",
      "Name": "My Past",
      "Text": "I went to Agrabah today with Xion. We make a pretty good team now.\nAfterwards me and her and Axel talked about us and the other Nobodies. The ones who make it into the Organization are powerful enough to keep their memories... But me and Xion can't remember our pasts. What was I like?"
    },
    {
      "Day": "Day 96",
      "Name": "Out of Trouble",
      "Text": "Today's mission was with Xion, in Beast's Castle. I tried loaning her my Keyblade, and she had no problem using it. That meant I had to fight without it, but we got the job done.\nAfterwards Xion remembered how to summon her own Keyblade, so I guess we're out of trouble. When we were done, we all had ice cream together."
    },
    {
      "Day": "Day 97",
      "Name": "Our Place",
      "Text": "Every day, after work, the three of us have been going to our place on top of the clock tower to have ice cream. We don't talk about much, but I wouldn't miss these conversations for the world. I wonder if Axel and Xion feel the same way...\nDo the other Organization members have their own routines? It's hard to picture."
    },
    {
      "Day": "Day 117",
      "Name": "Special Nobodies",
      "Text": "Today it was me and Xigbar. Axel and Xion went out on their own mission.\nXigbar told me that Xion and me are \"exceptional\"—you know, like, special Nobodies. Because we can use the Keyblade?\nWork dragged on late, so I didn't make it up to the clock tower. I wonder if Xion and Axel made it.\nThose pictures started flashing through my head again on the mission. The boy in red... What's it all about? Maybe when Xigbar called me \"special\" he meant \"crazy\"...\nSeriously, though, is Xion experiencing the same thing? It feels weird to ask."
    },
    {
      "Day": "Day 118",
      "Name": "Vacation",
      "Text": "Today was my first vacation ever. I didn't know what to do with it. Axel said to do what I like, but all I like is having ice cream with my friends—so that's what I ended up doing.\nAxel leaves tomorrow for some kind of mission. Which reminds me—I still haven't given him the WINNER stick yet."
    },
    {
      "Day": "Day 119",
      "Name": "Something to Protect",
      "Text": " Axel has been gone forever. It's been just me and Xion at the clock tower.\nWhile me and Xaldin explored Beast's Castle, we found something he wants to protect... Xaldin says that's a weakness, but I'm not so sure. What does it mean to care about something that much? I don't, so it's hard to wrap my head around the whole idea."
    },
    {
      "Day": "Day 149",
      "Name": "WINNER",
      "Text": "Today's mission took me to a new world. It was a weird place. I was up on the clock tower afterwards when Axel turned up after being away forever. He said he finished that long mission. But this time Xion didn't show.\nI was gonna give Axel that WINNER stick, but I should wait until I get another one. It wouldn't be fair to leave Xion out."
    },
    {
      "Day": "Day 150",
      "Name": "Too Precious to Lose",
      "Text": "Xion didn't come to the clock tower again today. She and Saïx had some kind of argument.\nAxel and I talked for a while about the things we can't bear to lose. Axel thinks that for Nobodies, it's our pasts, because that's all we have to remember the pain of losing something. I don't remember my past, but the idea of losing the present—Axel or Xion—scares me."
    },
    {
      "Day": "Day 151",
      "Name": "What Makes Us Different",
      "Text": "I ran into Xion in Twilight Town. I guess she messed up a mission pretty bad the other day, and it's been bugging her.\nWe went up to the clock tower afterwards. She said me and her are different—which is pretty obvious if you look at us, but I don't think that's what she meant. A lot seems to be on her mind, and it's not the same as what's on mine."
    },
    {
      "Day": "Day 152",
      "Name": "I Don't Get It",
      "Text": "I think Xion might be mad at me, but I don't know why. Axel says girls are complicated. You can't press the wrong buttons. Like I'm supposed to know what the right ones are."
    },
    {
      "Day": "Day 153",
      "Name": "No Taste for It",
      "Text": "It's hard spending time with Xion, and Axel seems busy, too. I've been having ice cream alone, but it's just not the same. All I taste is the salt, and my hands get all sticky. It's like I'm going through the motions of eating it just so I can throw the stick out and get on with life. I must've had about a hundred of these things, and I still haven't found another WINNER.\nI never did find a way to ask Xion about the pictures that go through my head. I don't really know what to do about anything right now."
    },
    {
      "Day": "Day 171",
      "Name": "What's Love?",
      "Text": "On my mission at Beast's Castle, Xaldin told me about \"love\" and the special power it has over people.\nI tried to ask Axel about it, but his explanation didn't make any sense to me. Every time I ask him about this kind of thing, he tells me I need a heart to understand. It's like he's dodging the questions."
    },
    {
      "Day": "Day 172",
      "Name": "Xion Collapsed",
      "Text": "Xion failed her mission and now she's in a deep sleep. I thought they were lying to me when they told me, but I went to see her, and she really was just asleep. I left a seashell by her pillow, just like she did for me.\nSaïx hates her. I don't know why. Maybe he knows more about her than the rest of us do.\nThose pictures flashed through my mind again on today's mission (the same boy in red as usual). I guess he's been to Wonderland. I'm still trying to figure out what it is I'm seeing."
    },
    {
      "Day": "Day 173",
      "Name": "Picking Up the Slack",
      "Text": "I've decided to work harder while Xion is asleep to pick up some of the slack. Axel said he asked Saïx about her, but no dice. He did say that Saïx was having second thoughts about calling her broken, though.\nI just hope we get all this drama ironed out soon, so she doesn't have to wake up to it."
    },
    {
      "Day": "Day 174",
      "Name": "Seashells for Her",
      "Text": "Xion hasn't woken up, but I'm pulling double duty to make up for it.\nMe and Axel talk about the dumbest stuff now. Afterwards we head back to the castle, and I leave a seashell by Xion's pillow. It would please me to see her smile when she finds them.\nThose pictures flashed through my head again in Never Land. And when I flew, it felt like I'd done it before. Has the guy in red flown before, is that it?"
    },
    {
      "Day": "Day 193",
      "Name": "Best Friends",
      "Text": "Xion's awake now. The three of us were gonna go get some ice cream after our mission, but she passed out again, so we had to take her home.\nI talked with Axel in her room until she woke up. He said the three of us were best friends—inseparable."
    },
    {
      "Day": "Day 194",
      "Name": "Even Far Apart",
      "Text": "We've all started going back to our usual spot after work. Sometimes Axel and Xion are there waiting for me, other times I get there first.\nThings have gotten busier for us, so we can't all make it every day. But even if they're not there, at least now it seems like we're together again. I wonder if it seems that way to them, too.\nI forgot to ask Xion about the pictures in my head again... It was the same kid in red. Who is he? What does he have to do with me?"
    },
    {
      "Day": "Day 224",
      "Name": "What's Gotten Into Her?",
      "Text": "I think something's wrong with Xion. Is she not feeling well again?\nAxel said we should all go to the beach next time we get a vacation. I think he senses something is wrong, too. That's why he suggested the beach—to make her feel better."
    },
    {
      "Day": "Day 225",
      "Name": "Something Must Be Wrong",
      "Text": "Okay, now I'm really worried about Xion. I told Axel, but all he said was that she'll get through it.\nHe knows something is wrong. I bet he's just telling me that to put my mind at ease. Well, it's not working."
    },
    {
      "Day": "Day 255",
      "Name": "Now Axel's Acting Weird",
      "Text": "I had ice cream with Axel after work today, but Xion didn't show.\nAxel said she got sent on an important mission, but he wouldn't look at me when he said it. I've been wondering what's wrong with Xion all this time, but now that I stop and think about it, Axel's not himself either."
    },
    {
      "Day": "Day 256",
      "Name": "Xion's Gone Missing",
      "Text": "Xion has gone missing, but nobody said anything about her being hurt, so that's good...I guess.\nDid she run off? That doesn't make any sense. Xemnas told us not to go after her. The way Saïx explained it, it's almost like they don't think she's worth getting back.\nWhat is going on?"
    },
    {
      "Day": "Day 257",
      "Name": "He's Avoiding Me",
      "Text": "I want to talk to Axel about Xion, but I can't seem to get ten seconds with the guy.\nWhat am I supposed to do? I can't believe he's avoiding me. We're supposed to be friends."
    },
    {
      "Day": "Day 276",
      "Name": "By the Sea",
      "Text": "I don't remember much about today's mission—just that it was by the beach. Or was it? The mission didn't even feel real.\nMe and Axel agreed to start looking for Xion tomorrow."
    },
    {
      "Day": "Day 277",
      "Name": "No Sign of Her",
      "Text": "I've looked everywhere for Xion, in every world, but there's just no sign of her.\nWhere is she? Why did she leave the Organization? I don't get it, any of it."
    },
    {
      "Day": "Day 296",
      "Name": "Castle Oblivion",
      "Text": "There's one place we haven't checked yet to see if Xion's there—Castle Oblivion. When I brought it up with Axel, he surprised me by saying that C.O. is where Xion comes from. I guess he just found out himself.\nIs that where she is?"
    },
    {
      "Day": "Day 297",
      "Name": "Who is That Guy?",
      "Text": "I went to Castle Oblivion to find Xion, but I don't remember anything about it. Axel said I collapsed as soon as I got there.\nI woke up in Twilight Town, and incredibly enough, Xion was there. But she wasn't alone—there was this guy with her, and he was wearing the Organization's cloak. I could tell by his build that he wasn't one of us, though. Who is he?"
    },
    {
      "Day": "Day 298",
      "Name": "Some Other Way",
      "Text": "I don't believe it. Axel attacked Xion. There had to have been some other way.\nI know she's acting weird, but I hardly recognize Axel these days either. What's going through their heads? I feel so left out."
    },
    {
      "Day": "Day 299",
      "Name": "Sora?",
      "Text": "Xemnas told me that \"Sora\" is the connection between me and Xion. But just who exactly is Sora?"
    },
    {
      "Day": "Day 300",
      "Name": "No Words",
      "Text": "For the first time in a while, the three of us met up on the clock tower. None of us really knew what to say.\nWe used to talk each other's ears off, but I guess those days are gone.\nSo much has happened lately that I've been forgetting to write about those pictures in my head. Now it happens even when I'm not on missions. More often, too.\nThey even show up in my dreams. Xion told me she has dreams, too. Is all of this connected?"
    },
    {
      "Day": "Day 301",
      "Name": "My Dream",
      "Text": "I dream all the time now, but I don't sleep well. I wake up tired every day. I guess that makes them nightmares, not dreams.\nXion and Axel don't come to the clock tower anymore. I thought maybe if I got everything off my chest with them, I might stop having the nightmares...but so much for testing that theory."
    },
    {
      "Day": "Day 321",
      "Name": "No Energy Left",
      "Text": "    I feel so tired—almost disconnected from my body. The dreams have gotten stranger. Now I wake up with water on my cheeks. I don't know how it got there, but I think there's something really wrong with me.\nToday I was teamed up with Xion. She seems to be in a lot better shape than me. We had ice cream together, something we hadn't done in a while."
    },
    {
      "Day": "Day 322",
      "Name": "Another Dream",
      "Text": "I had another dream. My head feels heavy.\nI want to have ice cream with Xion and Axel again."
    },
    {
      "Day": "Day 352",
      "Name": "Us and the Sunset",
      "Text": "Me and Xion and Axel had ice cream. The sunset was beautiful.\nI don't have to write anything else down, because I'll never forget this day."
    },
    {
      "Day": "Day 353",
      "Name": "Broken Trust",
      "Text": "Axel let Xion leave the Organization. Like he wanted her to go.\nShe's a puppet? A mirror that reflects me? He's talking nonsense. I can't trust him anymore."
    },
    {
      "Day": "Day 354",
      "Name": "Who Am I?",
      "Text": "I don't understand the Organization. I don't understand Axel... I understand myself least of all. Why do I keep coming back to the castle?\nMe and Xion are special, connected by \"Sora.\" If she's a puppet, maybe I am, too.\nI don't know what I am."
    },
    {
      "Day": "Day 355",
      "Name": "I Am",
      "Text": "I have to know who I am...\nI am DONE WITH THIS!"
    },
    {
      "Day": "Day 357",
      "Name": "Three Again?",
      "Text": "I'm going to set Kingdom Hearts free and find my way to Sora. I'm going to get Xion back. The three of us will have ice cream together again—I know it."
    }
  ]
}