{
  "SecretAnsemReports": [
    {
      "Name": "Secret Ansem Report 1",
      "Text": "My efforts these many years have come to fruition, with the world I govern having become a paradise worthy of being called \"Radiant Garden.\"\nNurtured by the pure water that is the source of life, fragrant flowers bloom in abundance, and the people face each day with hopeful smiles.\nBut where there is light, darkness also lurks. As noted in my earlier reports, I must solve the mystery of this \"darkness of the heart.\" This paradise depends on it.\nI shall perform an experiment to probe the depths of a person's heart. One of my own apprentices, Xehanort, has volunteered to be a subject.\nThe young man has served me ever since I nursed him back from death's door some years ago.\nHe had lost all his memories at the time, but later showed remarkable intellectual curiosity and readily absorbed my teachings, gaining deep wisdom. Any mental immaturity is surely due to his young age.\nIf I explore Xehanort's heart with psychological tests, I may be able to recall the past locked away within. My apprentice Even has also shown great interest in Xehanort's memories.\nBut is he really the right subject? Xehanort does indeed exhibit extraordinary talents...\nToo extraordinary...\nPerhaps they are even superhuman.",
      "Location": "After the Battle of the 1000 Heartless"
    },
    {
      "Name": "Secret Ansem Report 2",
      "Text": "I have made a grave mistake. My study of the \"darkness of the heart\" began with a simple psychological test and quickly snowballed.\nSpurred on by my youngest apprentice, Ienzo, I constructed a massive laboratory in the basement of my castle.\nUnbeknownst to me, my six apprentices then began collecting a large number of subjects on which to perform dangerous experiments into the \"darkness of the heart.\"\nAs soon as I found out, I called my apprentices together and ordered them not only to cease their studies, but to destroy the results of their research thus far.\nWhat on earth was happening within the hearts of my six beloved apprentices? While pursuing the mystery of the darkness of the heart, could they themselves have strayed into its depths?\nYet I remain the most foolish of all, for having begun these experiments.\nWe are not meant to interfere in the depths of another's heart, no matter what our reasons for doing so...\nAnd my error plunged me into despair.\nA visitor from another world soothed my dejected soul.\nA tiny king named Mickey came wielding a legendary key — the infamous \"Keyblade,\" said to bring both chaos and prosperity to the world.\nHe was very knowledgeable on many topics, and we deepened our friendship as we conversed companionably.\nUpon his advice, I decided to review the data obtained at my basement lab.\nThat is when I discovered the \"Ansem's Reports.\"\nThough they bore my name, the only one I had written was number 0.\nApparently he had gone on to pen numbers 1 through 8 himself.\nYes — the first subject in my foolish experiments.",
      "Location": "After meeting King Mickey at the Station Plaza"
    },
    {
      "Name": "Secret Ansem Report 3",
      "Text": "Chaos affects not only this world, but many other worlds besides.\nIn the \"Ansem's Reports\" my apprentice Xehanort had written under my name, I found the records of his hideous experiments along with his hypothesis about the door that had appeared out of the darkness in my basement.\nAll living things have hearts, and all hearts hold darkness deep within.\nWorlds are no exception. If a world is a being, the heart it holds must be colossal...\n...and the darkness at its core must be monstrous indeed.\nDid Xehanort pass through that door in an attempt to contact that dark realm?\nNo, not only Xehanort.\nIt appears my other five apprentices, believing it was for the sake of research, stared deep into the darkness and were pulled into it.\nEven, Ienzo, Braig, Dilan, and Aeleus...\nThey have ceased to be human.\nI, too, have had everything taken away from me, banished to a hollow realm of nothingness.\nWhat is Xehanort hoping to gain with my pilfered existence?\nWill my people cease to smile?\nIf the light of hope has been extinguished, I shall henceforth walk with darkness as a friend.\nHere, in the realm of nothingness to which I have been relegated.\nDarkness in the midst of nothing.\n\"Darkness in Zero.\"\nThus, I shall be known as DiZ.\nDiscarding the stolen name \"Ansem\"...\nAnd going in search of revenge.",
      "Location": "After defeating Xigbar"
    },
    {
      "Name": "Secret Ansem Report 4",
      "Text": "The distant days spent in that beautiful paradise are an illusion to me now.\nHow long have I been here, banished to the realm of nothingness?\nIt is only by relying upon my anger and hatred that I have been able to retain my sense of self here where all existence is nullified.\nMy heart is being overcome with hatred toward my apprentices, possessed by the darkness, and with the anger I feel for stupidly allowing myself to be betrayed.\nIs this darkness, eating away at my heart?\nI cannot continue to idle away my time here.\nWhat are Xehanort and the others attempting to do?\nI must unravel the mystery of these Ansem's Reports, intercept my apprentices, and defeat them.\nThat is my mission...the only way to repay the world for my sins.\nThose beings who lack hearts—the Heartless—must be the key.\nThe darkness of the heart, made flesh. Cursed shadows who not only lack hearts, but multiply by seizing hearts from any and all living things.\nWhere have they come from, and where are they going?\nThree elements combine to create a life: a heart, a soul, and a body.\nBut what of the soul and body left behind when the heart is lost?\nWhen the soul leaves the body, its vessel, life gives way to death, but what about when the heart leaves?\nA being does not perish when its heart leaves its body. The heart alone disappears into the darkness.\nThere is little time.\nIf I remain in this realm much longer, I will certainly learn these answers the hard way.\nMy heart is already a captive of the darkness.",
      "Location": "After defeating Xaldin"
    },
    {
      "Name": "Secret Ansem Report 5",
      "Text": "In this realm, where all existence has been disintegrated, I have just barely managed to preserve my sense of self by continuing to think and to write.\nIt is a place where even time has lost all meaning. Eternity is as but a moment here.\nI must make haste. Certainly their plans are already underway.\nThe Heartless must be the key to unraveling this mystery.\nThe six traitors were operating a laboratory that churned out those cursed shadows.\nNot only did they generate \"pureblood\" Heartless from living hearts, but they then used those Heartless to synthesize artificial versions of the creatures as well.\nThese synthetic Heartless bore insignias and were called \"Emblems.\"\nPureblood or Emblem, these Heartless act only to fulfill their instinctive needs. They single-mindedly detect hearts and swarm around them.\nA human's commands would be ineffective: the Heartless would easily steal the human's heart and use it to increase their own ranks.\nBut what if an even stronger Heartless was giving the orders?\nIf he cast aside his own soul and body and became a Heartless, wouldn't he be able to control the otherwise intractable Heartless?\nFurthermore, wouldn't he be planning to make use of the creatures' instincts? If the heart-seeking Heartless have their sights set on a larger, more powerful heart, their ultimate goal is crystal-clear.\nThe largest heart in existence—the heart of the world.\nThis is all conjecture, but it would seem he is utilizing the Heartless in his search for a path leading to the heart of the world.",
      "Location": "After defeating Demyx for the first time"
    },
    {
      "Name": "Secret Ansem Report 6",
      "Text": "My choice to befriend darkness here in the midst of nothingness was a sound one.\nThe moment I stared straight ahead with a calm heart, neither rejecting darkness nor fearing it, I gained a newfound power.\nA superhuman power—the power of darkness.\nIt is likely Xehanort and the others were enraptured by this power, eventually becoming its prisoners.\nI do not intend to allow my heart to be devoured by the darkness, as they did, of course.\nWith this new power, I uncovered a \"corridor of darkness\" that connects the realm of nothingness to the outside world. While it is still difficult to come and go as I please, my banishment is now a thing of the past.\nTo deceive Xehanort and my apprentices, I first used my power to change form before returning to the realm of light.\nAs I had suspected, Xehanort had become a Heartless.\nUnder my name, he commanded other Heartless in quests to snatch away the hearts of many different worlds.\nAt the center of the heart Xehanort has stolen was \"Kingdom Hearts,\" which attracts tremendous darkness itself and attempts to send any and all matter back into its depths.\nThe other five have disappeared. Have they become Heartless, like Xehanort?\nOr did they vanish after Xehanort exploited them?\nI became familiar with an unusual \"entity\" while pursuing the truth.\nIt is the soul and body that remain when a being loses its heart.\nWhen a Heartless is born, these entities disappear from the realm of light, to be reborn as entirely new beings in a completely different realm.",
      "Location": "After defeating Grim Reaper for the second time"
    },
    {
      "Name": "Secret Ansem Report 7",
      "Text": "While beings born of darkness and those lacking hearts may find them convenient, it is dangerous for others to make much use of the corridors of darkness. Darkness erodes the heart.\nIn search of a place to proceed with my research and planning away from prying eyes, I found myself in \"Twilight Town.\" It is a quiet village, forgotten in the chasm between light and darkness. I situated myself in the basement of an abandoned mansion standing beyond the woods.\nMy underground research resulted in one new discovery after another.\nWhen a Heartless is born, the body and soul left behind are reborn into this world as a different being.\nThey possess different intentions than their Heartless brethren, and while it is unclear what these sentient \"things\" are after, it would appear they are responsible for much bedlam in the world.\nMy erstwhile friend the King and his subjects, along with a hero wielding the Keyblade, are battling the Heartless even as a new threat approaches.\nThis new threat...they have given themselves a fitting name, I suppose.\nThese non-beings: \"Nobodies.\"\nA great number of Nobodies have lost human form, as have the Heartless. Yet the Nobody born of someone with a strong heart retains its shape, with but the faintest visible changes.\nIt appears my betrayers have retained their human forms as Nobodies, and are gathering more followers in hopes of furthering a new scheme.\n\"Organization XIII,\" formed of 13 Nobodies with my betrayers at its core, has divided into two; they are said to be carrying out some sort of research.\nSeeking to uncover the plans of this Organization, I have decided to head for where six of its members have gathered. Towering over the outer limits of the realm between darkness and light:\nCastle Oblivion.",
      "Location": "After defeating Nobodies attacking the gate in Hollow Bastion during first visit"
    },
    {
      "Name": "Secret Ansem Report 8",
      "Text": "It appears that I have been too distracted by the behavior of Xehanort and his cohorts, and the events occurring in their vicinity.\nMy friends' struggle to protect the realm of light from the threat of Heartless is now over, with Xehanort's Heartless—going by the name Ansem, Seeker of Darkness—defeated at last.\nThe other wielder of the Keyblade, this \"hero,\" traveled from world to world sealing up keyholes and laying Heartless low.\nMeanwhile, the King, who had dived into the realm of darkness, worked with the Keyblade-wielding hero to close the door to Kingdom Hearts from the realms of both darkness and light, thus holding off the threat of tremendous darkness.\nBut there are still a great number of Heartless afoot, and Organization XIII and the Nobodies continue to be active in the shadows.\nIndeed, the world is still a very dangerous place.\nWe must find a way to do battle with these enemies.\nThus I will both make amends and have my revenge.\nIt is for this reason that I infiltrated Castle Oblivion.\nIt consists of 13 floors above and 12 floors below ground, with the contents of its \"White Rooms\" transforming in response to its visitors' memories. Organization XIII was conducting experiments on memory here.\nThe subject in these experiments, a girl named Naminé, appeared to possess extremely unusual abilities.\nWere they attempting to derive something from these powers?\nRefusing to be distracted by Organization XIII, I had returned to my own secret research when a new visitor appeared at the castle today.\nIt was Sora, the Keyblade-wielding hero who had defeated Ansem, and his companions.\nDeep underground, the stench of darkness arose.\nAll the players are coming together, it would seem.",
      "Location": "after defeating defeating Roxas"
    },
    {
      "Name": "Secret Ansem Report 9",
      "Text": "I should have expected nothing less from a Keyblade-wielding hero.\nSora and friends defied the machinations of Organization XIII and rescued Naminé.\nNaminé was a witch who controlled the memories of others.\nMost likely these powers were achieved through a special process when she was born.\nNaminé is a Nobody, created when a young girl's heart left her body.\nYet she has no corresponding Heartless.\nThis is because the \"young girl\" in this case was a princess.\nKairi, a resident of Radiant Garden over which I had ruled, was one of the Seven Princesses that uphold the realm of light.\nWith no darkness in her heart, Kairi produced no Heartless, and instead of vanishing, her body remained in the realm of light.\nIn other words, both the Nobody called Naminé and the Heartless—proof of a lost heart—are extremely unstable beings who lack the bodies needed to produce a Nobody. Therefore, they also lack Kairi's memories. One reason for this maybe that Kairi's heart did not return to the darkness when separated from her body, but rather migrated to another vessel...deep within Sora's heart.\nThat is, Naminé is an alter ego of the Kairi who has directly interfered with Sora's heart. Could this be why Sora and those hearts are connected to him were able to have their memories controlled?\nShe is a \"non-being\" in the truest sense of the word; having not even become a Nobody and with nowhere left to go, she is but the most fleeting of shadows.",
      "Location": "After defeating Luxord"
    },
    {
      "Name": "Secret Ansem Report 10",
      "Text": "Sora went to sleep in order to recover the memories he had lost in Castle Oblivion.\nIt would take quite some time to bring back all the memories he had created in his lifetime.\nBut Organization XIII held sway over Castle Oblivion. Sora would need to be kept someplace more secure.\nI persuaded Naminé to move the slumbering Sora to Twilight Town for safekeeping.\nNaminé.\nAs I have written before, she is a most unusual being.\nBorn of the same process as a Nobody, but lacking virtually all the elements of a Nobody.\nPerhaps she continues drawing in hopes of capturing that which she lacks: the memories of others, especially Sora.\nI have arrived at a hypothesis.\nI believe that Naminé was born as a special type of Nobody when Sora attacked himself with the Keyblade, causing his and Kairi's hearts to leave their bodies simultaneously.\nNaminé emerged as Kairi's Nobody...but the body and soul necessary to exist as a Nobody belonged to Sora.\nWhen a person's heart is stolen, a Heartless is born with no sense of self, and the body and soul left behind give rise to a Nobody.\nBut what if one willingly releases one's heart from one's body?\nSora and Xehanort retained their selfhood even after becoming Heartless.\nThen there are Kairi and Naminé.\nKairi was exceptional for having had no darkness within her heart. Also exceptional was that her heart, once freed, migrated to a new vessel—Sora.\nThe combination of the two theoretically unlikely exceptions may be behind this anomaly.\nThere are matters I must attend to while Sora is sleeping.\nA new ally has appeared on the scene: Riku.",
      "Location": "After arriving to Simulated Twilight Town"
    },
    {
      "Name": "Secret Ansem Report 11",
      "Text": "I was reunited with an old friend at Castle Oblivion, but was unable to disclose my identity.\nIf he knew the situation, he would likely try to stop me from carrying out my revenge.\nAs much as I would dearly love to converse with him as in the old days...that is now but a hopeless dream.\nMy friend has been fighting in the realm of darkness. Most likely he found his way there through Traverse Town.\nLike Castle Oblivion, that village also rests in the cleft between light and dark. It consists of the remnants of worlds whose hearts have been stolen by the Heartless.\nIt is where those who have barely escaped the destruction of their worlds eventually find themselves.\nThis \"realm between\" is quite unstable, with corridors of darkness appearing from time to time.\nWhenever a world disappears, some of its inhabitants must arrive here through these corridors. Surely Sora traveled these same corridors of darkness when he first came to Traverse Town.\nIt seems my friend, fighting in the realm of darkness, appeared in Castle Oblivion through a corridor of darkness constructed by Organization XIII.\nMy new ally Riku also effected his return via one of these corridors.\nHe swore to me he would give his all for his best friend Sora.\nIn fact, Sora's memories have been slow to return.\nThus I have asked Riku to bring me another Sora—his Nobody.\nSora is indispensable if I am to achieve my goal.\nI require the Keyblade-wielding hero to fly through the realm of light and defeat Organization XIII.",
      "Location": "After Riku regains his normal appearance"
    },
    {
      "Name": "Secret Ansem Report 12",
      "Text": "Apart from Naminé, Nobodies retain their memories of their time as humans, but Sora's Nobody, Roxas, has lost Sora's memories.\nThis is likely because Sora's time as a Heartless was short, having recovered his heart and returned to his human form soon after leaving behind Roxas, his Nobody.\nIt would seem Roxas is much like Naminé. Naminé is Kairi's Nobody, but came into being via Sora's body and soul.\nLikewise, Roxas is Sora's Nobody, but was left behind because Sora's Heartless regained human form using Kairi's heart instead of his own.\nIt may be that Sora's memories are slow to return because the half of him that Roxas is still lacking.\nI must convert Roxas into data and return him to Sora.\nAs a member of Organization XIII, it was exceedingly difficult to bring Roxas in. Having lost to Roxas once, Riku laid everything on the line and used the power of darkness in their second battle, only just managing to bring Roxas back with him.\nBut Organization XIII grows ever nearer. Here, Twilight Town, is where Roxas was reborn as a Nobody.\nThis is where Roxas first encountered Organization XIII and joined its ranks. They are bound to search this place thoroughly.\nFirst I shall convert all of Twilight Town into data and construct a \"world duplicate\" in Sora's memories. I shall place Roxas within that world to live out his days and regain those memories.\nThere is little time.\nThe Organization's schemes must be making steady progress as well.",
      "Location": "After defeating Saïx"
    },
    {
      "Name": "Secret Ansem Report 13",
      "Text": "Tomorrow Sora awakens.\nMy long and drawn-out revenge is nearing its end.\nXehanort, who took everything away from me. Though as a Heartless he is no more, as the leader of Organization XIII his ambition once again is to capture Kingdom Hearts, the most colossal heart of all.\nHis Heartless had attempted to draw out the great darkness of Kingdom Hearts, created from the hearts of all worlds. His Nobody, however, is now almost finished gathering human hearts to be assimilated into Kingdom Hearts as well.\nThe fool!\nOnly one mystery remains.\nHow did Xehanort manage to open the door that appeared in the basement of my castle...?\nNo...any theory posited now, when everything is nearing completion, would be meaningless.\nRoxas, Ansem, Naminé...\nThey defy all logic, yet there they are: singular exceptions to the rule.\nThe theories proposed by me and by Organization XIII have been blown to pieces by a handful of strong-hearted individuals.\nSora, Kairi, Riku.\nAh, yes—Riku.\nThough his heart has its weaknesses, making it prone to darkness, he found support in the hope he discovered beyond suffering.\nThis hope allowed him to stand his ground and turn the darkness in his heart from an enemy into his greatest weapon.\nWhen all this is over, it is my fervent hope that he will be able to return with Sora to his island.\nIf I can, I should like to return to Radiant Garden, to look once more upon the beautiful water, the lovely flowers, and the hopeful smiles of the people.\nDear King, my friend!\nI believe that, at some point in time, you will come across these, my truthful accounts.\nHow I wish I could have chatted with you again.\nI was a fool, obsessed with revenge.\nForgive me.",
      "Location": "After defeating Xemnas for the first time"
    }
  ]
}