{
  "Enemies": {
    "Kingdom Hearts": [
      {
        "Title": "Air Pirate",
        "Description": "Winged Heartless that mostly appear in Neverland. They are extremely combative and are hardly ever caught off guard. They attack with martial-arts-like techniques.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Air Pirate(s)" ]
      },
      {
        "Title": "Air Soldier",
        "Description": "Winged Heartless. They fly over their enemies and dive to strike them. Their high endurance and quickness make them tough to beat.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Air Soldier(s)" ]
      },
      {
        "Title": "Angel Star",
        "Description": "Flying Heartless that cast potent spells. They are born of holy spells. They attack from long range with magic. They block physical attacks with their wings, making them difficult to defeat.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Angel Star(s)" ]
      },
      {
        "Title": "Aquatank",
        "Description": "Heartless resembling a fish that calmly swim the seas. They are often carrying Screwdivers. Leisurely large creatures that do not attack unless provoked.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Aquatank(s)", "Screwdiver(s)" ]
      },
      {
        "Title": "Arch Behemoth",
        "Description": "A Behemoth subspecies. Although similar in appearance to the Behemoth, it lacks their aptitude. However, it shares their strengths and weaknesses.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Arch Behemoth(s)", "Behemoth(s)" ]
      },
      {
        "Title": "Bandit",
        "Description": "Heartless that mostly appear in Agrabah. They can travel under the sand. They attack deftly with a long sword. Attack them with caution.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Bandit(s)" ]
      },
      {
        "Title": "Barrel Spider",
        "Description": "Gunpowder barrel turned Heartless. They charge into their enemies and explode. Any physical impact or fire will set them off.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Barrel Spider(s)" ]
      },
      {
        "Title": "Battleship",
        "Description": "Heartless that fused together with a pirate ship. They attack with homing and magic projectiles. Attack them at close range.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Battleship(s)" ]
      },
      {
        "Title": "Behemoth",
        "Description": "Immensely powerful Heartless. With their large frame, they trample enemies, and repel most attacks. Damaging their weak point makes them lose consciousness. Strike them with potent attacks while they are down.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Behemoth(s)" ]
      },
      {
        "Title": "Black Ballade",
        "Description": "A Heartless that confuses its enemy by creating projections of itself. If the copies are attacked, it will resort to counterattacks and eventually run away. However, if it is attacked directly and relentlessly...",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Black Ballade(s)" ]
      },
      {
        "Title": "Black Fungus",
        "Description": "Hostile Heartless, unlike White Mushrooms. They attack with poison. Defeating them may bring good things, but it is not easy.",
        "Worlds": [ ":None:" ],
        "Characters": [ "Black Fungus(i)" ]
      },
      {
        "Title": "Blue Rhapsody",
        "Description": "Spellcasting Heartless. They approach their enemies by bouncing about and attack with Blizzard and absorb blizzard attacks.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Blue Rhapsody(ies)" ]
      },
      {
        "Title": "Bouncywild",
        "Description": "Heartless resembling a monkey. Unlike Powerwilds, they attack from long range with a sling shot. They scamper about during battle, making them difficult to hit.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Bouncywild(s)" ]
      },
      {
        "Title": "Chimera",
        "Description": "A Heartless wandering the streets of Halloween Town. Generally a slow-paced creature, it attacks quickly and relentlessly when angered. Armed with various abilities such as summoning Gargoyles, one must use this creature's own tricks against it.",
        "Worlds": [ "Halloween Town" ],
        "Characters": [ "Chimera(s)", "Gargoyle(s)" ]
      },
      {
        "Title": "Darkball",
        "Description": "Heartless born purely out of darkness. Their movements are unpredictable, as they often make sudden moves and attacks.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Darkball(s)" ]
      },
      {
        "Title": "Darkside",
        "Description": "Enormous Heartless that appeared in Destiny Islands with Shadows. It led the Shadows in the battle against Sora when he first received the Keyblade. Although Sora defeated it, the island was swallowed by the darkness.",
        "Worlds": [ "Destiny Islands" ],
        "Characters": [ "Darkside(s)", "Shadow(s)", "Sora" ]
      },
      {
        "Title": "Defender",
        "Description": "Heartless that mostly appear in Hollow Bastion. They carry an eerie shield with a face that casts Fire and Blizzard and bites nearby enemies.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Defender(s)" ]
      },
      {
        "Title": "Destroyed Behemoth",
        "Description": "A greater Behemoth subspecies. It has extraordinary strength, unparalleled to that of the Behemoth. However, despite its appearance and size, it shares the same weaknesses as the standard archetype.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Destroyed Behemoth(s)", "Behemoth(s)" ]
      },
      {
        "Title": "Fat Bandit",
        "Description": "Heartless that mostly appear in Agrabah. They are well-balanced offensively and defensively. Besides strong physical attack, they use fire, and they block attacks against them. Their movement is their weakness.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Fat Bandit(s)" ]
      },
      {
        "Title": "Gargoyle",
        "Description": "Winged Heartless that mostly appears in Halloween Town. They can move from one place to another almost without notice. Since they are prone to sneak attack, they often get caught off guard by counter attacks.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Gargoyle(s)" ]
      },
      {
        "Title": "Gigas Shadow",
        "Description": "A large Heartless similar to a Shadow. Like its predecessor, it's quite persistent and will chase its target around. If it just does the littlest amount of damage to Sora, it will fade out of sheer happiness.",
        "Worlds": [ "Wonderland" ],
        "Characters": [ "Gigas Shadow(s)", "Shadow(s)", "Sora" ]
      },
      {
        "Title": "Grand Ghost",
        "Description": "A Heartless similar to the Search Ghost, often spotted within Monstro. Weapon attacks do no damage, only causing items to drop. Approach the phantom and use said items for a startling discovery.",
        "Worlds": [ "Monstro" ],
        "Characters": [ "Grand Ghost(s)", "Search Ghost(s)" ]
      },
      {
        "Title": "Green Requiem",
        "Description": "Spellcasting Heartless. They heal themselves and other Heartless with Cure. They are slow-moving, but hover high in the air and absorb most magic attacks.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Green Requiem(s)" ]
      },
      {
        "Title": "Guard Armor",
        "Description": "Leader of the Heartless in Traverse Town. It falls apart when it receives damage, but each part attacks individually. Sora meets Donald and Goofy for the first time just before fighting this Heartless.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Guard Armor", "Sora", "Donald", "Goofy" ]
      },
      {
        "Title": "Invisible",
        "Description": "Heartless wielding a large sword. These winged Heartless can move freely through the air. Besides their sword, they attack with their tail and wings. With their high attack power, they often defeat their foes quickly.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Invisible(s)" ]
      },
      {
        "Title": "Jet Balloon",
        "Description": "A Heartless similar to the Aquatank. It flies through the air with tremendous speed. Chasing it will lead to a perilous aerial battle as it unloads its Missile Drivers attack, an attack similar to the Screwdivers. Its heinous nature attracts them to prey who carry lots of munny.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Jet Balloon(s)", "Aquatank(s)", "Missle Driver(s)", "Screwdiver(s)" ]
      },
      {
        "Title": "Kurt Zisa",
        "Description": "Heartless who emerged from the Keyhole opened by the princesses. He swung his six powerful arms to attack Sora and company and block their attacks. But Sora sought out his weakness and emerged the victor.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Kurt Zisa", "Sora" ]
      },
      {
        "Title": "Large Body",
        "Description": "Big round Heartless. They seem tame and laid-back, but go berserk when they are angered. With their brute strength, they can inflict great damage, so be on your guard.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Large Body(ies)" ]
      },
      {
        "Title": "Neoshadow",
        "Description": "A Heartless that travels in packs. Combining their powers allows them to attack Sora while also healing themselves. Leaving even just one alive will result in a never-ending battle.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Neoshadow(s)", "Sora" ]
      },
      {
        "Title": "Opposite Armor",
        "Description": "Heartless that guards the keyhole in Traverse Town. It is a modified form of Guard Armor, but is more powerful.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Opposite Armor", "Guard Armor" ]
      },
      {
        "Title": "Parasite Cage",
        "Description": "Heartless that appeared inside Monstro. It's known to swallow its enemies. Sora and the others rescue Pinocchio, who was trapped inside it.",
        "Worlds": [ "Monstro" ],
        "Characters": [ "Parasite Cage", "Sora", "Pinocchio" ]
      },
      {
        "Title": "Phantom",
        "Description": "Ghostlike Heartless who haunted the clock tower standing far away from Neverland. Fluttering his eerie cloak, he cast a spell to take Sora's heart. Having no physical body, regular attacks were useless, but in the end Sora and company discovered his weakness and prevailed.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Phantom", "Sora" ]
      },
      {
        "Title": "Pink Agaricus",
        "Description": "A colossal Heartless called forth by euphoric White Mushrooms. A dancer by nature, once it starts dancing, it can't stop.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Pink Agaricus(i)" ]
      },
      {
        "Title": "Pirate",
        "Description": "Heartless that mostly appear in Neverland. They are quite combative with their swords. They often just focus on the enemies in front, making them vulnerable to attacks from behind.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Pirate(s)" ]
      },
      {
        "Title": "Pot Centipede",
        "Description": "Heartless called by Jafar to stop Aladdin. Its long body is composed of a number of Pot Spiders linked together. Even if its body comes apart, it can regenerate itself by gathering other pots.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Centipede", "Jafar", "Aladdin", "Pot Spider(s)" ]
      },
      {
        "Title": "Pot Scorpion",
        "Description": "An ordinary pot turned Heartless by the power of darkness. Unlike the Pot Spider, its pot is tough as nails. A simple attack won't be enough to make it cry for mercy. It emanates poisonous fumes as it attacks its prey.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Scorpion(s)", "Pot Spider(s)" ]
      },
      {
        "Title": "Pot Spider",
        "Description": "Ordinary pots turned Heartless. They lie in wait as ordinary pots, then reveal themselves and attack when their enemies draw near.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Spider(s)" ]
      },
      {
        "Title": "Powerwild",
        "Description": "Heartless resembling a monkey. With great physical strength and agility, they often strike with combination attacks. Avoid close-range battles with them if possible.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Powerwild(s)" ]
      },
      {
        "Title": "Rare Truffle",
        "Description": "Non-attacking Heartless that are rarely found. They like to jump, so helping them stay in the air may bring good things.",
        "Worlds": [ ":None:" ],
        "Characters": [ "Rare Truffle(s)" ]
      },
      {
        "Title": "Red Armor",
        "Description": "A giant Heartless similar to the Guard Armor. It splits into the Armored Torso, Gauntlets, and Hammer Legs, each with the ability of individual movement. Each body part can be found heading a team in a Coliseum tournament.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Red Armor", "Guard Armor" ]
      },
      {
        "Title": "Red Nocturne",
        "Description": "Spellcasting Heartless. While hovering about, they attack by casting Fire. Having low HP, they keep their distance from their opponents, making them difficult to attack. They absorb fire attacks.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Red Nocturne(s)" ]
      },
      {
        "Title": "Screwdiver",
        "Description": "Heartless that acts with Aquatank. Unpredictable creatures, dashing forward one minute, cowardly retreating the next. They are invigorated by the sparks from Aquatank.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Screwdiver(s)", "Aquatank(s)" ]
      },
      {
        "Title": "Sea Neon",
        "Description": "Heartless resembling jellyfish. They swim fast, and attack in numbers. Overall, they are not tough opponents.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Sea Neon(s)" ]
      },
      {
        "Title": "Search Ghost",
        "Description": "Heartless that mostly appear in Atlantica. They roam in dark areas and emit light from their eye to target their enemies. They can warp from one place to another.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Search Ghost(s)" ]
      },
      {
        "Title": "Shadow",
        "Description": "Heartless that emerge from various places. They sneak up to their enemies and strike them with sharp claws. They are extremely tenacious, often chasing their prey to the end.",
        "Worlds": [ "Destiny Islands" ],
        "Characters": [ "Shadow(s)" ]
      },
      {
        "Title": "Sheltering Zone",
        "Description": "Heartless resembling a jellyfish. You receive damage just from colliding with it. They move slow, but break up into many Sea Neons if struck. They fling their tentacles away to keep their enemies away.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Sheltering Zone(s)" ]
      },
      {
        "Title": "Sneak Army",
        "Description": "A Heartless similar to but more powerful than the Stealth Sneak. They stay hidden and attack while nimbly darting around. Though even one is hard to handle, a pair can be found participating in the Coliseum tournament.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Sneak Army(ies)", "Stealth Sneak(s)" ]
      },
      {
        "Title": "Sniperwild",
        "Description": "A Heartless resembling a monkey. It roams as it pleases, rarely paying attention to its surroundings. If Sora is spotted, it will call forth numerous allies, all armed with slingshots.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Sniperwild(s)" ]
      },
      {
        "Title": "Soldier",
        "Description": "Heartless that emerge from various places. They are brisk in their movements, and rush into their opponents. However, they are not that tenacious. They often appear in numbers, though they lack teamwork.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Soldier(s)" ]
      },
      {
        "Title": "Stealth Sneak",
        "Description": "Heartless that attuned to the darkness in Clayton's heart. It somehow manipulated the light to turn invisible and fought alongside Clayton.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Stealth Sneak(s)", "Clayton" ]
      },
      {
        "Title": "Stealth Soldier",
        "Description": "A stealthy Heartless similar in appearance to a Soldier. It appears alongside other Heartless and deals attacks from afar. Although a troublesome enemy, it shows itself once its weakness is uncovered.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Stealth Soldier(s)", "Soldier(s)" ]
      },
      {
        "Title": "Trickmaster",
        "Description": "Heartless that Sora and company encounter while they searched for Alice. His herky-jerky attacks and juggling act flustered Sora and the others.",
        "Worlds": [ "Wonderland" ],
        "Characters": [ "Trickmaster", "Sora", "Alice" ]
      },
      {
        "Title": "White Mushroom",
        "Description": "Non-attacking, friendly Heartless. They might give you an item if you help them.",
        "Worlds": [ ":None:" ],
        "Characters": [ "White Mushroom(s)" ]
      },
      {
        "Title": "Wight Knight",
        "Description": "Heartless that mostly appear in Halloween Town. Their jerky, dancelike attack moves are fairly easy to dodge, but cause large damage.",
        "Worlds": [ "Halloween Town" ],
        "Characters": [ "Wight Knight(s)" ]
      },
      {
        "Title": "Wizard",
        "Description": "Heartless that attack with various powerful spells. Eludes enemy attacks by teleporting, making them tough to beat.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Wizard(s)" ]
      },
      {
        "Title": "Wyvern",
        "Description": "Giant Heartless that attack from the air. They are quite swift for their size and are hard to attack, especially while they are high in the air. Counterattacking when they come down would be most effective.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Wyvern(s)" ]
      }
    ],
    "Kingdom Hearts Re:Chain of Memories": [
      {
        "Title": "Air Pirate",
        "Description": "A winged Heartless that mostly sticks to Neverland. \r\nIt's not armed, but it doesn't need to be. The Air Pirate deals a brutal punch right after its fist flashes. \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Air Pirate(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Air Soldier",
        "Description": "A winged Heartless. It swoops down onto its opponent's head or slams into them when they let their guard down. \r\nThe Air Soldier is swift, resilient, and not easy to ground. \r\n",
        "Worlds": [
          "Agrabah",
          "Monstro",
          "Twilight Town"
        ],
        "Characters": [
          "Air Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Aquatank",
        "Description": "A fish-like Heartless that lazily wanders the sea. \r\nThe Aquatank attacks with Thunder or by whirling its sizable body about. \r\n",
        "Worlds": [
          "Atlantica"
        ],
        "Characters": [
          "Aquatank(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bandit",
        "Description": "A Heartless that mainly appears in Agrabah. \r\nThe Bandit deftly wields the scimitar it carries, and should be approached cautiously. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Barrel Spider",
        "Description": "A gunpowder-packed barrel transformed by the darkness into a Heartless. \r\nThe Barrel Spider sets upon anyone foolish enough to think it's an ordinary barrel. \r\n",
        "Worlds": [
          "Monstro",
          "Neverland",
          "Agrabah",
          "Olympus Coliseum",
          "Twilight Town",
          "Destiny Islands"
        ],
        "Characters": [
          "Barrel Spider(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Black Fungus",
        "Description": "An aggressive, poisonous Heartless, not to be confused with the White Mushroom. \r\nThe Black Fungus likes to paralyze its foes and toy with them. \r\nIt's tough to beat, but victory doesn't go unrewarded... \r\n",
        "Worlds": [],
        "Characters": [
          "Black Fungus(i)",
          "White Mushroom(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blue Rhapsody",
        "Description": "A magic-wielding Heartless that drifts through the air. \r\nThe Blue Rhapsody attacks with Blizzard once it's close enough, and absorbs ice damage. \r\n",
        "Worlds": [
          "Traverse Town",
          "Olympus Coliseum",
          "Castle Oblivion"
        ],
        "Characters": [
          "Blue Rhapsody(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bouncywild",
        "Description": "A simian Heartless. \r\nIt teases its enemies and throws banana peels from far away. Be careful not to slip! \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Bouncywild(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Card Soldier",
        "Description": "Guards in the service of the Queen of Hearts. They fear her temper and will do anything she orders. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Card Soldier(s)",
          "Queen of Hearts"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Creeper Plant",
        "Description": "A flower-like Heartless. \r\nIt's rooted in one place, but staying far away isn't enough, since it can spit seeds and attack from below with its sharp roots. \r\n",
        "Worlds": [
          "Wonderland",
          "Halloween Town",
          "Destiny Islands"
        ],
        "Characters": [
          "Creeper Plant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Crescendo",
        "Description": "A hopping, horn-like Heartless. \r\nIt's a bothersome foe that can honk and call other Heartless. \r\n",
        "Worlds": [
          "Wonderland",
          "Neverland",
          "Destiny Islands"
        ],
        "Characters": [
          "Crescendo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkball",
        "Description": "A Heartless made from the very shadows of darkness. \r\nThe Darkball mostly just bobs through the air, but its random weaving and biting are a nuisance. \r\n",
        "Worlds": [
          "Atlantica",
          "Neverland",
          "Hollow Bastion",
          "Destiny Islands",
          "Castle Oblivion"
        ],
        "Characters": [
          "Darkball(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside (Sora’s Story)",
        "Description": "The Heartless that attacked Sora's home, Destiny Islands. \r\nSora fought valiantly to protect the islands and his memories there. \r\n",
        "Worlds": [
          "Destiny Islands"
        ],
        "Characters": [
          "Darkside(s)",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside (Reverse/Rebirth)",
        "Description": "The Heartless Riku attracted when he was seduced by darkness. It destroyed Destiny Islands. \r\nZexion called Darkside in order to subdue Riku. \r\n",
        "Worlds": [
          "Destiny Islands"
        ],
        "Characters": [
          "Darkside(s)",
          "Zexion",
          "Riku"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Defender",
        "Description": "A Heartless that primarily resides in Hollow Bastion. \r\nIts shield stops head-on physical and magical attacks, and can launch fireballs. \r\nThe Defender is also a skilled card user, and will break the cards of unprepared opponents. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Castle Oblivion"
        ],
        "Characters": [
          "Defender(s)",
          ""
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fat Bandit",
        "Description": "A Heartless that mainly appears in Agrabah. \r\nThe Fat Bandit repels frontal attacks with its jiggly belly and spits fireballs. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fat Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gargoyle",
        "Description": "A winged Heartless that mainly appears in Halloween Town. \r\nIt pelts its stunned opponents with fireballs. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Gargoyle(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Green Requiem",
        "Description": "A magic-wielding Heartless that drifts through the air. It doesn't attack, but it can cast Cure to heal other Heartless. \r\nThe Green Requiem is slow, but is healed by basic elemental magic, making it tough to squash. \r\n",
        "Worlds": [
          "Agrabah",
          "Monstro",
          "Castle Oblivion"
        ],
        "Characters": [
          "Green Requiem(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Guard Armor (Sora's Story)",
        "Description": "A Heartless that haunts Traverse Town. \r\nIt appeared when the bells rang to wreak havoc on the town. \r\n",
        "Worlds": [
          "Traverse Town"
        ],
        "Characters": [
          "Guard Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Guard Armor (Reverse/Rebirth)",
        "Description": "A Heartless that haunts Traverse Town. It appeared before Riku as a token of the indelible darkness in his heart. \r\n",
        "Worlds": [
          "Traverse Town"
        ],
        "Characters": [
          "Guard Armor(s)",
          "Riku"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Large Body",
        "Description": "A rotund Heartless. \r\nThe Large Body repels frontal attacks with its jiggly belly. Sometimes it throws its weight around and shakes the ground, so jumping is key. \r\n",
        "Worlds": [
          "Wonderland",
          "Olympus Coliseum",
          "Monstro"
        ],
        "Characters": [
          "Large Body(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Neoshadow",
        "Description": "A nimble Heartless that swims through the shadows. \r\n",
        "Worlds": [
          "Castle Oblivion"
        ],
        "Characters": [
          "Neoshadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Parasite Cage (Sora's Story)",
        "Description": "A Heartless that dwelled inside Monstro. \r\nThe Parasite Cage is quite the gourmand and eats anything in its path. Pinocchio figured out how to escape Monstro after getting gobbled up by it. \r\n",
        "Worlds": [
          "Monstro"
        ],
        "Characters": [
          "Parasite Cage(s)",
          "Pinocchio"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Parasite Cage (Reverse/Rebirth)",
        "Description": "A Heartless that dwelled inside Monstro. It appeared before Riku as a token of the indelible darkness in his heart. \r\n",
        "Worlds": [
          "Monstro"
        ],
        "Characters": [
          "Parasite Cage(s)",
          "Riku"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pirate",
        "Description": "A Heartless that mostly sticks to Neverland. \r\nA skilled swordsman, the Pirate can knock its enemies out cold and then finish them off with a vicious combo. If its sword flashes, watch out! \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Pirate(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Powerwild",
        "Description": "A simian Heartless that excels at jumping. \r\nIt has destructive instincts and attacks with punches and sliding kicks. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Powerwild(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Red Nocturne",
        "Description": "A magic-wielding Heartless that drifts through the air. It's flighty and hard to hit. \r\nThe Red Nocturne attacks with Fire from a distance, and absorbs fire damage. \r\n",
        "Worlds": [
          "Traverse Town",
          "Wonderland",
          "Castle Oblivion"
        ],
        "Characters": [
          "Red Nocturne(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Screwdiver",
        "Description": "A Heartless that likes to team up with the Aquatank. \r\nIt attacks with a spear or charges its enemies. \r\n",
        "Worlds": [
          "Atlantica"
        ],
        "Characters": [
          "Screwdriver(s)",
          "Aquatank(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sea Neon",
        "Description": "A jellyfish-like Heartless. \r\nIt might look laid back, but the Sea Neon's long tentacles can propel it towards enemies for a ferocious attack. \r\n",
        "Worlds": [
          "Atlantica"
        ],
        "Characters": [
          "Sea Neon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Search Ghost",
        "Description": "A spooky Heartless. \r\nThe Search Ghost can warp out of harm's way and absorb enemies' HP, making it a tough opponent. \r\n",
        "Worlds": [
          "Monstro",
          "Halloween Town",
          "Atlantica"
        ],
        "Characters": [
          "Search Ghost(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "A Heartless that pops up in all kinds of places. \r\nThe Shadow ambles around and attacks without warning. It is completely untouchable while hiding within the darkness. \r\n",
        "Worlds": [],
        "Characters": [
          "Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Soldier",
        "Description": "A swift-moving Heartless that attacks its prey with a spin kick. \r\nIts whimsical nature makes the Soldier a less than tenacious foe. \r\n",
        "Worlds": [
          "Traverse Town",
          "Wonderland",
          "Twilight Town"
        ],
        "Characters": [
          "Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tornado Step",
        "Description": "A Heartless that flies about using its arms like propeller blades. \r\nWhether moving or attacking, it's always spin, spin, spinning—but never seems to get dizzy. \r\n",
        "Worlds": [
          "Monstro",
          "Hollow Bastion",
          "Destiny Islands"
        ],
        "Characters": [
          "Tornado Step(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Trickmaster (Sora's Story)",
        "Description": "The Heartless in Wonderland that stole the Queen of Hearts's memory. \r\nVictims of memory theft don't even remember what it is they forgot. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Trickmaster(s)",
          "Queen of Hearts"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Trickmaster (Reverse/Rebirth)",
        "Description": "The Heartless that threw Wonderland into chaos. It appeared to Riku as a token of the indelible Darkness in his Heart. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Trickmaster(s)",
          "Riku"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "White Mushroom",
        "Description": "A Heartless with an unusual affinity for people. \r\nThe White Mushroom never attacks, and may even reward someone who comes to its aid. \r\n",
        "Worlds": [],
        "Characters": [
          "White Mushroom(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wight Knight",
        "Description": "A Heartless that calls Halloween Town its main haunt. \r\nThe Wight Knight's long appendages make it dangerous to approach. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Wight Knight(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wizard",
        "Description": "A Heartless proficient in magic. \r\nThe Wizard is a formidable opponent that attacks with high-level Fire, Blizzard, and Thunder spells. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Castle Oblivion"
        ],
        "Characters": [
          "Wizard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wyvern",
        "Description": "An enormous Heartless that hunts its enemies from the skies. \r\nThe Wyvern is agile despite its size. Upon sighting its prey, it rushes forward and attacks with a flurry of kicks. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Castle Oblivion"
        ],
        "Characters": [
          "Wyvern(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Yellow Opera",
        "Description": "A magic-wielding Heartless that drifts through the air. \r\nThe Yellow Opera hurls itself at enemies or attacks with Thunder. \r\nIt absorbs all lightning damage. \r\n",
        "Worlds": [],
        "Characters": [
          "Yellow Opera(s)"
        ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts II": [
      {
        "Title": "Aerial Champ",
        "Description": "A Heartless that locks in on its prey. Once it finds a target, it follows it while unleashing consecutive punches. \r\nIt is armed with three types of attacks, each with a different build up. Figure out which attack it is going to unleash and prepare accordingly. \r\n",
        "Worlds": [],
        "Characters": [
          "Aerial Champ(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Aerial Knocker",
        "Description": "Once the battle begins, there is no fleeing. \r\nIt has three types of punches, so figure out which it will unleash and choose an appropriate strategy. \r\nIts tackling punch is powerful, so defeat it quickly with successive reaction commands! \r\n",
        "Worlds": [
          "Pride Lands"
        ],
        "Characters": [
          "Aerial Knocker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Aerial Viking",
        "Description": "It attacks rapidly, leaving very little time for counterattacks. Use magic to limit its movement. \r\nWhen it unleashes its relentless tackles, use reaction commands to get through it! \r\n",
        "Worlds": [],
        "Characters": [
          "Aerial Viking(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Aeroplane",
        "Description": "It shoots bullets from midair, but only in a forward direction. \r\nIts movement speed increases when retaliating, so defeat it while it's flying slowly. \r\n",
        "Worlds": [
          "Timeless River"
        ],
        "Characters": [
          "Aeroplane(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Air Pirate",
        "Description": "Its swiftness makes it hard to attack, so wait until it is still before attacking. Use magic to stop its movements. \r\nAvoid its retaliating tackling kicks by using the reaction commands! \r\n",
        "Worlds": [
          "Port Royal",
          "The Land of Dragons"
        ],
        "Characters": [
          "Air Pirate(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Armored Knight",
        "Description": "It charges its target in a group. Use the reaction command Rising Sun when it jumps into the sky, as it is about to unleash a tackling attack. \r\nUse Rising Sun in succession for various combos! \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Beast's Castle",
          "Port Royal",
          "Halloween Town",
          "Pride Lands"
        ],
        "Characters": [
          "Armored Knight(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Assault Rider",
        "Description": "Avoid getting hit with its spear by using the well-guarded Jump attack to defeat it. \r\nWhen HP gets low, its attacks begin to get bold. Use big attacks to defeat it before it uses its explosive attack. \r\n",
        "Worlds": [
          "The Land of Dragons"
        ],
        "Characters": [
          "Assault Rider(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Beffudler",
        "Description": "A Heartless that confuses its enemy with quick movements. When it swoops, use Bat Cry to capture it and attack surrounding enemies. \r\nBe warned, it is not affected by ice magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Beffudler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blizzard Lord",
        "Description": "A Heartless called forth by greedy Pete in Agrabah. It appeared with Volcanic Lord. \r\nIt was weak against fire, but it tormented Sora and his friends with its use of ice. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Blizzard Lord",
          "Volcanic Lord",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bolt Tower",
        "Description": "Disney Castle: Pride Lands:  \r\nIt has very high defense, and can only take damage in the face. Attack the face! \r\nIf caught by its snag laser, use the reaction command Bolt Reversal continuously to escape. If successful, a big explosion will unleash damage upon nearby enemies. \r\n",
        "Worlds": [
          "The Land of Dragons"
        ],
        "Characters": [
          "Bolt Tower(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bookmaster",
        "Description": "A great mage who can handle all three types of elemental magic. \r\nIt bears a striking resemblance to Red Nocturne, Blue Rhapsody, and Yellow Opera when changing stance for use of each magic. It is immune to all magic, and should be defeated immediately. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Space Paranoids"
        ],
        "Characters": [
          "Bookmaster(s)",
          "Red Nocturne(s)",
          "Blue Rhapsody(ies)",
          "Yellow Opera(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bulky Vendor",
        "Description": "A rare Heartless that can be found in certain worlds. It appears when you poke around various areas of the map. \r\nIt only appears in certain areas, and once it appears, it will not appear in that area for a while. Use the reaction command to get items. Figure out its secret pattern to get specific items. \r\n",
        "Worlds": [
          "Agrabah",
          "Halloween Town",
          "The Land of Dragons",
          "Beast’s Castle",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Bulky Vendor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Camo Cannon",
        "Description": "A Heartless that studies its enemies before launching bombs at them. It generally targets the weakest of the bunch. \r\nIt is immune to fire and lightning. \r\n",
        "Worlds": [],
        "Characters": [
          "Camo Cannon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Cannon Gun",
        "Description": "It shoots bombs from afar, so defeat it immediately. Avoid areas of potential bomb drops while attacking. \r\nIt runs off when approached, so follow it closely and defeat it. \r\n",
        "Worlds": [
          "Port Royal",
          "Space Paranoids"
        ],
        "Characters": [
          "Cannon Gun(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Creeper Plant",
        "Description": "It stays in place and shoots seeds. Use reaction commands when it counterattacks with its roots. Use Root Ravager to uproot and attack surrounding enemies at once! \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Halloween Town"
        ],
        "Characters": [
          "Creeper Plant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Crescendo",
        "Description": "It restores the HP of surrounding enemies. Use Heal Stomp with the right timing to heal the party. \r\nWhen attacked, it may call for help, so be sure to defeat it immediately. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Crescendo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Crimson Jazz",
        "Description": "It chases its target with determination while scattering mines, so be wary when fighting this creature. \r\nWhen its HP gets low, it places a large mine. Avoid it before it explodes. It easily resists magic, so don't be shy about using the Keyblade! \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Beast’s Castle",
          "Olympus Coliseum",
          "Agrabah"
        ],
        "Characters": [
          "Crimson Jazz(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dark Thorn",
        "Description": "A liberated version of Shadow Stalker that appeared in Beast's Castle. \r\nIt appeared and disappeared while running wild, creating a chaotic battle for Sora and his friends. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Dark Thorn",
          "Shadow Stalker",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Devastator",
        "Description": "It can fly around or transform into a tank. In the air, it follows its target around, so keep a fair distance. The tank attacks from afar, so close in while dodging the cannons. \r\nWatch out for the electric attack unleashed during its transformation! \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Space Paranoids"
        ],
        "Characters": [
          "Devastator(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Driller Mole",
        "Description": "It moves underground, so follow the clouds of dust for its position. \r\nUse a finishing move to lure it out of the ground. Attack when its face pops out of the ground! \r\n",
        "Worlds": [
          "Halloween Town",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Driller Mole(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Emerald Blues",
        "Description": "Attack from a safe distance, while watching out for its sudden tackle. When its HP gets low, a tornado forms, drawing the enemy close. \r\nIt easily resists magic, so don't be shy about using the Keyblade! \r\n",
        "Worlds": [
          "Halloween Town",
          "Space Paranoids",
          "The Land of Dragons",
          "Agrabah"
        ],
        "Characters": [
          "Emerald Blues"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fat Bandit",
        "Description": "Immune to fire magic, it parries most attacks dealt from the front. Use the Rush attack from behind and defeat it with a combo attack. \r\nParry its fire bombs for a chance to unleash Full Swing! \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fat Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fiery Globe",
        "Description": "It runs before it attacks, making its movements easy to read. \r\nIt has little HP and is weak against ice. Use ice magic to defeat it. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fiery Globe(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fortuneteller",
        "Description": "It uses and is immune to all ice magic. \r\nWhen its HP gets low, it uses magic to try to freeze its target. Try counterattacking with Clear Shot. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fortuneteller(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gargoyle Knight",
        "Description": "Although it looks like an ordinary statue, it attacks with no warning. \r\nImmune to magic, it can attack from any range. Parry its attacks for a chance to use reaction commands. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Gargoyle Knight(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gargoyle Warrior",
        "Description": "Although it looks like an ordinary statue, it attacks with no warning. Immune to magic, it is skilled in ranged attacks. \r\nFully avoid its spinning attacks for reaction commands. If timed well, it can be defeated in a single blow. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Gargoyle Warrior(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Graveyard",
        "Description": "It boldly approaches its target, but catch it off guard after it attacks. \r\nIt summons persistent ghouls when it turns into a headstone. Defeat it before it has a chance to call forth these annoying ghouls. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Graveyard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Grim Reaper",
        "Description": "A Heartless that appeared in Port Royal, it was said to be born from the curse of the Aztec gold. \r\nUsing the curse to become undead, it became a ghoul, making it hard to be defeated. \r\n",
        "Worlds": [
          "Port Royal"
        ],
        "Characters": [
          "Grim Reaper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Groundshaker",
        "Description": "A giant Heartless that appeared in the Pride Lands. He was created by the many illusions of Scar. \r\nThe main body on the back of the creature controlled its bones, creating chaos in the savannah. \r\n",
        "Worlds": [
          "Pride Lands"
        ],
        "Characters": [
          "Groundshaker(s)",
          "Scar"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hammer Frame",
        "Description": "It taps the ground to create a sonic wave. Jump to avoid the wave and defeat it with combos. \r\nWhen its HP gets low, it attacks with a series of tackles, so defeat it immediately! \r\n",
        "Worlds": [
          "Beast's Castle",
          "Timeless River",
          "Port Royal"
        ],
        "Characters": [
          "Hammer Frame(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hook Bat",
        "Description": "It generally flies around scoping the area. When it swoops, use Bat Battery to capture it and attack surrounding enemies. \r\nAfter this attack, use combos while in the air to defeat it. \r\n",
        "Worlds": [
          "Beast's Castle",
          "Olympus Coliseum",
          "The Land of Dragons",
          "Agrabah"
        ],
        "Characters": [
          "Hook Bat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hot Rod",
        "Description": "It attacks and withdraws quickly, making it hard to hit. Use magic to defeat this enemy. \r\nWhen its HP gets low, it moves around even quicker, so be sure to defeat it as soon as possible. \r\n",
        "Worlds": [
          "Timeless River"
        ],
        "Characters": [
          "Hot Rod(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Icy Cube",
        "Description": "It jumps before it attacks, making its movements easy to read. \r\nIt has little HP and is weak against fire. Use fire magic to defeat it. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Icy Cube(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Illuminator",
        "Description": "A Heartless called forth in Port Royal by Pete. \r\nIt had glowing eyes and a lantern on its tail, which was used to absorb light and create darkness to help Barbossa, whose weakness was moonlight. \r\n",
        "Worlds": [
          "Port Royal"
        ],
        "Characters": [
          "Illuminator(s)",
          "Pete",
          "Barbossa"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iron Hammer",
        "Description": "A Heartless that attacks while jumping and spinning. Don't get caught in its powerful shockwave attack! \r\nIt lets its guard down right before it attacks. That's your chance! \r\n",
        "Worlds": [],
        "Characters": [
          "Iron Hammer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lance Soldier",
        "Description": "The soldier and lance don't get along, so it will be easy to catch this enemy off guard. \r\nWhen its HP gets low, the lance goes nuts. Grab it with Lance Tug to attack surrounding enemies. A good strategy is to lower its HP and wait for the chance to use Lance Tug. \r\n",
        "Worlds": [
          "Beast's Castle",
          "Olympus Coliseum",
          "Port Royal"
        ],
        "Characters": [
          "Lance Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lance Warrior",
        "Description": "A Heartless whose movement isn't quite synchronized. Be careful to avoid its powerful thrusting move that can make any enemy go flying! \r\nUse the reaction command Lance Tug to grab its lance and hit the enemies around you! \r\n",
        "Worlds": [],
        "Characters": [
          "Lance Warrior(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Large Body",
        "Description": "It will block attacks dealt from the front, so a good option is to perform a series of combos from behind, finishing with Full Swing. \r\nWhen enraged it will repeatedly tackle its target. That's the time to use reaction commands. Use Kickback to finish the battle! \r\n",
        "Worlds": [
          "Beast's Castle",
          "Olympus Coliseum",
          "Timeless River"
        ],
        "Characters": [
          "Large Body(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Living Bone",
        "Description": "Make sure to dodge its strong attacks as they deal huge damage. Weaken it instantly by crushing its head with the reaction command! \r\nWith a shaman, it powers up to unleash deadly curses, but merely defeat it as you would a shaman. \r\n",
        "Worlds": [
          "Pride Lands"
        ],
        "Characters": [
          "Living Bone(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Luna Bandit",
        "Description": "It backs away during combat, so close in with thrust attacks. \r\nCatch it off guard after parrying its attacks to defeat it. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Luna Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mad Ride",
        "Description": "A large Heartless whose stout body makes it hard to topple. Be careful when you interrupt or block its attacks, as it'll become very angry! \r\nIt is immune to fire magic, so defeat it with ice magic! \r\n",
        "Worlds": [],
        "Characters": [
          "Mad Ride(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Magic Phantom",
        "Description": "A Heartless with two faces. When it's in the air, the Keyblade will have no effect. \r\nReflect its magic to lure it out of the sky. Once it's on the ground, it's time to strike. \r\n",
        "Worlds": [],
        "Characters": [
          "Magic Phantom(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Magnum Loader",
        "Description": "It moves in a clockwise motion around its target, so keep that in mind when attacking. \r\nIt moves swiftly, so attack in the few instances it shows its movements. \r\nKeep an eye out to avoid and counter its high-speed tackle with Quick Blade. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Space Paranoids"
        ],
        "Characters": [
          "Magnum Loader(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Minute Bomb",
        "Description": "When attacked, it counts down for self-detonation. Use Dodge Roll seconds before the explosion to lure surrounding enemies into it. \r\nTo play it safe, parry its tackles to make it lose its will to fight. \r\n",
        "Worlds": [
          "Disney Castle",
          "Timeless River",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Minute Bomb(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Morning Star",
        "Description": "When its HP gets low, it unleashes its Press attack. Use Bump and Meteor Strike for a counterattack combo! \r\nMeteor Strike can be done in succession, so make sure to grab surrounding enemies as well! \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Beast's Castle",
          "Port Royal",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Morning Star(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Necromancer",
        "Description": "A Heartless that can make itself disappear. It can't be locked onto while invisible, but when you land a hit, it'll show itself again. \r\nWhile it's disguised as a mask, you won't be able to do any damage. Attack it right after it unleashes an attack to catch it off guard! \r\n",
        "Worlds": [],
        "Characters": [
          "Necromancer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Nightwalker",
        "Description": "It jumps around while attacking persistently, so attack it and defeat it immediately. \r\nWatch out for its powerful counterattack. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Nightwalker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 1 (Mushroom XIII)",
        "Description": "The strongest Heartless of the bunch. It moves quickly and deals precise attacks. \r\nAttack it to earn points! As soon as it performs Reversal, perform your own Reversal to catch it off guard. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 2 (Mushroom XIII)",
        "Description": "A Heartless that attacks with a barrage of magic projectiles. \r\nAvoid its attacks to earn points. Launch them back to earn even more points! \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 3 (Mushroom XIII)",
        "Description": "A clumsy Heartless that drops valuable items. \r\nChase it to collect what it's lost! At times it's known to drop a whole trove of goodies. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 4 (Mushroom XIII)",
        "Description": "A Heartless that loves a good game of tag—and loves being \"it.\" \r\nIt summons allies while chasing its enemies; don't let their sheer number overwhelm you. Defeat them one at a time for victory. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 5 (Mushroom XIII)",
        "Description": "A tough Heartless that regenerates HP as it sleeps. \r\nDefeat it by hitting it fast and hard to drain its HP. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 6 (Mushroom XIII)",
        "Description": "A Heartless that creates copies of itself, and attacks using various formations. \r\nFigure out which formation it's using and quickly work out a plan of action! \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 7 (Mushroom XIII)",
        "Description": "A dangerous Heartless with a violent streak. \r\nIf you get too close, it'll blast you away. Defeat it with long-range attacks like magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 8 (Mushroom XIII)",
        "Description": "A Heartless buried in the ground, waiting to be pulled out. \r\nOnce you pull it out, keep attacking until it's dead. Make sure you don't drop it! \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 9 (Mushroom XIII)",
        "Description": "A Heartless that loves to dance. Hit it, and it won't stop spinning. \r\nAttack quickly and repeatedly to keep it spinning out of control. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 10 (Mushroom XIII)",
        "Description": "A Heartless that confuses its enemy by creating copies of itself. \r\nDefeat it by finding and attacking its real form. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 11 (Mushroom XIII)",
        "Description": "A poor Heartless that's always being chased by a mysterious number. \r\nAttacking it will reduce the number. Transform the number to 0 as quickly as possible! \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 12 (Mushroom XIII)",
        "Description": "A Heartless that warps to various areas on the map only to mock Sora. \r\nDefeat it by locking on to it or using long-ranged attacks! \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "No. 13 (Mushroom XIII)",
        "Description": "A Heartless that appeared alongside an ethereal flash of light. \r\nIt bestowed upon Sora a treasure, as proof of defeating the rest of its kind. \r\n",
        "Worlds": [],
        "Characters": [
          "Mushroom XIII"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Possessor",
        "Description": "A Heartless that appeared in Beast's Castle. It possessed the dungeon doors, turning it into Thresholder. \r\nIt had the power to conceal itself, but had very few other powers. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Possessor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Prison Keeper",
        "Description": "A Heartless called forth in Halloween Town by Maleficent to get revenge on Sora. \r\nIt held Lock, Shock, and Barrel captive while dealing various elemental attacks. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Prison Keeper(s)",
          "Maleficent",
          "Sora",
          "Lock",
          "Shock",
          "Barrel"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rabid Dog",
        "Description": "It won't move until approached, so move in swiftly and attack. \r\nIt becomes tired and lets its guard down after counterattacks. Attack then for an easy battle. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Port Royal"
        ],
        "Characters": [
          "Rabid Dog(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rapid Thruster",
        "Description": "It attacks in a group, so be ready to attack with reaction commands. Start with Speed Trap, followed by the wide Aero Blade attack. \r\nIt chases its target with determination when counterattacking. Run! \r\n",
        "Worlds": [
          "The Land of Dragons",
          "Timeless River",
          "Port Royal",
          "Agrabah",
          "Pride Lands"
        ],
        "Characters": [
          "Rapid Thruster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Reckless",
        "Description": "A Heartless that doesn't stop moving. It unleashes spinning attacks and powerful lightning attacks on its enemy. \r\nIt is immune to lightning. \r\n",
        "Worlds": [],
        "Characters": [
          "Reckless(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Runemaster",
        "Description": "A Heartless that utilizes three powerful magic elements. \r\nWhen attacking this enemy, keep in mind that its book acts as a shield. \r\n",
        "Worlds": [],
        "Characters": [
          "Runemaster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "It sinks into the ground while moving, so timing is the key to defeating it. \r\nThe moment it surfaces, attack away! \r\n",
        "Worlds": [],
        "Characters": [
          "Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow Stalker",
        "Description": "A Heartless that attacked Belle in Beast's Castle. \r\nIt jumped around on the floor, pillars, and chandelier of the ballroom, creating mayhem. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Shadow Stalker",
          "Belle"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shaman",
        "Description": "It attacks from afar and moves around very little. It is very magic-resistant and nullifies all attacks while taking on its mask form. \r\nThe cursed flame it occasionally unleashes firmly chases its target, but it can be used advantageously with reaction commands! \r\n",
        "Worlds": [
          "Pride Lands"
        ],
        "Characters": [
          "Shaman(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Silver Rock",
        "Description": "It quickly disappears into a ball of light, setting off an explosion when it reappears. Use reaction commands when it's in light form. \r\nIt easily resists magic, so don't be shy about using the Keyblade! \r\n",
        "Worlds": [
          "Agrabah",
          "Pride Lands"
        ],
        "Characters": [
          "Silver Rock(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Soldier",
        "Description": "It unleashes decent attacks from every angle. Stay alert when fighting it! \r\nIt counterattacks with a kick, so retaliate with Cyclone to float in midair and unleash combo attacks! \r\n",
        "Worlds": [],
        "Characters": [
          "Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spring Metal",
        "Description": "Although this Heartless stays put, it uses various tactics to lure enemies close. \r\nDon't leave it alone, or you'll find yourself in trouble! If you see one, defeat it as quickly as possible. Magic does little damage, so hit it with your Keyblade! \r\n",
        "Worlds": [],
        "Characters": [
          "Spring Metal(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Storm Rider",
        "Description": "A giant Heartless that appeared in the sky of the Land of Dragons. An intense battle was fought by Sora above the palace. \r\nOriginally a creature that gave strength to the earth and people, it was turned into a Heartless. \r\n",
        "Worlds": [
          "The Land of Dragons"
        ],
        "Characters": [
          "Storm Rider"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Strafer",
        "Description": "It moves in a clockwise motion around its target, so keep that in mind when attacking. \r\nMake sure to close in, as it attacks far away targets with a laser. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Space Paranoids"
        ],
        "Characters": [
          "Strafer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Surveillance Robot",
        "Description": "Use Reaction Commands Snag, then Sparkle Ray to attack surrounding enemies with a laser! \r\nKeep an eye out for opportunities to use reaction commands even if the laser attack is parried! \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Port Royal",
          "Space Paranoids"
        ],
        "Characters": [
          "Surveillance Robot(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Thresholder",
        "Description": "The doors possessed by Possessor that attacked Sora and his friends. \r\nPossessor was separated from the doors with Release, in which the power of the Keyblade was poured into the keyhole blocked by its arms. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Thresholder(s)",
          "Possessor(s)",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tornado Step",
        "Description": "It attacks as it moves, so once it starts spinning, stop its movements with reaction commands. \r\nUse Tornado Ride and grab the enemy for a free ride while attacking surrounding enemies. \r\n",
        "Worlds": [
          "Port Royal",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Tornado Step(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Toy Soldier",
        "Description": "It merely sits and waits for the enemy to come closer, so attack from afar. \r\nWhen it turns into a box, it begins to attack from a distance, making it impossible to close in on. \r\n",
        "Worlds": [
          "Christmas Town"
        ],
        "Characters": [
          "Toy Solider(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Trick Ghost",
        "Description": "It has two faces, both of which need to be fought differently. \r\nWhen in the air, move in close to seal its long-range attacks. When on the ground, move far away to avoid its short-range attacks. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Christmas Town"
        ],
        "Characters": [
          "Trick Ghost(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Volcanic Lord",
        "Description": "A Heartless called forth by greedy Pete in Agrabah. It appeared with Blizzard Lord. \r\nIt was weak against ice, but it tormented Sora and his friends with its use of fire. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Volcanic Lord",
          "Blizzard Lord",
          "Pete",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wight Knight",
        "Description": "It merely wanders around, but once attacked, it attacks persistently. Parry its attacks to ward it off. \r\n",
        "Worlds": [],
        "Characters": [
          "Wight Knight(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Assassin",
        "Description": "An assassin. A high-ranking Nobody. It hides in the ground and attacks quietly from behind. \r\nIt cannot be attacked while it is in the ground. Parry its attacks to get it to surface. \r\nWhen it starts running around, look out! It'll begin to unleash powerful attacks. Don't miss any chances to use the reaction commands to defeat as many as possible at once! \r\n",
        "Worlds": [
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Assassin(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Berserker",
        "Description": "A berserker. A high-ranking Nobody. Its attacks are hard to read as it is dragged around by a cursed hammer. \r\nAttacks from the front will only be parried by its hammer. Knock it down to make it let go of the hammer. Then pick up the hammer to unleash a flurry of attacks with Berserk. \r\n",
        "Worlds": [
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Berserker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Creeper",
        "Description": "The weakest of the Nobodies. It takes on various shapes, making it difficult to read its next move. \r\nWhen it is paired with Dusks, use Reversal to stop its movements before attacking. \r\n",
        "Worlds": [
          "Twilight Town",
          "Hollow Bastion",
          "The World That Never Was"
        ],
        "Characters": [
          "Creeper(s)",
          "Dusk(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dancer",
        "Description": "A dancer. A high-ranking Nobody. It skates around the ground and quickly moves away when approached. Wait for the end of its attack to retaliate. When it approaches with a low posture, look out! \r\nIf cornered, it retaliates with its buddies with kicks and other attacks. Fight carefully when outnumbered. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Dancer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dragoon",
        "Description": "A dragoon. A high-ranking Nobody. When a ball of light appears after parrying its attacks, use Learn. Time it accurately, to use Jump to attack. \r\nLearn can be used as often as possible, so a series of Jump attacks is one strategy option. \r\n",
        "Worlds": [
          "Beast's Castle",
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Dragoon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dusk",
        "Description": "It is difficult to read this creature's next move, so catch it off guard with a Reversal to stop its actions. A series of attacks and Reversals can also look cool in battle! \r\nNote: It lets its guard down when its attack is parried. This is also true for all Nobodies. \r\n",
        "Worlds": [
          "Twilight Town",
          "Hollow Bastion",
          "The Land of Dragons",
          "Olympus Coliseum",
          "Beast's Castle",
          "Port Royal",
          "The World That Never Was"
        ],
        "Characters": [
          "Dusk(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gambler",
        "Description": "A gambler. A high-ranking Nobody. It doesn't seem to like fighting, and just floats around aimlessly. \r\nUse the reaction command when it attacks with cards and dice, and let the games begin! \r\nDon't lose, for something terrible happens. Win for a chance to attack—and maybe even for a little something extra! \r\n",
        "Worlds": [
          "Port Royal",
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Gambler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Samurai",
        "Description": "A samurai. A high-ranking Nobody. Using swords and their sheaths as weapons, it can handle up to four weapons at a time. It attacks with calmness and efficiency. \r\nMake sure not to lose sight of it once it hides beneath the ground. After parrying its attack, it sits and waits, giving an opportunity to use reaction commands. \r\nFight one-on-one while the others sit back and watch. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Samurai(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sniper",
        "Description": "A sniper. A high-ranking Nobody. It is very agile as it moves around defying gravity. Use magic to stop its movements for an easier battle. \r\nIt attacks using arrows of light. Ward them off with Warp Snipe. Use this in succession for victory! \r\n",
        "Worlds": [
          "The Land of Dragons",
          "Twilight Town",
          "The World That Never Was"
        ],
        "Characters": [
          "Sniper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sorcerer",
        "Description": "A sorcerer. A high-ranking Nobody. Immune to magic, it attacks with invulnerable cubes. \r\nWatch out for the cubes while attacking the main body. The cubes disappear when the body is defeated. \r\n",
        "Worlds": [
          "The World That Never Was",
          "Cavern of Remembrance"
        ],
        "Characters": [
          "Sorcerer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Twilight Thorn",
        "Description": "A giant Nobody who Roxas fought at the Station of Awakening. \r\nAlthough it tried to capture Roxas with its thorns, it was overpowered and defeated by the strength of the Keyblade master. \r\n",
        "Worlds": [],
        "Characters": [
          "Twilight Thorn(s)",
          "Roxas"
        ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts 358/2 Days": [
      {
        "Title": "Aerial Master",
        "Description": "These mid-sized flying Heartless put the wind to expert use when attacking. \r\nThey move swiftly, so wait for them to swoop low, then strike. \r\nAlso note that they are immune to Aero magic. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Aerial Master(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Air Battler",
        "Description": "These mid-sized flying Heartless put the wind to expert use when attacking. \r\nThey move swiftly, so wait for them to swoop low, then strike. \r\nAlso note that they are immune to Aero magic. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Neverland"
        ],
        "Characters": [
          "Air Battler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Antlion",
        "Description": "This massive Heartless swims freely through the sand. Aim for its face when it breaks the surface. \r\nAfter sustaining damage, it will take to the sky, but its cyclone shield protects it from direct damage while airborne. \r\nInstead, hit the debris it throws back at it to create an opening, then strike. \r\n",
        "Worlds": [],
        "Characters": [
          "Antlion(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Artful Flyer",
        "Description": "These large flying Heartless put the wind to expert use when attacking. \r\nThey move swiftly, but are vulnerable just after kicking, so be ready to mount a counteroffensive. \r\nThey also retain their kind's immunity to Aero magic. \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Artful Flyer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Avalanche",
        "Description": "These large aerial Heartless use their potent ice breath to attack their prey. \r\nStrike their wings and tail to force them to land, then focus attacks on their head, which is weak against Fire. \r\n",
        "Worlds": [
          "Twilight Town",
          "Neverland"
        ],
        "Characters": [
          "Avalanche(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rabid Dog",
        "Description": "Small and canine in appearance, these Heartless wander aimlessly until a target draws near. \r\nTheir bark is bad, but not worse than their bite; they'll snap at you if you hit them. Deflect this with a block to stagger them. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Rabid Dog(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Barrier Master",
        "Description": "These mid-sized Heartless are accomplished mages. While not aggressive, they grant allies an impenetrable barrier. \r\nAttack them until dizzy to make them drop their books, disabling any active barriers. The fallen books can then be knocked away. \r\nThey have high defense, but are vulnerable to magic. Exploit that fact. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Beast’s Castle"
        ],
        "Characters": [
          "Barrier Master(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blitz Spear",
        "Description": "This lightning knight Heartless's skillful defense makes it tough to finish off. \r\nThough its focused slash can be stopped with a block, blasting the knight with Aeroga while it is storing up energy will stagger it, opening it up to extra damage, especially from magic. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Blitz Spear(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bubble Beat",
        "Description": "These mid-sized Heartless cause the most trouble when they toot their horns to heal themselves and their cohorts. \r\nBlock and you can deflect the homing water missiles they spew. \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Bubble Beat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bulky Vendor",
        "Description": "Uncombative by nature, these mid-sized capsule Heartless will disappear after a short time. They hold rare and valuable prizes, however, and should be defeated when possible. \r\nThey gain speed as they take damage. Don't let them get away! \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Beast’s Castle",
          "Halloween Town"
        ],
        "Characters": [
          "Bulky Vendor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bully Dog",
        "Description": "Larger and faster than the Bad Dog, but these canine Heartless bark just the same. \r\nPhysical attacks won't knock them off balance. Exploit their weakness to magic instead. \r\n",
        "Worlds": [],
        "Characters": [
          "Bully Dog(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Carrier Ghost",
        "Description": "These large flying Heartless are able to spontaneously appear behind their targets and possess them. \r\nThough they behave similarly to Hover Ghosts, physical attacks won't stagger them. \r\n",
        "Worlds": [],
        "Characters": [
          "Carrier Ghost(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Chill Ripper",
        "Description": "This icy knight Heartless's skillful defense makes it tough to finish off. \r\nThough its focused slash can be stopped with a block, blasting the knight with Firaga while it is storing up energy will stagger it, opening it up to extra damage, especially from magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Chill Ripper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Clay Armor",
        "Description": "Armor covers every inch of these large Heartless, allowing them to deflect blows from every direction. \r\nInstead, aim for the head and knock them down, rendering them vulnerable to further attack. Use Thunder magic to keep them down longer. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Clay Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Commander",
        "Description": "As aggressive as they are large, these foes still rely on kick attacks that can be deflected with a well-timed block. \r\nNote, however, that their size prevents normal attacks from knocking them off balance. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Commander(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Creepworm",
        "Description": "Though fast, these Heartless are unfit for combat and low in HP. A single blow should be enough to take them out. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Creepworm(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Crimson Prankster",
        "Description": "This newcomer to Wonderland splits in two, attacking as a pair. Unless both halves are defeated at the same time, they will continue the cycle of merging and splitting. \r\nCounter its flamethrower with ice magic—Blizzaga if possible. Aeroga will halt its fiery spin attack. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Crimson Prankster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Cymbal Monkey",
        "Description": "Raw noise is the chief weapon of these mid-sized Heartless which lurk in treasure chests. \r\nBe sure to block their sound bullets. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Beast’s Castle"
        ],
        "Characters": [
          "Cymbal Monkey(ies)"
        ],
        "AdditionalInformation": "Illusion-based attacks like these bullets can flip-foot you, which reverses the directional controls for basic movement."
      },
      {
        "Title": "Dark Follower",
        "Description": "A stronger form of the Darkside. Though more powerful, it follows the same basic patterns as its predecessor. \r\nSend back the dark homing blasts fired from its chest with a block, then attack either its hands or, if possible, its head for maximum damage. \r\n",
        "Worlds": [],
        "Characters": [
          "Dark Follower(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside",
        "Description": "This giant Heartless will devour all around it if left unchecked. \r\nThe dark homing blasts fired from its chest can be turned back on it with a block. Target its hands or, if possible, its head. \r\n",
        "Worlds": [],
        "Characters": [
          "Darkside(s)"
        ],
        "AdditionalInformation": "Earth-based attacks like its homing blasts can halve your current HP."
      },
      {
        "Title": "Deserter",
        "Description": "Quick to flee from threats, these small Heartless will attack anyone who takes down another of their number with a flurry of kicks. \r\nBlock to send them sprawling. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Beast’s Castle"
        ],
        "Characters": [
          "Deserter(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Destroyer",
        "Description": "These large flying drone Heartless fire a super laser that tears apart anything in its path, friend or foe. \r\nWhile regular attacks will not stagger the Destroyer, jolting it with Thunder magic will disable its super and double laser. \r\n",
        "Worlds": [],
        "Characters": [
          "Destroyer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Detonator",
        "Description": "These large versions of the Minute Bomb act similarly, but produce a much broader blast when they self-detonate. \r\nThey also won't stagger from regular attacks, making them a dangerous foe. Take ample care when facing them. \r\n",
        "Worlds": [
          "Twilight Town",
          "Halloween Town"
        ],
        "Characters": [
          "Detonator(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dire Plant",
        "Description": "These small plant Heartless are rooted to the ground. \r\nThey strike from afar with a seed cannon that can be turned on other foes with a well-timed block, or even used to destroy the Dire Plant itself. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah"
        ],
        "Characters": [
          "Dire Plant(s)"
        ],
        "AdditionalInformation": "Flower-based attacks like their seeds can blind you, which causes your attacks to miss."
      },
      {
        "Title": "Dual Blade",
        "Description": "This large and aggressive knight Heartless's skillful defense makes it tough to finish off. \r\nThough its focused slash can be stopped with a block, blasting the knight with Thundaga while it is storing up energy will stagger it, opening it up to extra damage, especially from magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Dual Blade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dustflier",
        "Description": "Large and deadly, these flying Heartless pack extreme power and high HP levels. \r\nTheir arsenal includes Meteor breath and an invincible charge, and all of their attacks can inflict negative status effects on contact. \r\nThis specimen is easily in the strongest class of Heartless. Prepare accordingly. \r\n",
        "Worlds": [],
        "Characters": [
          "Dustflier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Emerald Serenade",
        "Description": "These large flying Heartless travel along a set path, making ambush a useful tactic. \r\nTheir speed grows faster as their HP drops, rendering them increasingly tricky to finish off. \r\n",
        "Worlds": [
          "Wonderland",
          "Neverland"
        ],
        "Characters": [
          "Emerald Serenade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fire Plant",
        "Description": "These mid-sized plant Heartless are rooted to the ground. \r\nThey strike from afar with bouncing fireballs, but are slow to react. A nimble fighter can easily get behind them and eliminate them from the rear. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fire Plant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flare Note",
        "Description": "These mid-sized Heartless cause the most trouble when they toot their horns to heal themselves and their cohorts. \r\nBlock and you can deflect the bouncing fireballs they spew. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Flare Note(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gigas Shadow",
        "Description": "These large Pureblood Heartless take the Mega-Shadow attack pattern and add even more muscle. \r\nThe only way to knock them off guard is to deflect their tackles with a block. \r\n",
        "Worlds": [
          "Twilight Town",
          "Beast’s Castle",
          "Wonderland"
        ],
        "Characters": [
          "Gigas Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Grey Caprice",
        "Description": "These small flying Heartless strike with special warp missiles that make you trade positions with them. \r\nTheir magic can't be interrupted by attacking, so try to take them out early on. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Grey Caprice(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Guard Armor",
        "Description": "Large and heavily armored, these Heartless will jump and then crash into the ground, creating a powerful shockwave. \r\nThey drop their heads after landing, however; strike then and the body will eventually fall to pieces, with each piece acting autonomously. Start with the limbs and take them all out. \r\n",
        "Worlds": [],
        "Characters": [
          "Guard Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Guardian",
        "Description": "These large flying drone Heartless fire a super laser that damages anything in its path, friend or foe. \r\nRegular attacks will not stagger the Guardian. To disable its super laser, jolt it with Thunder. \r\n",
        "Worlds": [],
        "Characters": [
          "Guardian(s)"
        ],
        "AdditionalInformation": "Nil-based attacks like the super laser can null your defense, increasing the damage you take."
      },
      {
        "Title": "Heat Saber",
        "Description": "This fiery knight Heartless's skillful defense makes it tough to finish off. \r\nThough its focused slash can be stopped with a block, blasting the knight with Blizzaga while it is storing up energy will stagger it, opening it up to extra damage. \r\n",
        "Worlds": [],
        "Characters": [
          "Heat Saber(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hover Ghost",
        "Description": "These small flying Heartless are able to spontaneously appear behind their targets and possess them. \r\nIf you are ensnared, rapidly press buttons to shake loose. \r\nHover Ghosts are quick to blink out of harm's way, but negative status effects will prevent them from vanishing. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Hover Ghost(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ice Cannon",
        "Description": "These mid-sized cannon Heartless fire shots that rain down from above. Use dodge rolls or air slides to evacuate the target area. \r\nTheir head-on shots can freeze victims, but can also be batted back with a block. \r\nRegular attacks won't throw them off balance. Be careful. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Ice Cannon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Infernal Engine",
        "Description": "The cannonballs this heavy tank Heartless fires can be returned with a block to take out the archers perched atop it. \r\nThe battering ram that emerges from its mouth before it charges is especially weak. Capitalize on that vulnerability, but be sure to get out of there before it begins its advance. \r\n",
        "Worlds": [],
        "Characters": [
          "Infernal Engine(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Jumbo Cannon",
        "Description": "Mid-sized versions of the Li'l Cannon, these foes fire shots that rain down from above. Use dodge rolls or air slides to evacuate the target area. \r\nThough strong across the board and immune to being stunned by attacks, their head-on shots can be batted back with a block. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Jumbo Cannon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ice Plant",
        "Description": "These large plant Heartless are rooted to the ground. \r\nThey strike from afar with homing ice shots that ricochet off of walls, and which can be returned with a block. \r\nAt close range, they'll attempt a head-butt, after which they'll be wide open. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Ice Plant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Land Armor",
        "Description": "Armor covers every inch of these large Heartless, allowing them to deflect blows from every direction. \r\nInstead, aim for the head and knock them down, rendering them vulnerable to further attack. Use Aero magic to keep them down longer. \r\n",
        "Worlds": [],
        "Characters": [
          "Land Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Large Armor",
        "Description": "Armor covers every inch of these large Heartless, allowing them to deflect blows from every direction. \r\nInstead, aim for the head and knock them down, rendering them vulnerable to further attack. Use Fire magic to keep them down longer. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Large Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Leechgrave",
        "Description": "A massive plant-like Heartless with a savage claw attack. The toxic pollen it spews from its head saps victims' HP for as long as they breathe it. \r\nDestroy all of the Tentaclaws to dizzy the main body, then move in. \r\nNote that defeating Tentaclaws or hitting them with magic will speed up the pollen bursts. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Leechgrave(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Living Pod",
        "Description": "These mid-sized flying Heartless are able to spontaneously appear behind their targets and possess them. \r\nThough they behave similarly to Hover Ghosts, physical attacks won't stagger them. \r\nRemember, there's no shame in falling back to regroup. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Living Pod(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Crescendo",
        "Description": "These small Heartless cause the most trouble when they toot their horns to heal themselves and their cohorts. The wind missiles they shoot can be returned with a block. \r\n",
        "Worlds": [
          "Agrabah",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Crescendo(s)"
        ],
        "AdditionalInformation": "Wind-based attacks can air-toss you. While airborne you become an easy target and will take more damage if hit."
      },
      {
        "Title": "Lurk Lizard",
        "Description": "Similar in form and behavior to the Veil Lizard, these foes attack prey with a tongue lash attack. \r\nBlock it to dizzy the lizard, then strike back. Blizzard magic is also especially effective. \r\n",
        "Worlds": [],
        "Characters": [
          "Lurk Lizard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Massive Possessor",
        "Description": "These living collectives are made up of multiple Possessors, and can drain life from anything they touch. \r\nWhen dealt lethal damage, the collective splits into individual creatures, so be prepared to face them. \r\n",
        "Worlds": [
          "Beast’s Castle",
          "Wonderland"
        ],
        "Characters": [
          "Massive Possessor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mega-Shadow",
        "Description": "Twilight Town: \r\nThese mid-sized Purebloods retain the attack patterns of their smaller cousins, but also use a dangerous tackle. \r\nBlock it, and they're left wide open. \r\n",
        "Worlds": [
          "Beast’s Castle",
          "Halloween Town"
        ],
        "Characters": [
          "Mega-Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Neoshadow",
        "Description": "A Pureblood Heartless that flows across the ground as a shadow, completely immune to attack. \r\nIt may unleash a shockwave as it emerges, so stay on guard. \r\nBlock when it charges you to earn a few precious seconds during which you can deal double damage. \r\n",
        "Worlds": [
          "Twilight Town",
          "Beast’s Castle",
          "The World That Never Was"
        ],
        "Characters": [
          "Neoshadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Novashadow",
        "Description": "This advanced form of the Pureblood Neoshadow can't be knocked off balance, and retains the ability to unleash a shockwave as it resurfaces from the ground. \r\nBlock when it charges you to earn a few precious seconds during which you can deal double damage. \r\n",
        "Worlds": [],
        "Characters": [
          "Novashadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Orcus",
        "Description": "Though faster and more powerful, these Heartless are otherwise the same as the Invisible. They attack with a fearsome shockwave. \r\nTime your combo finisher so it connects right after they catch their sword. This will cancel the shockwave and leave them open. \r\n",
        "Worlds": [
          "Twilight Town",
          "Halloween Town"
        ],
        "Characters": [
          "Orcus(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Phantomtail",
        "Description": "These large aerial Heartless can't be harmed by blows to the head, instead warping to a remote location on impact. \r\nThey won't warp, however, if you attack their wings or tail, so focus attacks there. Go in equipped for aerial combat. \r\n",
        "Worlds": [],
        "Characters": [
          "Phantomtail(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pink Concerto",
        "Description": "A large flying Heartless. \r\nThe toxic cloud it spits forth as it chases down targets will gradually drain the HP of anyone trapped within its bounds. \r\nLand a combo finisher to clear the cloud. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Pink Concerto(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Poison Plant",
        "Description": "These large plant Heartless are rooted to the ground. \r\nThey strike from afar with poison shots that cannot be blocked. \r\nAt close range, they'll attempt a head-butt, after which they'll be wide open. They are also susceptible to Fire magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Poison Plant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Powered Armor",
        "Description": "This improved version of the Guard Armor still uses the same basic tactics. \r\nThe powerful shockwave it produces causes it to drop its head. Strike then and the body will eventually fall to pieces. Start with limbs and take them all out. \r\n",
        "Worlds": [
          "Twilight Town"
        ],
        "Characters": [
          "Powered Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rare Vendor",
        "Description": "Uncombative by nature, these large capsule Heartless will disappear after a short time. They hold rare and valuable prizes, however, and should be defeated when possible. \r\nThey gain speed as they take damage. Don't let them get away! \r\n",
        "Worlds": [
          "Twilight Town",
          "Olympus Coliseum",
          "Halloween Town",
          "Wonderland",
          "Neverland"
        ],
        "Characters": [
          "Rare Vendor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ruler of the Sky",
        "Description": "You need to destroy all the tail segments of this avian Heartless to reveal its core. \r\nAfter each segment is destroyed, the Ruler of the Sky will glow red and charge its foes. Wait too close to the water's surface and it will fire a salvo of water shots. \r\nOnce the core is exposed, avoid the spray of coins and counter with Fire magic. \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Ruler of the Sky(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sapphire Elegy",
        "Description": "These mid-sized flying Heartless can blink out when struck, avoiding damage and teleporting to a new location. \r\nDeflect their head-butts with a block to knock them out and leave them vulnerable to attack. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Sapphire Elegy(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Scarlet Tango",
        "Description": "These small flying Heartless strike with fireballs that bounce around, and you can't interrupt their magic by attacking. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah"
        ],
        "Characters": [
          "Scarlet Tango(s)"
        ],
        "AdditionalInformation": "Fire-based attacks can ignite you, which will gradually sap your HP for as long as it lasts."
      },
      {
        "Title": "Scorching Sphere",
        "Description": "Sharp spikes cover these large, fiery Heartless. Though they are impervious during their spin attack, you can slow their onslaught with a block, bringing them to an eventual halt. \r\nAlternatively, Blizzard magic will stop them with a single blast. \r\n",
        "Worlds": [],
        "Characters": [
          "Scorching Sphere(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sergeant",
        "Description": "Blocking works well against these mid-sized Heartless to stop their various kick attacks and create an opening. \r\nYou can also nullify their attacks and trip them up by hitting them with a combo finisher when they start kicking. \r\n",
        "Worlds": [
          "Beast’s Castle",
          "Wonderland"
        ],
        "Characters": [
          "Sergeant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "A Pureblood Heartless that flows across the ground as a shadow, completely immune to attack. \r\nWatch for the moment it emerges, then strike! \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Beast’s Castle"
        ],
        "Characters": [
          "Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow Glob",
        "Description": "These dark masses tend to attract Purebloods. Destroy them on sight. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Wonderland",
          "Neverland"
        ],
        "Characters": [
          "Shadow Glob(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Skater Bomb",
        "Description": "These mid-sized Heartless begin a countdown to self-detonation if you deflect their head-butts with a block. \r\nStrike them during the countdown to send their payload hurtling into other enemies. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Skater Bomb(s)"
        ],
        "AdditionalInformation": "Ice-based attacks like their explosion can freeze you, robbing you of the ability to move."
      },
      {
        "Title": "Sky Grappler",
        "Description": "These mid-sized flying Heartless put the wind to expert use when attacking. \r\nThey move swiftly, but are vulnerable just after kicking, so be ready to mount a counteroffensive. \r\nThey also retain their kind's immunity to Aero magic. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Sky Grappler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Snapper Dog",
        "Description": "Larger and faster than the Bad Dog, these canine Heartless can be tricky to subdue. \r\nTheir weakness to magic makes that the optimal solution. \r\n",
        "Worlds": [
          "Beast’s Castle"
        ],
        "Characters": [
          "Snapper Dog(s)"
        ],
        "AdditionalInformation": "Moon-based attacks like their bark can silence you, preventing you from hurting them with magic."
      },
      {
        "Title": "Snowy Crystal",
        "Description": "These mid-sized foes follow the same basic patterns as the Icy Cube, while also adding a rolling shockwave to their arsenal that steadily advances on its target. \r\nFire magic is extremely effective. \r\n",
        "Worlds": [
          "Beast’s Castle",
          "Olympus Coliseum",
          "Halloween Town"
        ],
        "Characters": [
          "Snowy Crystal(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Soldier",
        "Description": "These small Heartless primarily use their claws and a flurry of kicks to attack. \r\nThe latter can be deflected with a block to trip them up. \r\n",
        "Worlds": [
          "Beast’s Castle",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Solid Armor",
        "Description": "Armor covers every inch of these large Heartless, allowing them to deflect blows from every direction. \r\nInstead, aim for the head and knock them down, rendering them vulnerable to further attack. Use Blizzard magic to keep them down longer. \r\n",
        "Worlds": [],
        "Characters": [
          "Solid Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spiked Crawler",
        "Description": "Sharp spikes cover these large Heartless. Though they are impervious during their spin attack, you can slow their onslaught with a block, bringing them to an eventual halt. \r\nAlternatively, Thunder magic will stop them with a single blast. \r\n",
        "Worlds": [],
        "Characters": [
          "Spiked Crawler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Stalwart Blade",
        "Description": "This magic-resistant knight Heartless's skillful defense makes it tough to finish off. \r\nThough its focused slash can be stopped with a block, blasting the knight with Aeroga while it is storing up energy will stagger it, opening it up to extra damage, especially from magic. \r\n",
        "Worlds": [
          "Twilight Town",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Stalwart Blade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Storm Bomb",
        "Description": "These mid-sized Heartless begin a countdown to self-detonation if you deflect their head-butts with a block. \r\nAvoid being sucked in by the whirlwind they produce during the countdown by jumping or gliding away. \r\n",
        "Worlds": [
          "Twilight Town"
        ],
        "Characters": [
          "Storm Bomb(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Striped Aria",
        "Description": "These small flying Heartless boast high defense and are resistant to physical attacks. Take them down with magic. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Wonderland"
        ],
        "Characters": [
          "Striped Aria(s)"
        ],
        "AdditionalInformation": "Time-based attacks like their time missiles can rewind your defense to LV1, which causes you to take more damage than normal."
      },
      {
        "Title": "Switch Launcher",
        "Description": "These mid-sized cannon Heartless fire shots that rain down from above. Use dodge rolls or air slides to evacuate the target area. \r\nTheir head-on shots can't be blocked, and will also warp victims into point-blank range. \r\nRegular attacks won't throw them off balance. Be careful. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Switch Launcher(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tailbunker",
        "Description": "These large aerial Heartless are hard to hit in mid-flight. \r\nStrike their wings and tail to force them to land, then target the head, which is susceptible to Blizzard magic. \r\n",
        "Worlds": [
          "Twilight Town",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Tailbunker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tentaclaw",
        "Description": "This tentacle-shaped Heartless strikes with a savage bite. Block it or dodge roll out of the way, then counterattack. \r\n",
        "Worlds": [
          "Halloween Town"
        ],
        "Characters": [
          "Tentaclaw(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tricky Monkey",
        "Description": "Raw noise is the chief weapon of these large Heartless which lurk in treasure chests. \r\nReturn their sound bullets and avoid getting flip-footed by blocking. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Tricky Monkey(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Turquoise March",
        "Description": "These small flying Heartless shoot water missiles. \r\nAttacking a Turquoise March in mid-cast won't interrupt its magic, so strike fast! \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Turquoise March(es)"
        ],
        "AdditionalInformation": "Water-based attacks can damage-drain targets, awarding their HP to the attacker."
      },
      {
        "Title": "Veil Lizard",
        "Description": "This camouflaged creature attacks prey with a tongue lash attack. \r\nBlock it to dizzy the lizard, then strike back. You can nullify its camouflage with a solid hit. \r\n",
        "Worlds": [],
        "Characters": [
          "Veil Lizard(s)"
        ],
        "AdditionalInformation": "Light-based attacks like its glare will zap your radar, disabling the map."
      },
      {
        "Title": "Wavecrest",
        "Description": "These large aerial Heartless use their potent water breath to attack their prey. \r\nThis strain cannot be forced to land, so be sure to face them well-equipped to do combat in midair. \r\n",
        "Worlds": [],
        "Characters": [
          "Wavecrest(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Windstorm",
        "Description": "These large aerial Heartless use their potent whirlwind breath to attack their prey. \r\nThey are hard to hit in mid-flight, so strike their wings and tail to force them to land, then focus attacks on their head, which is weak against Thunder magic. \r\n",
        "Worlds": [],
        "Characters": [
          "Windstorm(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Yellow Opera",
        "Description": "These small flying Heartless strike with head-butts and Thunder magic that can't be interrupted by attacking. \r\n",
        "Worlds": [
          "Twilight Town",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Yellow Opera(s)"
        ],
        "AdditionalInformation": "Lighting-based attacks can jolt you. Coming into contact with something in that state will cost you up to 10% of your max HP."
      },
      {
        "Title": "Zip Slasher",
        "Description": "This sword-wielding Heartless's skillful defense makes it tough to finish off. \r\nIts spinning slash has the added effect of damage-draining HP from victims. Watch for it, then evade or deflect it with a block. \r\n",
        "Worlds": [
          "Twilight Town",
          "Agrabah",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Zip Slasher(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dusk",
        "Description": "These lesser Nobodies handle simple combat, recon and courier operations. \r\nThough lacking in strength, they have a robust repertoire of close-range tactics, including spinning charge and arm thrust attacks. \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Dusk(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx",
        "Description": "The Organization's No. VII. Usually cool and calm, he turns into a berserker when he grips his giant blade in combat. \r\nDodge his attacks as you watch for a rare opening. After taking damage, he will revert to his normal self, making him more susceptible to attack. Finish him quickly. \r\n",
        "Worlds": [],
        "Characters": [
          "Saïx"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Samurai",
        "Description": "An advanced Nobody well-suited to combat in close quarters. \r\nIt pairs naturally high attack power with a dual blade attack that brings targets into submission. \r\nThese Nobodies serve under Roxas. \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Samurai(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar",
        "Description": "The Organization's No. II, a master of the arrowgun and spatial manipulation. As a long-range fighter, he'll try to keep foes from closing in by warping away as he fires. \r\nThe full salvo attack he uses in desperate situations is truly devastating. \r\n",
        "Worlds": [],
        "Characters": [
          "Xigbar"
        ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts Birth By Sleep": [
      {
        "Title": "Archraven",
        "Description": "Usually these foes keep to the air, but if you see their bodies glow red, be ready for a quick lunge. Archravens will make off with prizes lying in the field. Why? Becaws they like to. Use jumping or long-range attacks to beat them to the punch. \r\n",
        "Worlds": [
          "Enchanted Dominion",
          "Radiant Garden",
          "Dwarf Woodlands",
          "Neverland"
        ],
        "Characters": [
          "Archraven(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Axe Flapper",
        "Description": "These baddies will launch razor-sharp gusts of wind at you faster than you can say, \"Axe Flapper.\" Keep your distance and give yourself room to dodge! Beware: Just because you've taken one down doesn't mean you've taken it out. Get hasty and wander too close, and it will counter with a Rising Slash. \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Axe Flapper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Belly Balloon",
        "Description": "Radiant Garden: \r\nDeep Space: \r\nThis big guy's weak spot? The valve on its back. It will do anything in its power to keep it out of sight. \r\nPerforming a successful counterattack will cause it to recoil. Once you have access to its weakness, attack quickly with force! \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Belly Balloon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blobmob",
        "Description": "What's translucent, jiggly and boasts a wide variety of attacks? Hint: It's on this page! These pests will divide and multiply if you hit them. Annoying much? Look for an opening so you can take them out in one fell swoop. \r\n",
        "Worlds": [
          "Deep Space",
          "Neverland",
          "Disney Town"
        ],
        "Characters": [
          "Blobmob(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blue Sea Salt",
        "Description": "Don't expect these chilly adversaries to hold still; you'll need to lock on if you want your blows to connect. Use Fire attacks to melt them down to size. When in peril, they pull out their most powerful attack, Deep Freeze. Careful you don't get iced. \r\n",
        "Worlds": [
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Deep Space",
          "Mysterious Tower",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Blue Sea Salt(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bruiser",
        "Description": "Need proof that size matters? Wait till one of these juggernauts lays down the hurt with its high-octane attacks. Their shock waves have a lot of range, so be sure to keep your distance. All that extra weight is bound to tucker a Bruiser out. Wait for signs of fatigue, then put the big guy to sleep. \r\n",
        "Worlds": [
          "Dwarf Woodlands",
          "Castle of Dreams",
          "Enchanted Dominion",
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Mysterious Tower",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Bruiser(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Buckle Bruiser",
        "Description": "Buckles! Who knew? Sadly, they serve a purpose: keeping this Bruiser's sturdy armor strapped on. Head-on attacks won't work. You'll need to get behind it to hit its weak spot (try magic!) but don't get careless just because it's slow. Buckle rhymes with knuckle, which rhymes with pain, which you'll be seeing a lot if you're not ready to block. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Buckle Bruiser(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Chrono Twister",
        "Description": "Even Unversed need somebody to boss them around. The Chrono Twister is happy to do the job. CTs like to hide inside their hour-glasses, but when the sand runs out and reveals their true form, woe is you! They're going to hit you with Stopga. You don't want that. Use combos to flip that hourglass before the sand runs out. \r\n",
        "Worlds": [
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Deep Space",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Chrono Twister(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Cursed Coach",
        "Description": "Unversed come from negativity—in this case, that of Lady Tremaine and her two daughters. This wicked ride had a couple of neat tricks, like using its vines to generate Thornbites. It tried to attack Cinderella, but Aqua quickly put the brakes on that scheme. \r\n",
        "Worlds": [
          "Castle of Dreams"
        ],
        "Characters": [
          "Cursed Coach(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Element Cluster",
        "Description": "This Unversed is composed of three different elements. Zero in on the middle one—that's its weakness. \r\nPrepare a Command Deck with fire, blizzard, and thunder attacks. And don't forget Command Styles! When the elements line up, it's your chance to earn massive points! \r\n",
        "Worlds": [],
        "Characters": [
          "Element Cluster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flame Box",
        "Description": "This boxlike Unversed launches fireballs at its enemies. Destroy them before they destroy you! \r\nDon't get hit, or you'll lose precious seconds. Shotlocks or wide-range magic attacks are your friend! \r\n",
        "Worlds": [],
        "Characters": [
          "Flame Box(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Floating Flora",
        "Description": "True to its name, this Unversed floats in the air—with a little help from its enemies. Hit it numerous times, and watch it fly up into the sky! \r\nDon't let it fall; you'll lose precious time. Rest is for the weak. Attack, attack, attack! \r\n",
        "Worlds": [],
        "Characters": [
          "Floating Flora(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flood",
        "Description": "Just because these foes like to dart around as they strike doesn't mean you should get antsy yourself. Lock on and let your keyblade do the talking. Careful, though: your attacks won't hit if the Floods have seeped into the ground. \r\n",
        "Worlds": [
          "Enchanted Dominion",
          "Castle of Dreams",
          "Dwarf Woodlands",
          "Mysterious Tower",
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Flood(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Glidewinder",
        "Description": "These speed demons will slam right into you if you're not careful. Take them out using long-range attacks, or use contraptions in the field against them. Apparently Glidewinders have a thing for racing—at least if sightings in a certain world are to be believed... \r\n",
        "Worlds": [],
        "Characters": [
          "Glidewinder(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gluttonous Goo",
        "Description": "This Unversed loves its orbs; it won't give them up easily! It'll lose its clutch when attacked, but be quick on your toes, or it'll snatch them back up before you can say \"goo\". \r\nWhen it's about to attack, be ready to counterattack for a chance at seizing its precious treasures. \r\n",
        "Worlds": [],
        "Characters": [
          "Gluttonous Goo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hareraiser",
        "Description": "Radiant Garden: \r\nCute? Guess again. Meet the anti-cuddly. What kind of brute hits you with its ears? After one of these auricular assaults, you'll have a chance to show Bunny who's boss. Take it! \r\n",
        "Worlds": [
          "Castle of Dreams",
          "Dwarf Woodlands",
          "Mysterious Tower",
          "Olympus Coliseum",
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Hareraiser(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iron Imprisoner I",
        "Description": "A special Unversed that can only be found in the Mirage Arena. The chains around its body keep its true power contained. It can, however, use the cage it carries to trap you and deny you freedom. \r\n",
        "Worlds": [
          "Mirage Arena"
        ],
        "Characters": [
          "Iron Imprisoner"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iron Imprisoner II",
        "Description": "A special Unversed that can only be found in the Mirage Arena. Both its arms have been freed of their chains, allowing the brute to use an enormous hammer to attack. \r\n",
        "Worlds": [
          "Mirage Arena"
        ],
        "Characters": [
          "Iron Imprisoner"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iron Imprisoner III",
        "Description": "A special Unversed that can only be found in the Mirage Arena. Both arms and both legs have been freed of their chains, rendering the Iron Imprisoner more powerful than ever before. \r\n",
        "Worlds": [
          "Mirage Arena"
        ],
        "Characters": [
          "Iron Imprisoner"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iron Imprisoner IV",
        "Description": "A special Unversed that can only be found in the Mirage Arena. Chains no longer keep this ultimate adversary's power in check. It exists on a higher plane, to which lesser creatures may never aspire. \r\n",
        "Worlds": [
          "Mirage Arena"
        ],
        "Characters": [
          "Iron Imprisoner"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Jellyshade",
        "Description": "These floaters are known to attack in groups, and sometimes even entire colonies. Each color is weak against a different element, making it hard to put the kibosh on their collective jiggle. \r\nWhen in doubt, start smacking them with the Keyblade. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Deep Space",
          "Neverland"
        ],
        "Characters": [
          "Jellyshade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Jellyshade (Unversed Mission)",
        "Description": "This Unversed likes to attack in swarms. There's no time to rest: destroy them as quickly as possible! \r\nTaking them out one by one is a waste of time and energy. Use commands that cover a lot of ground to take out oodles at once! \r\n",
        "Worlds": [],
        "Characters": [
          "Jellyshade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lone Runner",
        "Description": "This Unversed mostly keeps to itself, but what it lacks in aggression, it makes up for in speed. \r\nHigh-level Shotlocks or wide-range attacks are essential to take out handfuls at once! \r\n",
        "Worlds": [],
        "Characters": [
          "Lone Runner(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mad Treant",
        "Description": "This giant, tree-shaped Unversed tried to get the jump on Ventus in Dwarf Woodlands. It could chuck poisonous fruit, it could launch vicious attacks...But could it defeat Ven? Nope. \r\n",
        "Worlds": [
          "Dwarf Woodlands"
        ],
        "Characters": [
          "Mad Treant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mandrake",
        "Description": "Normally, Mandrakes hide in the ground and attack from afar with their Leaf Cutters—and that's when they're still playing nice. If you get too close, they'll leap out of the ground and try to poison you, or else confuse you with the pollen they spew into the air as they charge. \r\n",
        "Worlds": [
          "Radiant Garden",
          "Olympus Coliseum",
          "Never Land",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Mandrake(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Metamorphosis",
        "Description": "This giant, floating Unversed showed up while Ventus was sailing through the Lanes Between. It then took refuge on a transport ship in Deep Space. Despite its most blubbery efforts to sabotage the ship, the Metamorphosis was simply no match for Ven and Experiment 626's teamwork. \r\n",
        "Worlds": [
          "Deep Space"
        ],
        "Characters": [
          "Metamorphosis(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mimic Master",
        "Description": "A special Unversed that can only be found in the Mirage Arena. It uses the book it carries to unleash an arsenal of attacks. Worse yet, it can absorb information about opponents and transform identical copies. \r\n",
        "Worlds": [],
        "Characters": [
          "Mimic Master(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Monotrucker",
        "Description": "These road warriors zoom around and pick a fight... with pickaxes. It's hard to get a bead on a Monotrucker if it's too far away, so find the right time to move in, then finish it off in one fell swoop. \r\n",
        "Worlds": [
          "Dwarf Woodlands",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Monotrucker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Prize Pod",
        "Description": "You don't see these rare Unversed every day. Attacking or defeating them causes them to drop rare items called \"delicious prizes.\" Mmm! Prize Pods won't attack you, but they will skedaddle the moment they're spotted. You'll have to chase them down if you want dibs on all that deliciousness. \r\n",
        "Worlds": [],
        "Characters": [
          "Prize Pod(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Red Hot Chili",
        "Description": "Don't expect these spice churls to hold still; you'll need to lock on if you want your blows to connect. Use Blizzard attacks to douse their fires for good. They may try to slam into you while ablaze, so be ready to stop, drop and roll—or at least roll. \r\n",
        "Worlds": [
          "Enchanted Dominion",
          "Castle of Dreams",
          "Dwarf Woodlands",
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Red Hot Chili(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ringer",
        "Description": "This Unversed appears one after another until there's a horde. Keep your eye on the first one that materializes, as that's the one to destroy. \r\nWhatever you do, don't attack the wrong one! It will shave precious seconds off your time. \r\n",
        "Worlds": [],
        "Characters": [
          "Ringer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Scrapper",
        "Description": "These baddies like to wait for an opening. If you start swatting your Keyblade around without paying attention, the Scrappers will have their claws all over you in no time. Stay alert! Of course you could look for an opening yourself...Scrappers do tend to move in straight lines. \r\n",
        "Worlds": [
          "Enchanted Dominion",
          "Castle of Dreams",
          "Dwarf Woodlands",
          "Mysterious Tower",
          "Radiant Garden",
          "Disney Town",
          "Olympus Coliseum",
          "Deep Space",
          "Neverland"
        ],
        "Characters": [
          "Scrapper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shoegazer",
        "Description": "Olympus Coliseum:   \r\nWhen it comes to these foot soldiers, the more the scarier, they like to team up for a combination attack, so bring them to heel one at a time. They like to tuck their heads in when the going gets rough. Most attacks can't hurt them while they do. \r\n",
        "Worlds": [
          "Castle of Dreams",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Shoegazer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sonic Blaster",
        "Description": "This troublemaker touts two styles: seek mode and attack mode. It likes to keep its distance. While in seek mode, the Sonic Blaster will shine a searchlight on you and try to lock on multiple times. Steer clear and strike first! \r\n",
        "Worlds": [
          "Deep Space",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Sonic Blaster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spiderchest",
        "Description": "It's a chest...that's a spider. Got it? Good, because opening the wrong treasure chest could cause you an itsy-bitsy bit of trouble—poisonous trouble. These guys are bad news. If you see one burrow, wait to catch it when it comes up for air. Defeating it will net you a ton of prizes. \r\n",
        "Worlds": [
          "Castle of Dreams",
          "Dwarf Woodlands",
          "Disney Town",
          "Olympus Coliseum",
          "Neverland"
        ],
        "Characters": [
          "Spiderchest(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Symphony Master",
        "Description": "Unversed come from negativity—this one from Lady Tremaine and her daughters' jealousy as they watched Cinderella quite literally have a ball with the Prince. For a bad guy, the Symphony Master had a pretty okay act: three whole instruments! Sadly, they were instruments of doom, so Terra had to kick this maestro off the podium. \r\n",
        "Worlds": [
          "Castle of Dreams"
        ],
        "Characters": [
          "Symphony Master(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tank Toppler",
        "Description": "Let's get this out of the way: these foes have gas—as in they're filled with it. Hitting them head-on will cause them to blow up; get caught in the blast and you're talking major damage. Conveniently, all Tank Topplers come fitted with shutoff valves on their backs. Move around behind them and hit the valves to avoid an explosive end. \r\n",
        "Worlds": [
          "Radiant Garden",
          "Disney Town",
          "Deep Space",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Tank Toppler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Thornbite",
        "Description": "Make no mistake, a Thornbite by any other name would still smack you around. Those vines lash out further than you might think, sending you flying if you don't watch it. Direct attacks cause these plant pests to start glowing and gain a dangerous burst of speed. Use magic commands to spare yourself the prickly predicament. \r\n",
        "Worlds": [
          "Enchanted Dominion",
          "Castle of Dreams"
        ],
        "Characters": [
          "Thornbite(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Trinity Armor",
        "Description": "This giant Unversed turned up in Radiant Garden. Its three components had a nasty knack for assembling and disassembling and generally causing Ventus, Terra and Aqua a lot of headaches. Still, look whose teamwork won out in the end! \r\n",
        "Worlds": [
          "Radiant Garden"
        ],
        "Characters": [
          "Trinity Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Triple Wrecker",
        "Description": "This is actually three Unversed joined together, each with a different element. Remember that the middle element calls the shots, and you won't run into too much trouble. Fortunately, the Triple Wrecker doesn't know that many ways to wreck. Wait for an opening—like when it's shifting formation, for example. \r\n",
        "Worlds": [
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Triple Wrecker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Vile Phial",
        "Description": "Annoyingly, these Unversed focus on healing their buddies. Hitting them will draw their fire—not a bad thing, really, when the alternative is pumping their comrades full of HP. Fact: Confusing a Vile Phial will cause it to heal you instead. \r\n",
        "Worlds": [
          "Disney Town",
          "Olympus Coliseum",
          "Deep Space",
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Vile Phial(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Vitality Vial",
        "Description": "Friend or foe? This Unversed releases clouds of HP restoring goodness when attacked. \r\nHowever, it's wise to have plenty of restoration commands on hand in case you can't keep up! \r\n",
        "Worlds": [],
        "Characters": [
          "Vitality Vial(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wheel Master",
        "Description": "They say danger always looms close, and this baddie from Enchanted Dominion took that to a whole new level. To attack, the Wheel Master used... wait for it... its wheel. Also thread. But what cruel timing, tearing up the audience chamber right while Terra was in the midst of his pangs of remorse! Not ever nice at all. \r\n",
        "Worlds": [
          "Enchanted Dominion"
        ],
        "Characters": [
          "Wheel Master(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wild Bruiser",
        "Description": "This simple-minded simian still packs quite a punch. Thankfully, its feet don't move much faster than its brain, so once the coast is clear, you can rush in, deal some damage, and escape before the monkey business resumes. Wild Bruisers home in on you when they charge; dodging works better than blocking if you want to set up counterattack. \r\n",
        "Worlds": [
          "Neverland"
        ],
        "Characters": [
          "Wild Bruiser(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Yellow Mustard",
        "Description": "Don't expect these crafty condiments to hold still; you'll need to lock on if you want your blows to connect. Use Blizzard attacks to chill them out. Also, don't be that guy (or gal!) who gets slammed by an electrified Yellow Mustard. It's so difficult to explain to friends. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Deep Space",
          "Neverland",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Yellow Mustard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkball",
        "Description": "A Heartless whose heart has been lost within the darkness. \r\nIt teases its prey by teleporting randomly, and surprises them with its chomping attack. \r\n",
        "Worlds": [
          "Dark World"
        ],
        "Characters": [
          "Darkball(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Neoshadow",
        "Description": "A Heartless whose heart has been lost within the darkness. \r\nIt looks and acts like a Shadow, but is more agile. \r\n",
        "Worlds": [
          "Dark World"
        ],
        "Characters": [
          "Neoshadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "A Heartless whose heart has been lost within the darkness. \r\nIt appeared with the darkness that encroached the world, and is searching for a heart to prey on. \r\n",
        "Worlds": [],
        "Characters": [ "Shadow(s)" ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts Re:Coded": [
      {
        "Title": "Air Soldier",
        "Description": "Winged Heartless that can strike from midair. Don't let their frantic flying throw you off; be patient and eventually you'll spot your chance to attack. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Agrabah"
        ],
        "Characters": [
          "Air Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Angel Star",
        "Description": "Aerial Heartless that are capable of firing off a number of offensive magics. However, with low HP, these \"angels\" are quick to fall. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Hollow Bastion"
        ],
        "Characters": [
          "Angel Star(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bandit",
        "Description": "Heartless who hang their hats in Agrabah. Don't let them trick you into rushing in blindly—those long swords they carry aren't just for show. Take your time and fight them on your terms. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Behemoth",
        "Description": "A slow and lumbering Heartless—and be thankful for that, because the power at its command is tremendous. Be especially careful not to get trampled. \r\n",
        "Worlds": [],
        "Characters": [
          "Behemoth(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Black Fungus",
        "Description": "Tough-as-tacks Heartless that boost their Defense and produce puffs of poison when struck. Good luck defeating one—but lucky you if you do! \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Black Fungus(i)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blox Bug",
        "Description": "Heartless that pose as blox, biding their time until careless passersby wander just a little too close. \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Blox Bug(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Blue Rhapsody",
        "Description": "Spell-slinging Heartless who like to chill in midair. Their other hobby; chilling YOU with Blizzard magic—and don't expect them to sit still if you try to chase them down. Good thing they don't have much HP. \r\n",
        "Worlds": [
          "Wonderland",
          "Agrabah",
          "System Sector"
        ],
        "Characters": [
          "Blue Rhapsody(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Danger Bug",
        "Description": "Heartless that pose as danger blox. Just touching them will harm you, so keep your distance when you fight. \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Danger Bug(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkball",
        "Description": "Heartless hewn from the very shadows. Usually they just waft through the air, but they can be annoyingly unpredictable, bobbing around erratically or charging right at you without a moment's warning. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "System Sector"
        ],
        "Characters": [
          "Darkball(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside",
        "Description": "A giant, heavy-hitting Heartless that tried to put Sora's lights out. And while Sora triumphed over the Darkside, he wasn't ready for the downside: getting swept into the dark torrent that ensued. \r\n",
        "Worlds": [],
        "Characters": [
          "Sora",
          "Darkside(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Defender",
        "Description": "Heartless that tote eerie shields which bite at you, cast Fire and Blizzard—and, of course, repel your attacks. Thankfully, Defenders are slow and easy to get the jump on. \r\n",
        "Worlds": [
          "Hollow Bastion",
          "System Sector"
        ],
        "Characters": [
          "Defender(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Eliminator",
        "Description": "The kind of Heartless nightmares are made of. In addition to having high Strength, it can use its shield to repel attacks, and it will teleport after you if you try to create some distance. Attempt this fight knowing that it may be your last. \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Eliminator(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fat Bandit",
        "Description": "Tubby tough guys who show up in Agrabah. These Heartless balance offense and defense, flinging fire one moment and belly-bouncing back your attacks the next. While formidable opponents, they are anything but fast, and leave themselves wide open if you know where to strike. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Fat Bandit(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gold Tricholoma",
        "Description": "A rare Heartless. On the off chance you do find one, it will flee left and right and soon disappear if you don't keep it in your clutches. They're not easy to defeat—but rewards await if you do. \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Gold Tricholoma(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Green Requiem",
        "Description": "Spell-slinging Heartless that drift in midair, ready to cast Cure magic if one of their cohorts' HP drifts into the red. They can heal themselves, too, and will try to flee if you attack them. Good thing they don't have much HP. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Green Requiem(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Guard Armor",
        "Description": "The hulking head honcho of the Heartless haunting Traverse Town. Before you can say that five times fast, this brute will have already blasted you with its powerful cannon, so keep your eyes peeled: if it assumes a defensive stance, rush in there first and clobber the creep with a combo. \r\n",
        "Worlds": [
          "Traverse Town"
        ],
        "Characters": [
          "Guard Armor(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Metal Bug",
        "Description": "Heartless that pose as metal blox. They have high Defense, so try to sneak in as many attacks as you can while their guard is down. \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Metal Bug(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Prize Bug",
        "Description": "Heartless that pose as prize blox, but they don't stick around for long. When threatened, they scramble hither and thither, and eventually disappear. If you want to defeat one, do it quickly. \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Prize Bug(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Red Nocturne",
        "Description": "Spell-slinging Heartless that float on the breeze, but that doesn't mean they're a breeze to take down. Keep your distance and they'll try to toast you with Fire magic; get too close and they'll run away. Good thing they don't have much HP. \r\n",
        "Worlds": [
          "Traverse Town",
          "Wonderland",
          "Agrabah"
        ],
        "Characters": [
          "Red Nocturne(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "Heartless which lurk here, there, and everywhere. They hide themselves beneath their own shadows as they draw close to their prey, then lash out with sharpened claws. Don't want to get caught shadowboxing? Then wait till they surface to strike. \r\n",
        "Worlds": [
          "Traverse Town",
          "Agrabah",
          "System Sector",
          "Destiny Islands",
          "Olympus Coliseum"
        ],
        "Characters": [
          "Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Soldier",
        "Description": "Strangely perky Heartless which show up just about anywhere you look (as well as a few places you don't). They lunge at the first prey they spot. \r\n",
        "Worlds": [
          "Traverse Town",
          "Wonderland",
          "Destiny Island"
        ],
        "Characters": [
          "Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora's Heartless (Neo Darkside)",
        "Description": "Sora's Heartless, who has gained incredible power within the confines of the datascape. He can dive underground and then reemerge for a brutal attack, so stay on your toes and be ready to dodge. \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Sora’s Heartless"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora's Heartless (True Form)",
        "Description": "Sora's Heartless, empowered further within the datascape. Faced with countless Keyblades and ruthless attacks, Sora had to struggle just to stay in the fight. \r\n",
        "Worlds": [
          "System Sector"
        ],
        "Characters": [
          "Sora’s Heartless"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Trickmaster",
        "Description": "Characters; Trickmaster(s), Sora \r\nThe Heartless responsible for the memory mix-up in Wonderland. Its fiery juggling and uncanny ability to turn space topsy-turvy gave Sora a run for his money. Wait for an opening, than use projectiles to put a frown on this clown. \r\n",
        "Worlds": [
          "Wonderland"
        ],
        "Characters": [
          "Trickmaster(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wizard",
        "Description": "Heartless with a knack for magic. Fire? Check. Blizzard? Yup. Thunder? You bet. Wizards are pros at all of it, but they do have one fatal flaw: low HP. \r\n",
        "Worlds": [
          "Olympus Coliseum",
          "Hollow Bastion"
        ],
        "Characters": [
          "Wizard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wyvern",
        "Description": "Large, flying Heartless that drive straight at their prey from above. Unfortunately, \"the bigger they are\" doesn't apply here; Wyverns move fast and mean business. Hit them with magic, though, and you can reduce their altitude, bringing them down within reach of a jumping attack. \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Wyvern(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Yellow Opera",
        "Description": "Floating, spell-slinging Heartless—but don't fall for the friendly ghost act. They will zap you with Thunder magic at the first chance they get, and zoom away if you try to go after them. Good thing they don't have much HP. \r\n",
        "Worlds": [
          "Wonderland",
          "Agrabah"
        ],
        "Characters": [
          "Yellow Opera(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Data-Riku",
        "Description": "A digital representation of Riku who went rogue under Pete's control. He is fast, adept at combos, and boasts both high Strength and Defense. Beware his Dark Aura, which will immediately put you in serious danger if you fail to dodge \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Data-Riku",
          "Riku",
          "Pete"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "???",
        "Description": "Sora's final and most formidable opponent in Castle Oblivion, a mysterious figure who attacked with not one Keyblade, but two. \r\n",
        "Worlds": [
          "Castle Oblivion"
        ],
        "Characters": [
          "Data-Roxas",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dragon Maleficent",
        "Description": "Maleficent's dragon form, a fearsome foe with her own magic and all the powers of evil at her disposal. Get her to stagger, then climb up her back and direct a combo at her head to knock her out. \r\n",
        "Worlds": [
          "Hollow Bastion"
        ],
        "Characters": [
          "Maleficent",
          "Dragon Maleficent"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ice Titan",
        "Description": "A glacial giant who haunts the innermost reaches of the Olympus Coliseum labyrinth. Any one of his ice attacks poses a titanic threat; combine those with high Defense, and you've got one tough opponent to melt. Hit him with everything you've got! \r\n",
        "Worlds": [
          "Olympus Coliseum"
        ],
        "Characters": [
          "Ice Titan"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar",
        "Description": "A wizard who served as Agrabah's royal vizier. With Jafar teleporting out of harm's way and creating illusions from thin air, it took everything Sora had just to keep up. \r\n",
        "Worlds": [
          "Agrabah"
        ],
        "Characters": [
          "Jafar"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pete",
        "Description": "Maleficent's lackey, a time-and-again troublemaker who has snuck into the datascape for some nefarious purpose. Pete has gained new powers: the ability to teleport and strike from a distance. He can even use D-Thundaga. \r\n",
        "Worlds": [
          "Castle Oblivion"
        ],
        "Characters": [
          "Pete"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rock Titan",
        "Description": "An immortal giant whose body is made of stone. Needless to say, one punch from this prodigious paperweight packs a wicked wallop, so be ready to restore your HP just as soon as you get hit. \r\n",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Rock Titan" ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts Dream Drop Distance": [
      {
        "Title": "Aura Lion",
        "Description": "Self-styled king of the dream jungle—and he does look pretty regal when he's firing off that aura. But bow not to this king; it's your turn to dodge and deliver. \r\n",
        "Worlds": [
          "Country of the Muskteteers",
          "The Grid"
        ],
        "Characters": [
          "Aura Lion(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Beatalike",
        "Description": "A ferocious looking Zolephant who's sweet as sugar to his pals, but a bestial brute to his foes! \r\n",
        "Worlds": [],
        "Characters": [
          "Beatalike(s)",
          "Zolephant(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Brawlamari",
        "Description": "A six-armed arsenal with twin sword-acles, four laser-cles, and a million ways to use 'em. \r\n",
        "Worlds": [],
        "Characters": [
          "Brawlamari(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Catanuki",
        "Description": "This mischievous Meow Wow look-alike wears his leaf proudly. A natural-born trickster, he surprises everyone with his crazy antics. \r\n",
        "Worlds": [],
        "Characters": [
          "Catanuki(s)",
          "Meow Wow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Cera Terror",
        "Description": "This Dream Eater has two modes, high defense, and a mastery of melee. \r\nBut magic is enough to mire it, and it's prone to negative status effects. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers",
          "The World That Never Was",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Cera Terror(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Char Clawbster",
        "Description": "A fire-slinging, tail-spinning speed demon that will cling to the ceiling one moment and dance circles around you the next. \r\n",
        "Worlds": [
          "Monstro"
        ],
        "Characters": [
          "Char Clawbster"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Chef Kyroo",
        "Description": "Frogs' legs are definitely not on this foodmeister's menu. He's skilled with a skillet and ready to serve up all kinds of surprises. \r\nChill Clawbster \r\nA feisty fighter that's packing pincers, lasers, bombs, and all kinds of nastiness. Watch out when it overheats; that's when it pulls out the real heavy artillery. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery",
          "Prankster’s Paradise"
        ],
        "Characters": [
          "Chef Kyroo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Commantis",
        "Description": "A persistent customer that attacks by firing discs and light ribbons. \r\nYou can wear it down, but it will get right back up as soon as it's done recharging. \r\n",
        "Worlds": [
          "The Grid"
        ],
        "Characters": [
          "Commantis"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Cyber Yog",
        "Description": "Here's a hircine hazard that shoots lasers from its horns. Once the blast-a-thon subsides, though, it's open season. \r\n",
        "Worlds": [
          "The Grid"
        ],
        "Characters": [
          "Cyber Yog(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Drak Quack",
        "Description": "This quack likes to toy around, dancing maddeningly out of reach and blasting you with fireworks. Close the distance and shut this clown down. \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Drak Quack(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Drill Sye",
        "Description": "Once upon a time, there was a powerful rhino that could transform into a ball of spikes but hated magic... Well, you probably know where this is going. \r\n",
        "Worlds": [
          "La Cité des Cloches",
          "Traverse Town"
        ],
        "Characters": [
          "Drill Sye(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ducky Goose",
        "Description": "After a few rounds of Duck Duck Goose with this cracker-packing loon, just about anyone would want to shove him into his own jack-in-the-box. \r\n",
        "Worlds": [
          "Country of the Musketeers"
        ],
        "Characters": [
          "Ducky Goose(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Eaglider",
        "Description": "A total natural in the sky, this super-sniper has the very unfortunate habit of gloating when it lands a shot. \r\n",
        "Worlds": [
          "The Grid",
          "The World That Never Was"
        ],
        "Characters": [
          "Eaglider(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Electricorn",
        "Description": "Do electric unicorns dream of androids? More importantly, can you stop this thunderslinger before it's done gathering juice? \r\n",
        "Worlds": [
          "Symphony of Sorcery",
          "The World That Never Was"
        ],
        "Characters": [
          "Electricorn(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Escarglow",
        "Description": "Homebodies who like to hide in invincible shells. Only problem: too many attacks will cause the shell to pop right off, leading to blushing and potential bruises. \r\n",
        "Worlds": [
          "The Grid",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Escarglow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fin Fatale",
        "Description": "Who ordered fish with lasers? Before you get blasted, bring the thunder, and you might just shock their gills off. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Fin Fatale(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fishboné",
        "Description": "When this fish falls apart, it's only just getting started. It can disassemble itself to dodge and launch lasers from afar. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers"
        ],
        "Characters": [
          "Fishboné(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flowbermeow",
        "Description": "It's fast... it's floral... and unlike Meow Wow, fire won't faze it! Only problem: along with being part dog and cat, this one seems to be part chicken. Beat it and luck might favor you! \r\n",
        "Worlds": [],
        "Characters": [
          "Flowbermeow(s)",
          "Meow Wow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Frootz Cat",
        "Description": "Punishably pink and sinister levels of sweet, this Necho Cat snipes opponents with magic and heals buddies with fancy footwork. \r\n",
        "Worlds": [],
        "Characters": [
          "Frootz Cat(s)",
          "Necho Cat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ghostabocky",
        "Description": "A wight that can blink out of sight and fight with sprite-height frights is tight... but smite it with light and it's nighty-nite, aight? \r\n",
        "Worlds": [
          "Symphony of Sorcery",
          "The World That Never Was"
        ],
        "Characters": [
          "Ghostabocky(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Halbird",
        "Description": "Hit-and-run air strikers that pester their prey. While their tactics are sound, why do they stop to gloat every time they land a hit? \r\n",
        "Worlds": [
          "The Grid",
          "Country of the Musketeers",
          "The World That Never Was"
        ],
        "Characters": [
          "Halbird(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hebby Rep",
        "Description": "Hyperactive and a real handful, these reptiles rock it hard when they roll. Dodge their attacks and then counter! \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "Prankster's Paradise"
        ],
        "Characters": [
          "Hebby Rep(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Hockomonkey",
        "Description": "A wild opponent with two personalities and three types of arms. \r\nThe \"Brute\" switches between beefy bruisers and sproingy jack-in-the-boxers, while the \"Mage\" summons magic hands that float around, blasting magic and bashing heroes. \r\n",
        "Worlds": [
          "Traverse Town"
        ],
        "Characters": [
          "Hockomonkey(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Holey Moley",
        "Description": "A hit-and-run menace that pokes out of the ceiling and walls, flinging stray objects your way or taking swipes with its claws. \r\n",
        "Worlds": [
          "Country of the Musketeers"
        ],
        "Characters": [
          "Holey Moley(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Iceguin Ace",
        "Description": "These chill customers will slip in for the attack and slide out to hit opponents with a blast of cold. To them, fire is most dire. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Iceguin Ace(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Jestabocky",
        "Description": "When this spoofy spook isn't pretending to be prizes, it's trying to nab the real ones...and there's your opportunity to strike. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Traverse Town",
          "Country of the Musketeers"
        ],
        "Characters": [
          "Jestabocky"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Juggle Pup",
        "Description": "Their poker faces are hard to read, and every attack is a gamble, but on a good day these Dream Eaters will \"seal\" the deal. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Traverse Town",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Juggle Pup(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Kab Kannon",
        "Description": "Who wouldn't want a KO Kabuto with a fiercer horn, adaptive ammo switching, and rock-hard defense? Its enemies, that's who. \r\n",
        "Worlds": [],
        "Characters": [
          "Kab Kannon(s)",
          "KO Kabuto(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Keeba Tiger",
        "Description": "What's there to say about this aura wielding speed demon? It doesn't fire its aura that often, so look for your chance and take it! \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Keeba Tiger(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "KO Kabuto",
        "Description": "Country of the Musketeers:   \r\nWith a cannon for a horn and an ironclad frontal defense, this sharpshooting beetle battler will be tough to dent unless you can get behind it. \r\n",
        "Worlds": [
          "The Grid",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "KO Kabuto(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Komory Bat",
        "Description": "These noctilionine nuisances boast quite the repertoire. Supersonic confusion waves? Yep. Vampiric drain attack? Just vunderful... \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "The Grid",
          "Prankster's Paradise"
        ],
        "Characters": [
          "Komory Bat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Kooma Panda",
        "Description": "The bigger they are, the harder they claw... It'll take more than a few punches to the paunch to make this lumbering panda see stars. \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "The Grid",
          "Prankster's Paradise",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Kooma Panda(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lord Kyroo",
        "Description": "Master of the sword and sorcerer with the most, this brave little smartypants makes for a staunch companion... unless he catches fire. \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "The Grid",
          "Prankster's Paradise",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Lord Kyroo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Majik Lapin",
        "Description": "Whoever pulled this rabbit out of a hat taught it a few spells of its own. Fun fact: its left ear and right ear each fire off their own magic! \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Majik Lapin(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Me Me Bunny",
        "Description": "This cutie may play the darling, but watch out: it knows \"bun fu.\" Back away and pick these fluffy pests off from a distance. \r\n",
        "Worlds": [
          "Country of the Musketeers"
        ],
        "Characters": [
          "Me Me Bunny(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Meow Wow",
        "Description": "Cat or dog? Boy or girl? Friend or fiend? One thing's for sure: this Dream Eater is adorable. Warning: fire freaks it out. \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "The Grid",
          "Prankster's Paradise"
        ],
        "Characters": [
          "Meow Wow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Meowjesty",
        "Description": "The crown says it all. Get this Meow Wow mammoth bouncing, and you've got yourself a battlefield full of royal pancakes. \r\n",
        "Worlds": [],
        "Characters": [
          "Meowjest(ies)",
          "Meow Wow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Necho Cat",
        "Description": "This feline knows it's better than you. It doesn't walk—it \"dances.\" It doesn't use magic—it \"hits you with magical awesome.\" Close the distance and put this cat on the mat. \r\n",
        "Worlds": [
          "La Cité des Cloches",
          "Traverse Town",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Necho Cat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Peepsta Hoo",
        "Description": "This wise guy uses Scan to find weaknesses and attacks accordingly. But completing the Scan takes time... Isn't that a weakness, too? \r\n",
        "Worlds": [
          "The Grid",
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Peepsta Hoo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pegaslick",
        "Description": "The Grid:   \r\nWhile this winged, gale-force menace is trying to tether the weather, you should be taking it down before it's too late. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Pegaslick(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pricklemane",
        "Description": "These bouncy pincushions take \"stick and move\" to a whole new level. Look out when they turn red with rage! \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "Prankster's Paradise"
        ],
        "Characters": [
          "Pricklemane(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Queen Buzzerfly",
        "Description": "Queen (as it turns out!) of the Buzzerflies. They fight as a swarm: she pummels with stingers and pollen while her drones take a more direct approach. \r\n",
        "Worlds": [],
        "Characters": [
          "Queen Buzzerfly(ies)",
          "Buzzerfly(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "R & R Seal",
        "Description": "When this siesta-loving Juggle Pup rolls the dice, it might pay off big, or it might just backfire. Hope it bought traveler's insurance... \r\n",
        "Worlds": [],
        "Characters": [
          "R & R Seal(s)",
          "Juggle Pup(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ryu Dragon",
        "Description": "Land and air are two separate play-grounds for this mythical monstrosity. But even a big, smart, fast contender like this can be put on ice (literally). \r\n",
        "Worlds": [
          "Symphony of Sorcery",
          "The World That Never Was"
        ],
        "Characters": [
          "Ryu Dragon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sir Kyroo",
        "Description": "Count on these little guys to stand by your side. They've got the swords and sorcery down, but a dose of fire will melt their courage. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Sir Kyroo(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Skelterwild",
        "Description": "This skelly's head and body are like two pesky Dream Eaters in one, but fire will send it back to the grave. \r\n",
        "Worlds": [
          "The World That Never Was"
        ],
        "Characters": [
          "Skelterwild(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spellican",
        "Description": "A magically malicious opponent that summons crystal puppet-brooms and monstrous meteors to make life generally less pleasant. \r\n",
        "Worlds": [
          "Traverse Town",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Spellican(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Staggerceps",
        "Description": "This distance fighter has a chest-mounted cannon and ammo that can lock down movement and commands. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Staggerceps"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sudo Neku",
        "Description": "A Hebby Repp with stylin' threads and a serious 'tude. Whatever's piped through those phones has turned its \"inner emo\" into \"outer aggro\". \r\n",
        "Worlds": [],
        "Characters": [
          "Sudo Neku(s)",
          "Hebby Repp(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tama Sheep",
        "Description": "This roly-poly Dream Eater loves to sleep, and so will opponents it gets its lamb chops on. At least its defenses are, uh, \"mutton\" to worry about... \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Tama Sheep(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tatsu Blaze",
        "Description": "Prepare for burnination and other horrible punishments at the hands of this fireball-spouting multitalent. \r\n",
        "Worlds": [
          "Traverse Town",
          "Country of the Musketeers"
        ],
        "Characters": [
          "Tatsu Blaze(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tatsu Steed",
        "Description": "These bubble-blowers are deadeyes at long range and punching bags up close. Now where would you rather be? \r\nThunderaffe \r\nYou know how fast lightning is? Well, these Dream Eaters don't... because they leave it in the dust every time. They move in straight lines, though, so just make sure you stay out of their way. \r\n",
        "Worlds": [
          "Prankster's Paradise",
          "Symphony of Sorcery",
          "Traverse Town",
          "Country of the Musketeers",
          "Symphony of Sorcery",
          "The World That Never Was"
        ],
        "Characters": [
          "Tatsu Steed(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Toximander",
        "Description": "These easygoing Dream Eaters still know how to play hardball. While you're snoozin', it's poison and confusion they're oozin'. Approach with caution! \r\n",
        "Worlds": [
          "La Cité des Cloches",
          "Country of the Musketeers"
        ],
        "Characters": [
          "Toximander(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tubguin Ace",
        "Description": "Not your ordinary Iceguin Ace! After chilling in a nice, warm bath, this cool cat is now the master of both fire and ice! \r\n",
        "Worlds": [],
        "Characters": [
          "Tubguin Ace(s)",
          "Iceguin Ace(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tyranto Rex",
        "Description": "The second-or-possibly-first most vicious Dream Eater out there. Put it on ice before it puts you in a tough spot. \r\n",
        "Worlds": [
          "Country of the Musketeers"
        ],
        "Characters": [
          "Tyranto Rex(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ursa Circus",
        "Description": "This big-top buffoon version of Kooma Panda might seem tame, but if the other guys let their guard down, they'll be the ones jumping through hoops. \r\n",
        "Worlds": [],
        "Characters": [
          "Ursa Circus(es)",
          "Kooma Panda(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wargoyle",
        "Description": "Float like a butterfly, sting like a gargoyle. This fiend can do serious damage from a distance, or swoop in for a one-two wallop with its twin hammers. \r\n",
        "Worlds": [
          "La Cité des Cloches"
        ],
        "Characters": [
          "Wargoyle(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Wheeflower",
        "Description": "These Dream Eaters stick by their friends, dishing out flower power to keep their HP in the green. \r\n",
        "Worlds": [
          "La Cité des Cloches",
          "Traverse Town"
        ],
        "Characters": [
          "Wheeflower(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Woeflower",
        "Description": "This Dream Eater is a total downer, inflicting negative status effects left and right and getting pouty when companions leave it behind. \r\n",
        "Worlds": [
          "La Cité des Cloches",
          "Traverse Town",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Woeflower(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Yoggy Ram",
        "Description": "What do rams do? They ram you. Real talk: nobody rams like a ram does. Better wait for an opening! \r\n",
        "Worlds": [
          "Traverse Town",
          "La Cité des Cloches",
          "Symphony of Sorcery"
        ],
        "Characters": [
          "Yoggy Ram(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Zolephant",
        "Description": "Throw this titan into a tizzy and you had better take cover! But once the tantrum tapers off, it's wide open. \r\n",
        "Worlds": [],
        "Characters": [ "Zolephant(s)" ],
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts III": [
      {
        "Title": "Anchor Raider",
        "Description": "This swashbuckler's anchor can hook onto thin air, turning it into a swinging pendulum of pain. Don't watch the anchor, though; it's that extending chain and sharp saber you need to be ready for. \r\nInstead of trying to keep up with it, try letting your magic do the chasing for you. \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Anchor Raider(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Air Soldier",
        "Description": "A Soldier in flight is no cause for fright; just watch for that charging attack and you'll be all right. \r\nWhen they fly out of walloping range, a blast of magic will do the trick. \r\n",
        "Worlds": [
          "Olympus",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Air Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bizarre Archer",
        "Description": "Archers that shoot arrows from their bows. Sound obvious? Well, that's honestly all there is to 'em. \r\nThey pose little threat to you alone, but in packs, they're a problem. Return fire from afar with magic, or close the distance and introduce them to your Keyblade. \r\nThey'll sometimes team up with Air Soldiers. Maybe they're buddies? \r\n",
        "Worlds": [
          "Olympus",
          "Twilight Town",
          "Kingdom of Corona"
        ],
        "Characters": [
          "Bizarre Archer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Catastrochorus",
        "Description": "What's worse than a Heartless? Try three of them, fused into one weird body. \r\nStomping feet and gnashing teeth, an active volcano spewing fire, plus a thundercloud tail raining lightning bolts left and right added up to one bad day in San Fransokyo. \r\n",
        "Worlds": [
          "San Fransokyo"
        ],
        "Characters": [
          "Catastrochorus(es)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Chaos Carriage",
        "Description": "Defensive driving is a foreign concept to these careening carts. Even if you take out the horse pulling them, another one will sprout to take its place. \r\nIf any Powerwilds are around, those carts will stack up into a turret where the Powerwilds can rain pain down on you. Swat the simians before they can make with the monkey business! \r\n",
        "Worlds": [
          "Kingdom of Corona"
        ],
        "Characters": [
          "Chaos Carriage(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Chief Puff",
        "Description": "These fluffians can fling their spores into the air to create Puffballs. Eventually, their own fluff will grow back, but that's nothing a gust of Aero magic won't fix. \r\nKeep clear of the pollen they send up, or you'll come down with an annoying fit of sneezing. \r\n",
        "Worlds": [
          "Kingdom of Corona"
        ],
        "Characters": [
          "Chief Puff(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dark Inferno",
        "Description": "These dastardly dual-wielders are like blenders on roller skates, except worse. You can try to keep your distance, but they'll soon close in on you, or else just huck a fireball your way. \r\nBe careful attacking when their blades are crossed; that means they're ready to counter. Stay cool, bide your time, then strike when they drop their guard. \r\n",
        "Worlds": [
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Dark Inferno(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dark Inferno χ",
        "Description": "The darkness that erupted out of Ventus's heart and turned into an aggressive Heartless. \r\nBut the voice that was heard at the time intimated that it was \"darkness\" itself. What did it mean... \r\n",
        "Worlds": [
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Dark Inferno χ(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside",
        "Description": "A colossal Heartless that arose before Sora in a land of endless sea and sky. \r\nIt looks different from other Darksides Sora has battled with, but the cause remains a mystery. \r\n",
        "Worlds": [
          "The Final World"
        ],
        "Characters": [
          "Darkside(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkside (Re Mind)",
        "Description": "A massive Heartless that stood in the way of Sora's search for fragments of Kairi's heart. \r\nBut in the end, there was no obstacle that could thwart Sora's determination to get Kairi back. \r\n",
        "Worlds": [
          "Scala ad Caelum"
        ],
        "Characters": [
          "Darkside (Re Mind)(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Darkubes",
        "Description": "A shape-shifting swarm of nasty bots that terrorized the streets of San Fransokyo. \r\nIf Hiro hadn't pinpointed the location of the core unit controlling the rest, these baleful boxes might have spelled the end for Sora and Big Hero 6. \r\n",
        "Worlds": [
          "San Fransokyo"
        ],
        "Characters": [
          "Darkubes(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Demon Tide",
        "Description": "Twilight Town: \r\nA dark swarm of Shadows, gathered into a massive, seething cloud. \r\nThe fact that its foul ilk has been seen not just in the realm of darkness but in the realm of light is surely a harbinger of some coming evil. \r\n",
        "Worlds": [
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Demon Tide(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Demon Tower",
        "Description": "A dark swarm of Shadows, stacked into a looming spire. \r\nThe fact that its foul ilk has been seen not just in the realm of darkness but in the realm of light is surely a harbinger of some coming evil. \r\n",
        "Worlds": [
          "Dark World"
        ],
        "Characters": [
          "Demon Tower(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Earth Core",
        "Description": "If you want to rock these baddies' world, aim for the face; their pointy posteriors will only deflect your blows. Physical attacks will pass through them when they sand-travel, but spells still hit home, so mash that magic! \r\nWhen they gather sand and grow enormous, a Goofy Bombardier will cut them down to size in no time. \r\n",
        "Worlds": [
          "Olympus",
          "Kingdom of Corona",
          "The Caribbean"
        ],
        "Characters": [
          "Earth Core(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flame Core",
        "Description": "Make snuffing out these flame-flinging fiends a top priority, or you're toast! And whoever said to fight fire with fire never met these things; your red-hot spells won't even tickle. \r\nWhen in danger, they'll burst into flames and really bring the heat. Douse them with a well-aimed Water or Blizzard spell to chill them out, then finish the job. \r\n",
        "Worlds": [
          "Olympus",
          "Monstropolis"
        ],
        "Characters": [
          "Flame Core(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Fluttering",
        "Description": "Your best bet against these feather-flinging dive-bombers is a blast of magic to keep them still just long enough to lay down some hits. \r\nIf they drop to the floor, get ready for a nasty spinning charge attack. Jump over it and watch them go sailing past. \r\nKeep an eye on the sky when you're out and about; they like to perch on tree branches and other high spots to get the drop on prey. \r\n",
        "Worlds": [
          "Arendelle",
          "Kingdom of Corona",
          "Monstropolis"
        ],
        "Characters": [
          "Fluttering(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Focus Popcat",
        "Description": "Smash these red Popcats to get at the bounty of Focus prizes inside. Invigorating! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Focus Popcat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Frost Serpent",
        "Description": "A skeletal serpent, soaring on wings of snowpack. With a simple spin of its body, it gives rise to icy whirlwinds that gnash and rend all before it. \r\nSound imposing? Bust those wings and it's just a snake with arms. \r\nThat doesn't mean it's entirely toothless on the ground; it can still burrow beneath Sora and his buddies and stab its tail upward. When you see it dive, look alive! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Frost Serpent(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gold Beat",
        "Description": "These electrical enemies zip through the air and zap you. They have to stop and conjure up a sigil before they can rain lightning down on you, so take that chance to exact brutal prevenge. \r\nTheir rapid-fire thunderstorm will electrify you if it connects, so watch for the tell and don't get too close. \r\nAero magic will have them winded in no time flat. If you've got the MP to spare, start flinging those gales! \r\n",
        "Worlds": [
          "Toy Box",
          "Arendelle",
          "Monstropolis",
          "San Fransokyo",
          "The Caribbean"
        ],
        "Characters": [
          "Gold Beat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Grim Guardianess",
        "Description": "Mother Gothel's fall to darkness gave rise to this gargantuan Heartless, and it's even crueler than she was—which is saying something. \r\nWrapping its enormous body around the tower, it used branches and brambles to try and rob Sora, Donald, and Goofy of their freedom. Sounds like Mother Gothel, all right... \r\n",
        "Worlds": [
          "Kingdom of Corona"
        ],
        "Characters": [
          "Grim Guardianess",
          "Mother Gothel",
          "Sora",
          "Donald",
          "Goofy"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Helmed Body",
        "Description": "Basically your garden-variety Large Body...if your garden is full of extra-aggressive monsters (which would raise more questions than it answers, really). \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Helmed Body(ies)",
          "Large Body(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "High Soldier",
        "Description": "These are more or less just like vanilla Soldiers, except way angrier. \r\n",
        "Worlds": [
          "San Fransokyo"
        ],
        "Characters": [
          "High Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "King of Toys",
        "Description": "A colossal Heartless that Young Xehanort summoned to stall Sora and his pals in Toy Box. \r\nThis thing comes with everything. Annoying force field? Check. Hailstorm of missiles? Check. Ridiculously huge tornado that flings around all nearby toys in the area? Yup, that's a check. \r\nAs toys go? Not much fun. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "King of Toys",
          "Young Xehanort",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Large Body",
        "Description": "Don't get bodychecked by these oversized oafs, and watch out for the shock waves when they come down from a jump. Their jelly bellies will bounce any frontal attacks, so circle round to the rear before slashing away. Magic works, too. \r\nGet on their nerves, and they'll turn red and charge at you. A Blizzard spell ought to cool them off. \r\n",
        "Worlds": [
          "Olympus",
          "Twilight Town",
          "Toy Box",
          "Monstropolis",
          "The Caribbean"
        ],
        "Characters": [
          "Large Body(ies)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lich",
        "Description": "This haunting horror held the hearts of Sora's friends hostage. Time and again, Sora fought it back, but with each hard-won victory, it would simply slough its form and depart to another world. \r\nIts broad arsenal of magic made it a formidable foe to face alone, but in the end no Heartless could match the strength of Sora's resolve. \r\n",
        "Worlds": [
          "Dark World"
        ],
        "Characters": [
          "Lich(es)",
          "Sora"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lightning Angler",
        "Description": "A piscine horror lurking beneath the crystal waves of The Caribbean. \r\nA glutton for the greedy, it lures prey in by posing as a treasure chest. An unusual adaptation, but it sure worked on Sora… \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Lightning Angler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Magic Popcat",
        "Description": "Smash these blue Popcats to get at the bounty of MP prizes inside. Energizing! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Magic Popcat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Malachite Bolero",
        "Description": "These blustery baddies dance and whirl on the wind, but can't use magic without stopping to summon their sigil first. That's your cue to blow 'em away. \r\nIf you see wind gathering at your feet, move away—fast. Unless you like getting swept up in a tornado, that is. \r\nNothing freezes them in their tracks quite like Blizzard magic. If you've got the MP to spare, use it to put them on ice! \r\n",
        "Worlds": [
          "Kingdom of Corona",
          "The Caribbean"
        ],
        "Characters": [
          "Malachite Bolero(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Marine Rumba",
        "Description": "These watery wizards swim through the air with the grace of the majestic trout. Before casting magic, they'll come to a stop and summon spheres of water, leaving themselves open to attack. \r\nThink fast if they do start conjuring, because the speed of their spells is no joke! \r\nNothing dries them up faster than a zap of Thunder magic. If you've got the MP to spare, use it to give 'em a thousand-volt jolt! \r\n",
        "Worlds": [
          "Arendelle",
          "Monstropolis",
          "San Fransokyo"
        ],
        "Characters": [
          "Marine Rumba(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Marionette",
        "Description": "This puppet may not seem like such a pain when it rides around on its ring, but just wait until it possesses a nearby toy! \r\nOr, here's a better plan: don't wait until it possesses a nearby toy. Sever this scoundrel's strings on sight. \r\n",
        "Worlds": [
          "Toy Box",
          "Kingdom of Corona"
        ],
        "Characters": [
          "Marionette(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Mechanitaur",
        "Description": "Face it: some Satyrs are haters, and this is what they look like. \r\n",
        "Worlds": [
          "San Fransokyo"
        ],
        "Characters": [
          "Mechanitaur(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Metal Troll",
        "Description": "Imagine a Rock Troll that's always hangry. Yep, that's this guy. \r\nMunny Popcat \r\nSmash these gold Popcats to get at the mountain of munnies inside. Score! \r\n",
        "Worlds": [
          "San Fransokyo",
          "Arendelle"
        ],
        "Characters": [
          "Metal Troll(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Neoshadow",
        "Description": "These souped-up Shadows hit hard and fast with their jump attacks; if they're in the air, better get out of there. \r\nOnce they melt into the ground, they're beyond the reach of most attacks, but that's nothing a little Water magic can't fix. Fight puddles with puddles! \r\n",
        "Worlds": [
          "Twilight Town",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Neoshadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pogo Shovel",
        "Description": "Part shovel, part pogo stick, part drill—and thankfully, all pretty clumsy. Stay calm and sidestep its attacks, especially the pounce; whiffing that one leaves this Heartless flat on its face and wide open. \r\nMost of the time, its shovel will dig up rocks to sling your way, but once in a blue moon it'll hit a mother lode of prizes—all yours for the taking! \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Pogo Shovel(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Pole Cannon",
        "Description": "Approach these turrets and they'll only warp away, so your best bet is to return fire from a distance with magic. \r\nThe extending arm mount allows them a variety of firing positions. Silver lining? You'll look awesome swinging around that pole! \r\n",
        "Worlds": [
          "Toy Box",
          "San Fransokyo"
        ],
        "Characters": [
          "Pole Cannon(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Popcat",
        "Description": "Keep your wits about you when walking past pottery; you never know when it might sprout fuzzy limbs and attack! \r\nOnce these scaredy-cats show themselves, they'll start running around like crazy. If you try to create some distance, they'll huck smaller pots your way, but a well-timed block will return those to sender. \r\nPopcats are top-heavy and prone to face-planting. When they stumble, make sure it's the last trip they take. \r\n",
        "Worlds": [
          "Olympus"
        ],
        "Characters": [
          "Popcat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Powerwild",
        "Description": "These impish chimps swing through the trees and scrabble along walls while pelting you with nuts. Rude! Block whatever they throw and send it right back at 'em. \r\nThey'll taunt and tease and try to bait you into attacking. The best response? Attack! They're wide open the whole time, silly monkeys. \r\n",
        "Worlds": [
          "Twilight Town",
          "Kingdom of Corona"
        ],
        "Characters": [
          "Powerwild(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Puffball",
        "Description": "These wicked weedlings may look cute romping and rolling around, but make no mistake; they will bring the hurt if you let them. \r\n(Don't let them!) \r\n",
        "Worlds": [
          "Kingdom of Corona"
        ],
        "Characters": [
          "Puffball(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Raging Vulture",
        "Description": "Freshly escaped from Davy Jones' Locker, Sora, Jack, and the others were all set to celebrate…until this oversized wet blanket on wings flapped in to ruin the moment. \r\nI suppose an epic air skirmish high above the Black Pearl was one way to mark the occasion. \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Raging Vulture",
          "Davy Jones",
          "Sora",
          "Jack Sparrow"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Rock Troll",
        "Description": "Think this massive, musclebound monster's a slowpoke? Think again. Think it's no big deal when it stops swinging around that huge axe and wears it as a mask? Think again...AGAIN! \r\nJust keep swinging. You may not be able to damage the big guy while he's masked, but you can break his fancy face. \r\n",
        "Worlds": [
          "Olympus",
          "Arendelle",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Rock Troll(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Satyr",
        "Description": "Aside from a mean punch, the biggest threat from these bullies is their stampede attack. They always lower their visor before trying to ram you. If you can break the horns off those helms, you'll get the rest of the fight \"free of charge.\" \r\nIn formation, they're tougher to wrangle. Either break their ranks with a Trinity Guard, or keep your distance and pepper them with magic. \r\n",
        "Worlds": [
          "Olympus",
          "Arendelle"
        ],
        "Characters": [
          "Satyr(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sea Sprite",
        "Description": "If you want to know these fickle fishes' weakness, keep an eye on their color! Just remember this handy rhyme: \r\nIf it's blue, Thunder hits true. \r\nIf it's red, Blizzard instead. \r\nIf it's yellow...something something Fire? \r\nKeep blasting them with their elemental weakness and they'll go belly-up in no time. \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Sea Sprite(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Shadow",
        "Description": "Kingdom of Corona:   \r\nThese shifty shades skulk around, then strike out of the blue. Stay locked on to make sure they don't give you the slip. \r\nThey're immune to normal attacks when they dive beneath the surface, but a splash of Water magic will yank them out of hiding in a hurry! \r\n",
        "Worlds": [
          "Olympus",
          "Twilight Town",
          "Toy Box",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Shadow(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sköll",
        "Description": "A lupine Heartless that rose from the darkness consuming Hans's heart. \r\nWolves hunt in packs, and this monstrosity was no exception: it summoned a horde of phantom packmates, and transformed into a darkness so vast it blotted out the entire sky. \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Sköll(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Soldier",
        "Description": "As threats go, these aren't all that threatening, but that's no reason to be reckless. \r\nJust be careful not to get surrounded. Focus on taking them down one by one! \r\n",
        "Worlds": [
          "Olympus",
          "Arendelle",
          "Monstropolis",
          "San Fransokyo"
        ],
        "Characters": [
          "Soldier(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spear Lizard",
        "Description": "Walking on land isn't their forte, so don't be surprised if they flounder about in the wrong direction. Those spears they carry find their targets well enough, though. \r\nBe on the lookout for Water magic, and if they start blowing bubbles your way, move! A direct hit will cause a sneezing fit. \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Spear Lizard(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Tireblade",
        "Description": "One monster, two modes, all trouble. \r\nIn their aerial form, they'll flit about on blade-wings, slashing at you whenever they get the chance. \r\nIn their ground form, they'll lob rockets your way. Watch the target on the ground: when it turns red, that's your cue to bail! \r\n",
        "Worlds": [
          "San Fransokyo"
        ],
        "Characters": [
          "Tireblade(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Toy Trooper",
        "Description": "Those jet packs and ray guns may be toys, but these \"masked intruders\" are anything but fun and games when they come barreling your way. \r\nThey'll sometimes chuck grenades your way, but that's not necessarily bad news. After letting it fly, they'll hit the deck. Kick 'em while they're down! Or, if you're feeling fancy, a well-timed Keyblade swing will return those grenades to sender. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Toy Trooper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Vaporfly",
        "Description": "These flying fiends will dart at you with guns blazing, but they can only attack head-on. Turns out, shooting too straight is a weakness! \r\nThey may be easy to dodge, but they're not easy to hit. Don't hold back with that magic! \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Vaporfly(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Vermilion Samba",
        "Description": "These fiery fliers come to a midair halt and conjure up a sigil before they launch flaming badness at you. Use that opportunity to strike! \r\nWhen they do start dishing out the rapid-fire spells, keep a cool head and dodge out of the way. \r\nNothing rains on their parade quite like a cool sip of Water magic. If you've got the MP to spare, go ahead and make a splash! \r\n",
        "Worlds": [
          "Twilight Town",
          "Toy Box",
          "Monstropolis",
          "San Fransokyo"
        ],
        "Characters": [
          "Vermilion Samba(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Vitality Popcat",
        "Description": "Smash these green Popcats to get at the bounty of HP prizes inside. Refreshing! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Vitality Popcat(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Water Core",
        "Description": "Hit these sopping scoundrels while they're coated in water and they'll only teleport away. That's your cue to bring the magical heat; a Fire spell will evaporate that shield in no time. \r\nDon't get caught out in their rain, or you'll come down with the extremely annoying cloud status. \r\n",
        "Worlds": [
          "Olympus",
          "Monstropolis",
          "San Fransokyo",
          "The Caribbean"
        ],
        "Characters": [
          "Water Core(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Winterhorn",
        "Description": "A buck that chucks ice as it leaps and bounds. \r\nFire magic will blast those frosty antlers clean off, making the fight a lot easier. Just don't go slinging Blizzard spells at it, or that rack will come back! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Winterhorn(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Berserker",
        "Description": "Is the Nobody swinging the hammer, or the hammer swinging the Nobody? Reading its attacks can be tricky, but each blow hits like a truck, so steer clear of that hammer unless you're interested in air travel. \r\nOh, and if you see its body shrink and its hammer grow, a combo's coming your way. Think fast! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Berserker(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Dusk",
        "Description": "Phantasmagorical frights that morph and stretch as they fight. Stay locked on, and all the fancy footwork in the world won't save them. \r\nAs tough as they are to predict, there are moments when they just sort of…stand there. And when they space? Keyblade to the face. \r\n",
        "Worlds": [
          "Twilight Town",
          "Kingdom of Corona",
          "Arendelle",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Dusk(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gambler",
        "Description": "It's all fun and games until somebody gets mauled by a giant playing card. Can you imagine the paper cuts from those things?! When a hand of them start circling you, watch for a flash; that's your cue to dodge. \r\nNot interested in playing dice? Try playing baseball. Batter up! \r\n",
        "Worlds": [
          "The Caribbean"
        ],
        "Characters": [
          "Gambler(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Ninja",
        "Description": "Lightning-quick martial arts? Razor-sharp kunai? Phantom clones? Oh, yeah. That's a ninja. \r\nThose clones do look mighty convincing, but a fake's a fake. Stay cool, watch closely, and spot the real deal—then give 'em the chop! \r\n",
        "Worlds": [
          "Arendelle"
        ],
        "Characters": [
          "Ninja(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Parasol Beauty",
        "Description": "The prettiest roses have the cruelest thorns—or, in this case, laser parasols and spinning skirts of doom. At distance or up close, they're not a threat to be taken lightly. \r\nWatch for the flash after they've opened their parasols; that's a sure sign you're about to eat beam. The good news is that blasting that laser takes these lades temporarily out of commission. Use that time to make it a permanent retirement! \r\n",
        "Worlds": [
          "Kingdom of Corona",
          "Arendelle"
        ],
        "Characters": [
          "Parasol Beauty(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Reaper",
        "Description": "That scythe isn't your only worry; these floral fiends have a punishing petal attack as well. And a trio of Reapers can team up to bloom-bomb a much broader area. \r\nTheir flower bud form may be immune to normal attacks, but as a rule, plants don't fare well against magical flames. \r\n",
        "Worlds": [
          "Kingdom of Corona",
          "The Keyblade Graveyard"
        ],
        "Characters": [
          "Reaper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sniper",
        "Description": "Gravity's got nothing on these slippery sharpshooters, and as soon as you close the distance they'll warp right outta there. The good news? Blocking will send the arrows they fire straight back at them. \r\nIn bigger brawls, you'll want to make them a priority. A little magic goes a long way toward pinning them down until you can land some hits. \r\n",
        "Worlds": [
          "Twilight Town"
        ],
        "Characters": [
          "Sniper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Sorcerer",
        "Description": "Magic and elemental attacks won't work well against these confounding casters. Know what will? Keyblade to the face. \r\nWatch out when the cubes they've conjured change color; that means pain is incoming. But then, when are ethereal objects glowing red a good sign? \r\n",
        "Worlds": [
          "Twilight Town"
        ],
        "Characters": [
          "Sorcerer(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flood",
        "Description": "The Unversed equivalent of a Shadow. Agile, but otherwise unimpressive. \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Flood(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Flowersnake",
        "Description": "These pests cling to poles and pipes, where they pump out poison that sticks around for a while. Watch your step! \r\nOne blast of the supersonic scream they emit while crawling along the floor and you'll be stunned. Bring the hurt before it can bring the noise. \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Flowersnake(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Lump of Horror",
        "Description": "A hideous, gloopy giant that mucked about in Monsters, Incorporated. The fact that it listened to Randall is enough to tell you it wasn't very nice. \r\nIt shape-shifted and sprouted a dark army of arms from the ground, but in the end Sora and the gang reduced it to a lifeless pile of machinery. \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Lump of Horror(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Spiked Turtletoad",
        "Description": "When it gets puffed up, you get roughed up. Watch out for that flying press once its belly fills with air! The shell on its back is Keyblade-proof, so you'll have to find softer places to smack. \r\nIt can swallow nearby Flowersnakes, then sprout them as toxic turrets. And if it swallows you… Don't let it swallow you. \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Spiked Turtletoad(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Turtletoad",
        "Description": "Unlike their larger cousins, these little guys have soft shells that are very much not Keyblade-proof. \r\nThey can't swallow you up, either, which is always a plus. Just don't think that makes them harmless; these rotten ribbiters still pack a punch! \r\n",
        "Worlds": [
          "Monstropolis"
        ],
        "Characters": [
          "Turtletoad(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Air Droids",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nWhen these nuisances aren't blasting you with their arm cannons, they're blasting you with gale-force winds. The good news? They can't do both at the same time. When they switch on that fan, use magic to blow them away! \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Air Droids(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Angelic Amber",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nUnpredictable and erratic, her moves made her a maddening foe to face. After Sora and his team freed her from the Marionette's ill influence, she bore a melancholy expression. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Angelic Amber(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Beasts & Bugs",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nExpect these quick critters to zip out of range and let their cannons fly. That's about the only thing they can do, actually. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Beasts & Bugs(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Bouncy Pets",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nThese bouncy baddies rarely sit still for long. Use those brief pauses to take the spring out of their step! \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Bouncy Pets(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gigas: Gunner Class",
        "Description": "One of Galaxy Toys' coolest products. Unfortunately, this one's being piloted by a Toy Trooper that's keen on chaos. \r\nThis long-range model's a bit of a glass cannon, so get up in its face and smash it to bits! \r\nThe energy rounds it fires from its shoulder cannons are blazingly fast, so get out of the way as soon as it starts to takes[sic] aim. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Gigas",
          "Toy Trooper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gigas: Power Class",
        "Description": "One of Galaxy Toys' coolest products. Unfortunately, this one's being piloted by a Toy Trooper with a taste for terror. \r\nThis model boasts a sturdy hull and brutal close-quarter attacks. Keep your distance, and avoid that shoulder tackle at all costs! \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Gigas",
          "Toy Trooper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Gigas: Speed Class",
        "Description": "One of Galaxy Toys' coolest products. Unfortunately, this one's being piloted by a Toy Trooper with a penchant for peril. \r\nThis model's speed and agility are its greatest weapons. \r\nWell, that and the mega-cluster of explosives it fires from its shoulder cannons. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Gigas",
          "Toy Trooper(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Patchwork Animals",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nThese simple-minded plushies only know one trick: chaaarge! Use magic to trip them up, then give them some new stitches. \r\n",
        "Worlds": [
          "Toy Box"
        ],
        "Characters": [
          "Patchwork Animals(s)"
        ],
        "AdditionalInformation": ""
      },
      {
        "Title": "Supreme Smasher",
        "Description": "An unlucky denizen of Galaxy Toys that was possessed by a Marionette. \r\nThis massive menace gave Sora and his friends a run for their money, but in the end no deadly claws or terrible tower turrets were a match for the mighty Rex. \r\nYes, that Rex. \r\n",
        "Worlds": [],
        "Characters": [],
        "AdditionalInformation": ""
      }
    ]
  }
}