{
  "Enemies": {
    "Kingdom Hearts": [
      {
        "Title": "Air Pirate",
        "Description": "Winged Heartless that mostly appear in Neverland. They are extremely combative and are hardly ever caught off guard. They attack with martial-arts-like techniques.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Air Pirate(s)" ]
      },
      {
        "Title": "Air Soldier",
        "Description": "Winged Heartless. They fly over their enemies and dive to strike them. Their high endurance and quickness make them tough to beat.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Air Soldier(s)" ]
      },
      {
        "Title": "Angel Star",
        "Description": "Flying Heartless that cast potent spells. They are born of holy spells. They attack from long range with magic. They block physical attacks with their wings, making them difficult to defeat.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Angel Star(s)" ]
      },
      {
        "Title": "Aquatank",
        "Description": "Heartless resembling a fish that calmly swim the seas. They are often carrying Screwdivers. Leisurely large creatures that do not attack unless provoked.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Aquatank(s)", "Screwdiver(s)" ]
      },
      {
        "Title": "Arch Behemoth",
        "Description": "A Behemoth subspecies. Although similar in appearance to the Behemoth, it lacks their aptitude. However, it shares their strengths and weaknesses.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Arch Behemoth(s)", "Behemoth(s)" ]
      },
      {
        "Title": "Bandit",
        "Description": "Heartless that mostly appear in Agrabah. They can travel under the sand. They attack deftly with a long sword. Attack them with caution.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Bandit(s)" ]
      },
      {
        "Title": "Barrel Spider",
        "Description": "Gunpowder barrel turned Heartless. They charge into their enemies and explode. Any physical impact or fire will set them off.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Barrel Spider(s)" ]
      },
      {
        "Title": "Battleship",
        "Description": "Heartless that fused together with a pirate ship. They attack with homing and magic projectiles. Attack them at close range.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Battleship(s)" ]
      },
      {
        "Title": "Behemoth",
        "Description": "Immensely powerful Heartless. With their large frame, they trample enemies, and repel most attacks. Damaging their weak point makes them lose consciousness. Strike them with potent attacks while they are down.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Behemoth(s)" ]
      },
      {
        "Title": "Black Ballade",
        "Description": "A Heartless that confuses its enemy by creating projections of itself. If the copies are attacked, it will resort to counterattacks and eventually run away. However, if it is attacked directly and relentlessly...",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Black Ballade(s)" ]
      },
      {
        "Title": "Black Fungus",
        "Description": "Hostile Heartless, unlike White Mushrooms. They attack with poison. Defeating them may bring good things, but it is not easy.",
        "Worlds": [ ":None:" ],
        "Characters": [ "Black Fungus(i)" ]
      },
      {
        "Title": "Blue Rhapsody",
        "Description": "Spellcasting Heartless. They approach their enemies by bouncing about and attack with Blizzard and absorb blizzard attacks.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Blue Rhapsody(ies)" ]
      },
      {
        "Title": "Bouncywild",
        "Description": "Heartless resembling a monkey. Unlike Powerwilds, they attack from long range with a sling shot. They scamper about during battle, making them difficult to hit.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Bouncywild(s)" ]
      },
      {
        "Title": "Chimera",
        "Description": "A Heartless wandering the streets of Halloween Town. Generally a slow-paced creature, it attacks quickly and relentlessly when angered. Armed with various abilities such as summoning Gargoyles, one must use this creature's own tricks against it.",
        "Worlds": [ "Halloween Town" ],
        "Characters": [ "Chimera(s)", "Gargoyle(s)" ]
      },
      {
        "Title": "Darkball",
        "Description": "Heartless born purely out of darkness. Their movements are unpredictable, as they often make sudden moves and attacks.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Darkball(s)" ]
      },
      {
        "Title": "Darkside",
        "Description": "Enormous Heartless that appeared in Destiny Islands with Shadows. It led the Shadows in the battle against Sora when he first received the Keyblade. Although Sora defeated it, the island was swallowed by the darkness.",
        "Worlds": [ "Destiny Islands" ],
        "Characters": [ "Darkside(s)", "Shadow(s)", "Sora" ]
      },
      {
        "Title": "Defender",
        "Description": "Heartless that mostly appear in Hollow Bastion. They carry an eerie shield with a face that casts Fire and Blizzard and bites nearby enemies.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Defender(s)" ]
      },
      {
        "Title": "Destroyed Behemoth",
        "Description": "A greater Behemoth subspecies. It has extraordinary strength, unparalleled to that of the Behemoth. However, despite its appearance and size, it shares the same weaknesses as the standard archetype.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Destroyed Behemoth(s)", "Behemoth(s)" ]
      },
      {
        "Title": "Fat Bandit",
        "Description": "Heartless that mostly appear in Agrabah. They are well-balanced offensively and defensively. Besides strong physical attack, they use fire, and they block attacks against them. Their movement is their weakness.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Fat Bandit(s)" ]
      },
      {
        "Title": "Gargoyle",
        "Description": "Winged Heartless that mostly appears in Halloween Town. They can move from one place to another almost without notice. Since they are prone to sneak attack, they often get caught off guard by counter attacks.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Gargoyle(s)" ]
      },
      {
        "Title": "Gigas Shadow",
        "Description": "A large Heartless similar to a Shadow. Like its predecessor, it's quite persistent and will chase its target around. If it just does the littlest amount of damage to Sora, it will fade out of sheer happiness.",
        "Worlds": [ "Wonderland" ],
        "Characters": [ "Gigas Shadow(s)", "Shadow(s)", "Sora" ]
      },
      {
        "Title": "Grand Ghost",
        "Description": "A Heartless similar to the Search Ghost, often spotted within Monstro. Weapon attacks do no damage, only causing items to drop. Approach the phantom and use said items for a startling discovery.",
        "Worlds": [ "Monstro" ],
        "Characters": [ "Grand Ghost(s)", "Search Ghost(s)" ]
      },
      {
        "Title": "Green Requiem",
        "Description": "Spellcasting Heartless. They heal themselves and other Heartless with Cure. They are slow-moving, but hover high in the air and absorb most magic attacks.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Green Requiem(s)" ]
      },
      {
        "Title": "Guard Armor",
        "Description": "Leader of the Heartless in Traverse Town. It falls apart when it receives damage, but each part attacks individually. Sora meets Donald and Goofy for the first time just before fighting this Heartless.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Guard Armor", "Sora", "Donald", "Goofy" ]
      },
      {
        "Title": "Invisible",
        "Description": "Heartless wielding a large sword. These winged Heartless can move freely through the air. Besides their sword, they attack with their tail and wings. With their high attack power, they often defeat their foes quickly.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Invisible(s)" ]
      },
      {
        "Title": "Jet Balloon",
        "Description": "A Heartless similar to the Aquatank. It flies through the air with tremendous speed. Chasing it will lead to a perilous aerial battle as it unloads its Missile Drivers attack, an attack similar to the Screwdivers. Its heinous nature attracts them to prey who carry lots of munny.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Jet Balloon(s)", "Aquatank(s)", "Missle Driver(s)", "Screwdiver(s)" ]
      },
      {
        "Title": "Kurt Zisa",
        "Description": "Heartless who emerged from the Keyhole opened by the princesses. He swung his six powerful arms to attack Sora and company and block their attacks. But Sora sought out his weakness and emerged the victor.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Kurt Zisa", "Sora" ]
      },
      {
        "Title": "Large Body",
        "Description": "Big round Heartless. They seem tame and laid-back, but go berserk when they are angered. With their brute strength, they can inflict great damage, so be on your guard.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Large Body(ies)" ]
      },
      {
        "Title": "Neoshadow",
        "Description": "A Heartless that travels in packs. Combining their powers allows them to attack Sora while also healing themselves. Leaving even just one alive will result in a never-ending battle.",
        "Worlds": [ "End of the World" ],
        "Characters": [ "Neoshadow(s)", "Sora" ]
      },
      {
        "Title": "Opposite Armor",
        "Description": "Heartless that guards the keyhole in Traverse Town. It is a modified form of Guard Armor, but is more powerful.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Opposite Armor", "Guard Armor" ]
      },
      {
        "Title": "Parasite Cage",
        "Description": "Heartless that appeared inside Monstro. It's known to swallow its enemies. Sora and the others rescue Pinocchio, who was trapped inside it.",
        "Worlds": [ "Monstro" ],
        "Characters": [ "Parasite Cage", "Sora", "Pinocchio" ]
      },
      {
        "Title": "Phantom",
        "Description": "Ghostlike Heartless who haunted the clock tower standing far away from Neverland. Fluttering his eerie cloak, he cast a spell to take Sora's heart. Having no physical body, regular attacks were useless, but in the end Sora and company discovered his weakness and prevailed.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Phantom", "Sora" ]
      },
      {
        "Title": "Pink Agaricus",
        "Description": "A colossal Heartless called forth by euphoric White Mushrooms. A dancer by nature, once it starts dancing, it can't stop.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Pink Agaricus(i)" ]
      },
      {
        "Title": "Pirate",
        "Description": "Heartless that mostly appear in Neverland. They are quite combative with their swords. They often just focus on the enemies in front, making them vulnerable to attacks from behind.",
        "Worlds": [ "Neverland" ],
        "Characters": [ "Pirate(s)" ]
      },
      {
        "Title": "Pot Centipede",
        "Description": "Heartless called by Jafar to stop Aladdin. Its long body is composed of a number of Pot Spiders linked together. Even if its body comes apart, it can regenerate itself by gathering other pots.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Centipede", "Jafar", "Aladdin", "Pot Spider(s)" ]
      },
      {
        "Title": "Pot Scorpion",
        "Description": "An ordinary pot turned Heartless by the power of darkness. Unlike the Pot Spider, its pot is tough as nails. A simple attack won't be enough to make it cry for mercy. It emanates poisonous fumes as it attacks its prey.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Scorpion(s)", "Pot Spider(s)" ]
      },
      {
        "Title": "Pot Spider",
        "Description": "Ordinary pots turned Heartless. They lie in wait as ordinary pots, then reveal themselves and attack when their enemies draw near.",
        "Worlds": [ "Agrabah" ],
        "Characters": [ "Pot Spider(s)" ]
      },
      {
        "Title": "Powerwild",
        "Description": "Heartless resembling a monkey. With great physical strength and agility, they often strike with combination attacks. Avoid close-range battles with them if possible.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Powerwild(s)" ]
      },
      {
        "Title": "Rare Truffle",
        "Description": "Non-attacking Heartless that are rarely found. They like to jump, so helping them stay in the air may bring good things.",
        "Worlds": [ ":None:" ],
        "Characters": [ "Rare Truffle(s)" ]
      },
      {
        "Title": "Red Armor",
        "Description": "A giant Heartless similar to the Guard Armor. It splits into the Armored Torso, Gauntlets, and Hammer Legs, each with the ability of individual movement. Each body part can be found heading a team in a Coliseum tournament.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Red Armor", "Guard Armor" ]
      },
      {
        "Title": "Red Nocturne",
        "Description": "Spellcasting Heartless. While hovering about, they attack by casting Fire. Having low HP, they keep their distance from their opponents, making them difficult to attack. They absorb fire attacks.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Red Nocturne(s)" ]
      },
      {
        "Title": "Screwdiver",
        "Description": "Heartless that acts with Aquatank. Unpredictable creatures, dashing forward one minute, cowardly retreating the next. They are invigorated by the sparks from Aquatank.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Screwdiver(s)", "Aquatank(s)" ]
      },
      {
        "Title": "Sea Neon",
        "Description": "Heartless resembling jellyfish. They swim fast, and attack in numbers. Overall, they are not tough opponents.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Sea Neon(s)" ]
      },
      {
        "Title": "Search Ghost",
        "Description": "Heartless that mostly appear in Atlantica. They roam in dark areas and emit light from their eye to target their enemies. They can warp from one place to another.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Search Ghost(s)" ]
      },
      {
        "Title": "Shadow",
        "Description": "Heartless that emerge from various places. They sneak up to their enemies and strike them with sharp claws. They are extremely tenacious, often chasing their prey to the end.",
        "Worlds": [ "Destiny Islands" ],
        "Characters": [ "Shadow(s)" ]
      },
      {
        "Title": "Sheltering Zone",
        "Description": "Heartless resembling a jellyfish. You receive damage just from colliding with it. They move slow, but break up into many Sea Neons if struck. They fling their tentacles away to keep their enemies away.",
        "Worlds": [ "Atlantica" ],
        "Characters": [ "Sheltering Zone(s)" ]
      },
      {
        "Title": "Sneak Army",
        "Description": "A Heartless similar to but more powerful than the Stealth Sneak. They stay hidden and attack while nimbly darting around. Though even one is hard to handle, a pair can be found participating in the Coliseum tournament.",
        "Worlds": [ "Olympus Coliseum" ],
        "Characters": [ "Sneak Army(ies)", "Stealth Sneak(s)" ]
      },
      {
        "Title": "Sniperwild",
        "Description": "A Heartless resembling a monkey. It roams as it pleases, rarely paying attention to its surroundings. If Sora is spotted, it will call forth numerous allies, all armed with slingshots.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Sniperwild(s)" ]
      },
      {
        "Title": "Soldier",
        "Description": "Heartless that emerge from various places. They are brisk in their movements, and rush into their opponents. However, they are not that tenacious. They often appear in numbers, though they lack teamwork.",
        "Worlds": [ "Traverse Town" ],
        "Characters": [ "Soldier(s)" ]
      },
      {
        "Title": "Stealth Sneak",
        "Description": "Heartless that attuned to the darkness in Clayton's heart. It somehow manipulated the light to turn invisible and fought alongside Clayton.",
        "Worlds": [ "Deep Jungle" ],
        "Characters": [ "Stealth Sneak(s)", "Clayton" ]
      },
      {
        "Title": "Stealth Soldier",
        "Description": "A stealthy Heartless similar in appearance to a Soldier. It appears alongside other Heartless and deals attacks from afar. Although a troublesome enemy, it shows itself once its weakness is uncovered.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Stealth Soldier(s)", "Soldier(s)" ]
      },
      {
        "Title": "Trickmaster",
        "Description": "Heartless that Sora and company encounter while they searched for Alice. His herky-jerky attacks and juggling act flustered Sora and the others.",
        "Worlds": [ "Wonderland" ],
        "Characters": [ "Trickmaster", "Sora", "Alice" ]
      },
      {
        "Title": "White Mushroom",
        "Description": "Non-attacking, friendly Heartless. They might give you an item if you help them.",
        "Worlds": [ ":None:" ],
        "Characters": [ "White Mushroom(s)" ]
      },
      {
        "Title": "Wight Knight",
        "Description": "Heartless that mostly appear in Halloween Town. Their jerky, dancelike attack moves are fairly easy to dodge, but cause large damage.",
        "Worlds": [ "Halloween Town" ],
        "Characters": [ "Wight Knight(s)" ]
      },
      {
        "Title": "Wizard",
        "Description": "Heartless that attack with various powerful spells. Eludes enemy attacks by teleporting, making them tough to beat.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Wizard(s)" ]
      },
      {
        "Title": "Wyvern",
        "Description": "Giant Heartless that attack from the air. They are quite swift for their size and are hard to attack, especially while they are high in the air. Counterattacking when they come down would be most effective.",
        "Worlds": [ "Hollow Bastion" ],
        "Characters": [ "Wyvern(s)" ]
      }
    ],
    "Kingdom Hearts Re:Chain of Memories": [
      {
        "Title": "Aerith",
        "CharacterName": "Aerith",
        "Description": "A young woman who fought the Heartless. Her calm demeanor hides an unbreakable will. Aerith also has a mysterious sense of truth, and is aware that Traverse Town and its inhabitants are a figment of Sora's memory.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Aladdin",
        "CharacterName": "Aladdin",
        "Description": "A young man who lives in Agrabah and dreams of meeting Princess Jasmine. Aladdin became Genie's master when he found the magic lamp. At first Aladdin wanted to become a prince and impress Jasmine, but in the end he gave Genie his freedom and decided to show Jasmine his true self.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Alice",
        "CharacterName": "Alice",
        "Description": "A curious girl who fell down the rabbit hole into Wonderland. Alice was falsely accused of stealing the Queen of Hearts' memory and put on trial, but we intervened and helped her clear her name.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "Pursuer of darkness. To open the door to darkness, Ansem used the Heartless to steal countless hearts. He enslaved Riku, but met his demise at Sora's hand. Nonetheless, Ansem's shadow lives on in the depths of Riku's heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ariel",
        "CharacterName": "Ariel",
        "Description": "The daughter of King Triton who longs to see the outside world. Worried by Flounder's disappearance, Ariel was cajoled by Ursula into forking over the king's trident. We helped Ariel save Flounder and recover the trident, and she resolved to tell her father the truth.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Axel (SS)",
        "CharacterName": "Axel",
        "Description": "A mysterious figure who stands in Sora's path. Hard to read, half the time Axel seems to just be messing around... but for all we know, he's done more thinking than everyone else put together. He knows a lot more than he lets on.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Axel (RR)",
        "CharacterName": "Axel",
        "Description": "No. 8 in the Organization. He is a Nobody whose intentions and secrets are hidden from all. Axel has no qualms about exploiting others to suit his needs. He used Sora and Naminé to silence Marluxia and halt his plot against the Organization. Axel claims he and Sora have something in common, but that connection is unclear.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Bambi",
        "CharacterName": "Bambi",
        "Description": "A young deer prince whose father is king of the Forest. Sora can call on Bambi for help anytime.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Beast",
        "CharacterName": "Beast",
        "Description": "A prince transformed into a beast because of his selfishness. Meeting Belle restored humanity to his heart. Though stunned by Belle's cold behavior, his faith in their love never wavered.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Belle",
        "CharacterName": "Belle",
        "Description": "A young woman who saw kindness behind the Beast's gruff exterior. Realizing Maleficent sought her heart, Belle acted coldly toward the Beast to keep her heart beyond the witch's reach.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hook (SS)",
        "CharacterName": "Captain Hook",
        "Description": "A pirate who holds a grudge against Peter Pan. Hook kidnapped Wendy to lure Peter out. Normally proud, Hook falls to pieces the moment the crocodile that took his hand shows up.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hook (RR)",
        "CharacterName": "Captain Hook",
        "Description": "A pirate of Neverland. Hook appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Card of Hearts",
        "CharacterName": "Card Soldier(s)",
        "Description": "Guards in the service of the Queen of Hearts. They fear her temper and will do anything she orders.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Card of Spades",
        "CharacterName": "Card Soldier(s)",
        "Description": "Guards in the service of the Queen of Hearts. They fear her temper and will do anything she orders.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Cheshire Cat",
        "CharacterName": "Cheshire Cat",
        "Description": "A mysterious, grinning cat who always talks in riddles. He appears when you least expect it, and disappears whenever he pleases.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cid",
        "CharacterName": "Cid",
        "Description": "A gifted pilot who saved Leon and the others from the Heartless when they were just children. Cid lives in Traverse Town now.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cloud",
        "CharacterName": "Cloud",
        "Description": "A swordsman hired by Hades to take out Hercules. Cloud seeks the true memories he has lost. Were they memories of someone dear to him, or memories of his hazy past?",
        "AdditionalInformation": ""
      },
      {
        "Title": "DiZ",
        "CharacterName": "DiZ",
        "Description": "Truly an enigma. DiZ appeared before Riku in the guise of Ansem, presenting him with choices regarding the darkness within his heart. It is said he and the king have met.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald",
        "Description": "Court Wizard at Disney Castle who set out with Goofy after the king's disappearance with orders to find the Keyblade Master. His short temper sometimes gets him into trouble, but he is very brave and caring of his loved ones. He would put his life on the line if it meant helping a friend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dragon Maleficent",
        "CharacterName": "Dragon Maleficent",
        "Description": "Maleficent's dragon form. Her own sorcery mingled with the vast powers of darkness made Maleficent a fearful opponent.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dr. Finkelstein",
        "CharacterName": "Dr. Finkelstein",
        "Description": "The mad scientist of Halloween Town. He's always immersed in his odd experiments. This time Dr. Finkelstein came up with a potion to restore true memories, only to have it guzzled by Oogie Boogie.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dumbo",
        "CharacterName": "Dumbo",
        "Description": "A small elephant born in a circus. The other animals laughed at his big ears, but the courage to fly made Dumbo the star of the circus. If Sora calls, Dumbo will come to the rescue.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Eeyore",
        "CharacterName": "Eeyore",
        "Description": "A gloomy donkey whose tail keeps falling off and getting lost. Eeyore is timid and always a little down, and likes to take things slow.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Flounder",
        "CharacterName": "Flounder",
        "Description": "A young fish. He's not exactly brave, but Flounder is Ariel's most loyal friend. Ursula kidnapped Flounder as part of her plan to trick Ariel and steal the trident.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Genie",
        "CharacterName": "Genie",
        "Description": "Captive of the magic lamp. Genie must grant the lamp's holder three wishes He longs for freedom, but can only get it if someone uses a wish to set him free.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Geppetto",
        "CharacterName": "Geppetto",
        "Description": "A gentle and earnest clockmaker who carved Pinocchio from a block of wood. Geppetto was swallowed by Monstro, boat and all, while searching for Pinocchio. The two were reunited inside the giant whale, and escaped with our help.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "Captain of the Disney Castle Royal Knights. He set out with Donald after the king's disappearance. He is cheerful and calm, and no one is more loyal to the king. Goofy and Sora are especially good friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades (SS)",
        "CharacterName": "Hades",
        "Description": "Ruler of the Underworld. Hades can't stand Hercules. He tricked Cloud into challenging Hercules to the death, but we put an end to his plotting.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades (RR)",
        "CharacterName": "Hades",
        "Description": "God of the Underworld who seeks to rule over all. Hades appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "Son of the god Zeus and Hera, but not a god himself. With godlike strength and a gentle heart, Hercules is a true hero. He has never lost at the Coliseum games.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Iago",
        "CharacterName": "Iago",
        "Description": "A cunning and chatty parrot. Iago flies about Agrabah, serving as the evil Jafar's eyes and ears.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jack Skellington",
        "CharacterName": "Jack Skellington",
        "Description": "Halloween Town's master of the macabre. Jack is always looking for new ways to bring the spooks and shivers of Halloween to all.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar",
        "CharacterName": "Jafar",
        "Description": "A sorcerer and Agrabah's royal vizier. Jafar stole the magic lamp from Aladdin and, with Genie's power, schemed to become ruler of Agrabah.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar-Genie (SS)",
        "CharacterName": "Genie Jafar",
        "Description": "Jafar's genie form. After taking the magic lamp from Aladdin, Jafar wished for the powers of a genie and tried to do us in.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar-Genie (RR)",
        "CharacterName": "Genie Jafar",
        "Description": "A sorcerer and also Agrabah's royal vizier, transformed by magic. Jafar appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jasmine",
        "CharacterName": "Jasmine",
        "Description": "Princess of Agrabah. Jasmine feels cooped up in the palace and longs for the freedom outside its walls.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "That's right, me again. I'm keeping a journal of everyone's adventures. I also act as Pinocchio's conscience, so he'll know right from wrong.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi (SS)",
        "CharacterName": "Kairi",
        "Description": "Sora's childhood friend. Sora's journey began as a search for Kairi, who disappeared when their island home was swallowed by darkness. Kairi was held captive by the Heartless, but thanks to Sora she and the islands were saved. She waits there for Sora and Riku's return.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi (RR)",
        "CharacterName": "Kairi",
        "Description": "Riku and Sora's friend growing up. Kairi vanished when their home islands were devoured by darkness. Riku and Sora both journeyed to find her. Kairi was held captive by the Heartless, but thanks to Sora, she and the islands were saved. She waits there for Sora and Riku's return.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The King",
        "CharacterName": "Mickey",
        "Description": "The king who reigns over Disney Castle. He set off alone to protect his world and all worlds from the dominion of the dark. When Riku fell into the realm of darkness, the king showed him the way, but the two were separated when the door to darkness was closed.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Larxene (SS)",
        "CharacterName": "Larxene",
        "Description": "A member of the group that controls Castle Oblivion. Larxene is unfeeling and loves nothing more than to bring other people down. She is on good terms with Axel but still mocks everyone and trusts no one.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Larxene (RR)",
        "CharacterName": "Larxene",
        "Description": "No. 12 in the Organization. Larxene conspired with Marluxia to take over the group, and intended to pull Axel in as well. However, her abrasive, unfeeling personality proved her downfall—provoking Sora's anger was a fatal error.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Leon",
        "CharacterName": "Leon",
        "Description": "A cool and collected swordsman who wields a gunblade. His real name: Squall Leonhart. Leon once fought with Sora against the Heartless, but the Leon we met in Castle Oblivion is a product of Sora's memory, so he can't remember much of what happened before.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lexaeus",
        "CharacterName": "Lexaeus",
        "Description": "No. 5 in the Organization. A born warrior, Lexaeus effortlessly brandishes a gigantic tomahawk. To counterbalance his rival Marluxia's bid for Sora's power, Lexaeus tried to conquer Riku, but was defeated by Riku's dark powers.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent (SS)",
        "CharacterName": "Maleficent",
        "Description": "A witch who commands the darkness. Sora faced Maleficent and her Heartless once before. She stole Belle's heart to perfect her dark powers, though Belle had seen through her plan.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent (RR)",
        "CharacterName": "Maleficent",
        "Description": "A witch who commands the darkness. Maleficent's charms won over Riku, and she empowered him with darkness. In Castle Oblivion she stood before Riku again, this time as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Marluxia (SS)",
        "CharacterName": "Marluxia",
        "Description": "Lord of Castle Oblivion and a member of the Organization. In a move to bring the group under his control, Marluxia used Naminé to overrun Sora's memory and tried to claim the power of the Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Marluxia (RR)",
        "CharacterName": "Marluxia",
        "Description": "No. 11 in the Organization. Marluxia lured Sora to Castle Oblivion in hopes of using his power to seize the Organization. He ordered Naminé to alter Sora's memories, and fooled Vexen into challenging him. All was going according to plan, but Marluxia's scheme dissolved when Axel set Naminé free. Marluxia was ultimately destroyed by Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Moogles",
        "CharacterName": "Moogle(s)",
        "Description": "A strange race that seems to pop up just about anywhere. In Castle Oblivion, the moogles run shops where Sora can trade in unwanted cards.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Mushu",
        "CharacterName": "Mushu",
        "Description": "Once a guardian dragon of a Chinese family. Due to past mistakes, he lost much of his former power. If Sora calls, Mushu will come to our aid.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé (SS)",
        "CharacterName": "Naminé",
        "Description": "A young witch who, under orders from Marluxia, rewrote much of Sora's memory. Because Naminé based the false memories on Sora's feelings toward Kairi, Sora believed he and Naminé had been friends since childhood. But truth be told, the two had never met before Castle Oblivion.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé (RR)",
        "CharacterName": "Naminé",
        "Description": "A young witch who can manipulate memories. Under orders from the Organization, Naminé shadowed Kairi and altered Sora's memory. But the forgiveness in Sora's heart moved her to disobey those orders. Now she watches over Sora until the reconstruction of his memories is complete.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Oogie Boogie (SS)",
        "CharacterName": "Oogie Boogie",
        "Description": "A villain who's always plotting against Jack. Oogie Boogie stole Dr. Finkelstein's potion thinking it would make him stronger, but it drove him mad with fear instead.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Oogie Boogie (RR)",
        "CharacterName": "Oogie Boogie",
        "Description": "A villain who's always causing trouble in Halloween Town. Oogie Boogie appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Peter Pan",
        "CharacterName": "Peter Pan",
        "Description": "A boy who lives in Neverland, where no one grows up. Peter can be stubborn, but deep down he's brave and just. He was upset that Wendy wanted to return to London, but in the end he wished her well.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "Trainer of countless heroes, including Hercules. Nowadays Phil runs the Coliseum and manages the games.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Piglet",
        "CharacterName": "Piglet",
        "Description": "Pooh's closest friend. Piglet is very shy, and when he's surprised he covers his eyes with his floppy ears.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pinocchio",
        "CharacterName": "Pinocchio",
        "Description": "A wooden puppet Geppetto made, brought to life by the Blue Fairy. To become a real boy, Pinocchio has to learn bravery, kindness, and honesty. He and Geppetto were swallowed by Monstro, but they escaped with a little help from us.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "The king's faithful dog. The strength of their bond goes beyond master and pet. He had left Disney Castle with Donald and Goofy, but is now on his own. His keen sense of smell might lead us to secrets yet uncovered.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Queen of Hearts",
        "CharacterName": "Queen of Hearts",
        "Description": "A selfish ruler who commands an army of card soldiers. A Heartless stole the Queen's memory, but she accused Alice and put her on trial.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "A diligent gardener who's always busy with his vegetables. Sometimes Rabbit is a bit short-tempered, especially when Tigger bounces around in his garden.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku (SS)",
        "CharacterName": "Riku",
        "Description": "Sora's childhood friend. Baited by the darkness and used by Maleficent and Ansem, Riku once fought against Sora. In order to seal the door to darkness, Riku stayed with the king on the other side. His current whereabouts are unknown. Sora journeys in the hopes of finding Riku.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku (RR)",
        "CharacterName": "Riku",
        "Description": "A boy who was born and raised on a small group of islands. Riku dreamt of seeing other worlds, and so he forsook the islands—only to be seduced by the power of darkness. Enslaved by Ansem, pursuer of darkness, Riku clashed with his childhood friend Sora. But in the end, he was able to regain himself, and together with Sora closed the door to darkness. Still, the dark wounds in Riku's heart have yet to mend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku Replica (SS)",
        "CharacterName": "Riku Replica",
        "Description": "A replica of Riku created by Vexen from the real Riku's data. Through Naminé's power he was infused with false memories and made to believe he was the real Riku. The truth has wounded him deeply.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku Replica (RR)",
        "CharacterName": "Riku Replica",
        "Description": "A replica of Riku created by Vexen from the real Riku's data. Unlike the real Riku, he wields darkness freely, but is burdened by the fact that he is an imitation.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Roo",
        "CharacterName": "Roo",
        "Description": "A feisty kangaroo who's full of energy. Little Roo wants to learn to bounce as high as Tigger.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sally",
        "CharacterName": "Sally",
        "Description": "Dr. Finkelstein's helper at the lab. He created her from various odds and ends. Sally is secretly in love with Jack.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sebastian",
        "CharacterName": "Sebastian",
        "Description": "Triton's music director and Ariel's guardian. Sebastian is constantly scolding Ariel for her escapades, but only because he worries for her safety.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Selphie",
        "CharacterName": "Selphie",
        "Description": "A perky girl from Sora's islands. Selphie is assertive and tends to leap before she looks. She also has a romantic side.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Simba",
        "CharacterName": "Simba",
        "Description": "Successor to his father as ruler of the Pride Lands. Sora need only call and Simba will appear and lend his strength.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (SS)",
        "CharacterName": "Sora",
        "Description": "A bright and spirited boy chosen by the Keyblade to battle the Heartless. It was Sora who defeated Ansem, ending his plan to shroud the world in darkness. However, Sora continued his journey, seeking the friends he lost during the struggle.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (RR)",
        "CharacterName": "Sora",
        "Description": "Riku's childhood friend, and the hero of light chosen by the Keyblade to stand against the darkness. Riku fought Sora while bridled by darkness, but their friendship proved stronger, and they ultimately worked together to close the door to darkness.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tidus",
        "CharacterName": "Tidus",
        "Description": "A young boy from Sora's islands with a sunny personality and lots of energy. Tidus has no shortage of confidence either, and considers himself a champ at everything.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tigger",
        "CharacterName": "Tigger",
        "Description": "The one and only. Cheerful Tigger loves to bounce all day long. Sometimes his energy is too much for the others, but he always means well.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tinker Bell",
        "CharacterName": "Tinker Bell",
        "Description": "A fairy with a jealous streak, especially when Peter pays attention to other girls.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ursula (SS)",
        "CharacterName": "Ursula",
        "Description": "The sea witch. She once lived in the palace, but was banished for scheming. Ursula deceived Ariel and stole the trident in an attempt to rule all Atlantica.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ursula (RR)",
        "CharacterName": "Ursula",
        "Description": "The sea witch who plotted to rule all of the undersea kingdom Atlantica. Ursula appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vexen (SS)",
        "CharacterName": "Vexen",
        "Description": "A man absorbed in his dubious research in Castle Oblivion. Vexen tried to destroy Sora by controlling Riku and pitting the two against each other. When this plan failed, he confronted Sora personally.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vexen (RR)",
        "CharacterName": "Vexen",
        "Description": "No. 4 in the Organization. He, Lexaeus, and Zexion have been in the group since its inception, and there is no love lost between them and neophytes like Marluxia. After battling Riku, Vexen turned to events unfolding aboveground, but successive failures led to his termination by Axel.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wakka",
        "CharacterName": "Wakka",
        "Description": "A boy from Sora's islands. Despite being the oldest, Wakka is modest and takes good care of his friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wendy",
        "CharacterName": "Wendy",
        "Description": "A dreamy English girl. Peter showed her the way to Never Land. Wendy really likes Peter, but decided to return home to London.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The White Rabbit",
        "CharacterName": "White Rabbit",
        "Description": "A loyal retainer of the Queen of Hearts. He always carries out the Queen's orders, no matter what they may be.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A bear who lives in the base of a tree in the Hundred Acre Wood. Pooh loves to eat—especially honey. He's easygoing, but a little absent-minded.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yuffie",
        "CharacterName": "Yuffie",
        "Description": "A girl whose cheerful personality belies her painful memories. When she was still young the Heartless robbed her of her home. Never one to sweat the small stuff, Yuffie seems unfazed by her fuddled memory.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Zexion",
        "CharacterName": "Zexion",
        "Description": "No. 6 in the Organization. Zexion generally avoids dirtying his own hands when there are deeds to be done. However, with the destruction of Vexen and Lexaeus, he was forced into action. Disguised as Sora, Zexion confronted Riku. But Riku no longer feared the dark, and victory was beyond Zexion's reach.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts II": [
      {
        "Title": "Abu",
        "CharacterName": "Abu",
        "Description": "Aladdin's faithful and rather furry sidekick. Abu doesn't talk a lot, but he always understands what Aladdin needs. Unfortunately, Abu can't resist treasure, even if it belongs to somebody else.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Aerith",
        "CharacterName": "Aerith",
        "Description": "A young woman whose quiet eyes belie an unbreakable will. Like Leon, she met Sora while living away from her hometown, and helped him now and then on his journey. Now Aerith works with Leon and Yuffie to restore the town to its past splendor.",
        "AdditionalInformation": "Final Fantasy VII"
      },
      {
        "Title": "Aladdin",
        "CharacterName": "Aladdin",
        "Description": "A young man from the desert city of Agrabah. Not long ago, Sora and his friends helped Aladdin defeat Jafar and free Genie from the lamp. Aladdin used to worry that someone known as a \"street rat\" couldn't really earn the love of a princess. But Jasmine taught that it's what's inside a person's hearts that really counts. Aladdin's friend Abu, the monkey, is never far from his side.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Ansem",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "Mysterious wielder of darkness. What could his true purpose be?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem the Wise",
        "CharacterName": "Ansem the Wise",
        "Description": "The man who called himself \"DiZ\" and dressed his face in bandages to conceal it, now revealed to be none other than Ansem the Wise. The true Ansem once studied hearts and the Heartless, but soon ceased his research for fear of disrupting the order of the worlds. But his apprentice Xehanort betrayed him, robbing Ansem of his discoveries and pride. Since that time, Ansem was driven by vengeance - but when he saw Riku go so far as to give up his physical form to help Sora, he had a change of heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ariel I",
        "CharacterName": "Ariel",
        "Description": "The seventh daughter of Triton, king of Atlantica. Ariel has the most beautiful singing voice of all the merpeople. Ariel wants to see the world outside her ocean home. She even keeps a collection of things from the human world in a secret grotto. Sora and his friends helped her the last time Ursula tried to take over Atlantica.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Ariel II",
        "CharacterName": "Ariel",
        "Description": "The seventh daughter of Triton, king of Atlantica. She made a deal with Ursula to become a human, but lost her beautiful voice in the bargain. Ariel has three days to make Prince Eric fall in love with her. If she doesn't, she'll become a mermaid again and belong to Ursula.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Auron",
        "CharacterName": "Auron",
        "Description": "A warrior that Hades called forth from the Underworld. In exchange for his freedom, Auron was commanded to defeat Hercules. But he refused to work with Hades, saying, \"This is my story.\" He doesn't talk about himself very much. What sort of story has he written thus far?",
        "AdditionalInformation": "Final Fantasy X"
      },
      {
        "Title": "Axel",
        "CharacterName": "Axel",
        "Description": "Organization XIII's Number VIII. He commands fire and carries a uniquely-shaped weapon. He is the former mentor of Roxas. He would give anything to get him back. He has proven to be an odd duck of sorts within the Organization, lashing out against treachery, yet stirring troubles with his own betrayals all the while. He claims he and Sora share some sort of bond, but Sora can't imagine what that might be.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Banzai",
        "CharacterName": "Banzai",
        "Description": "A cowardly hyena who hates lions. Banzai likes to complain but doesn't like to work. He's always looking to find an easy meal.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Barrel",
        "CharacterName": "Barrel",
        "Description": "A member of the trio that includes Lock and Shock. He's often the object of his partners' pranks and practical jokes.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Bathtub",
        "CharacterName": "Bathtub",
        "Description": "The walking bathtub Lock, Shock, and Barrel use to get around. It's also big enough to carry any mischief-making tools they need to bring along.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Beast I",
        "CharacterName": "Beast",
        "Description": "A hideous beast with sharp teeth and claws. A mysterious rose is his most important possession, kept in a glass case. Sora and his friends helped the Beast free Belle from Maleficent's clutches once before.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "The Beast II",
        "CharacterName": "Beast",
        "Description": "A cold-hearted prince. Because of his selfish heart, he was changed into a beast by a beautiful enchantress. He was so ashamed of his hideous appearance that he turned his back on the world. Meeting Belle softened his heart and gave him hope for the future.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Beast III",
        "CharacterName": "Beast",
        "Description": "A spoiled and selfish prince. As punishment for his cold heart, a beautiful enchantress changed him into a beast. Unless he can learn to love and earn love in return before the last petal falls from the enchanted rose, he'll remain a beast forever. When Belle came into his world, he felt something change in him for the first time in his life.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Belle I",
        "CharacterName": "Belle",
        "Description": "A girl who was held captive in the Beast's castle. At first he frightened her, but little by little, she noticed the injured heart he was hiding from the world. Belle is one of the Seven Princesses needed to open the final door to the realm of darkness. She's very grateful to the Beast and to Sora for saving her after she was kidnapped by the Heartless.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Belle II",
        "CharacterName": "Belle",
        "Description": "Belle saw through the Beast's rough exterior and helped him find the heart he'd been hiding from the world for such a long time. Belle loves to read books about exciting adventures in faraway places.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Brooms",
        "CharacterName": "Enchanted Broom(s)",
        "Description": "King Mickey cast a spell on these brooms and turned them into hard workers. They clean and help maintain the Gummi Ship, and do just about any other necessary work.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Captain Barbossa",
        "CharacterName": "Barbossa",
        "Description": "Captain of the Black Pearl and leader of the undead pirates. The medallions' curse keeps Captain Barbossa and his men in a kind of limbo between life and death. Their true form is revealed in the moonlight, and it's a terrifying sight to see. These days, Captain Barbossa has joined up with Pete in a search for... something.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Captain Jack Sparrow",
        "CharacterName": "Jack Sparrow",
        "Description": "A pirate who sails the high seas. He sure is a colorful character, and one who really values his freedom. He says he's a captain, but he doesn't seem to have a crew. Jack was arrested in Port Royal and thrown in jail, but Will Turner helped him escape during a pirate attack. Jack seems to know something special about Will's name. Wonder what it could be?",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Captain Li Shang",
        "CharacterName": "Shang",
        "Description": "A talented young officer whose father is a distinguished general in the Imperial Army. Captain Shang has to train a disorganized group of recruits who've been drafted to help fight the Huns. He sure is a stickler for discipline, so he must have his hands full getting his inexperienced troops into shape.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Cerberus",
        "CharacterName": "Cerberus",
        "Description": "Guardian of the entrance to the Underworld and Hades' loyal \"pet.\" Hercules, Sora, Donald, and Goofy teamed up to defeat him last time, but Hades brought him back - and he's as dangerous as ever.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Chicken Little",
        "CharacterName": "Chicken Little",
        "Description": "Chicken Little has more pluck and heart than most boys twice his size. He never turns away from a challenge, no matter how big it is. He's a loyal pal of Sora's, and is always quick to answer a call for help.",
        "AdditionalInformation": "Chicken Little (2005)"
      },
      {
        "Title": "Chien-Po",
        "CharacterName": "Chien Po",
        "Description": "One of the men drafted to help defend China from the Hun invasion. Chien-Po sure does love a good meal. In fact, he'd probably rather dream about food than glory or adventure.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Chip",
        "CharacterName": "Chip",
        "Description": "One of the kingdom's mechanical specialists. He helps maintain the Gummi Ship, which can travel to any destination. Chip is diligent and follows through on his plans. Chip looks almost exactly like his pal Dale, but you can tell them apart by the color of their noses and the shape of their front teeth.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Chip (Potts)",
        "CharacterName": "Chip",
        "Description": "Mrs. Potts's little boy. Chip became a teacup when an enchantress put a spell on the castle. His missing front tooth became a little chip on the rim of this teacup.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Cid",
        "CharacterName": "Cid",
        "Description": "An engineer, tech wizard and first-rate pilot. He met Sora as a castaway, while he was running a shop away from his hometown.",
        "AdditionalInformation": "Final Fantasy VII"
      },
      {
        "Title": "Clarabelle Cow",
        "CharacterName": "Clarabelle Cow",
        "Description": "An old friend of King Mickey, Queen Minnie, and the other folks at Disney Castle. Clarabelle is also close friends with Horace Horsecollar. She loves any kind of gossip.",
        "AdditionalInformation": "Plane Crazy (1928)"
      },
      {
        "Title": "Clara Cluck",
        "CharacterName": "Clara Cluck",
        "Description": "A famous opera-singing hen. Clara's an old friend of King Mickey, Queen Minnie, and the other folks at Disney Castle.",
        "AdditionalInformation": "Orphan's Benefit (1934)"
      },
      {
        "Title": "Cloud",
        "CharacterName": "Cloud",
        "Description": "A \"SOLDIER\" who effortlessly wields a hefty sword. He once fought against Sora and his friends under contract with Hades. Cloud hates letting other people see what he's thinking, so he can be an enigma to other people. He searches for Sephiroth, hoping to settle things once and for all with his inner darkness.",
        "AdditionalInformation": "Final Fantasy VII"
      },
      {
        "Title": "Cogsworth",
        "CharacterName": "Cogsworth",
        "Description": "The Beast's majordomo. He became a clock when a enchantress put a spell on the castle. Cogsworth is particular about order and punctuality. Maybe that's why he turned into a clock?",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Daisy Duck",
        "CharacterName": "Daisy",
        "Description": "A lady-in-waiting to Queen Minnie at Disney Castle and Donald's girlfriend.",
        "AdditionalInformation": "Don Donald (1937)"
      },
      {
        "Title": "Dale",
        "CharacterName": "Dale",
        "Description": "One of the kingdom's mechanical specialists. He helps maintain the Gummi Ship, which can travel to any destination. Dale's pretty impulsive, but he works slow and steady to finish a job when it's important. Dale looks almost exactly like his pal Chip, but you can tell them apart by the color of their noses and the shape of their front teeth.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Demyx I",
        "CharacterName": "Demyx",
        "Description": "Organization XIII's Number IX. Organization members all wear black coats, and it's said their numbers were assigned in the order they joined. In addition, their names share something as a mark of their brotherhood.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Demyx II",
        "CharacterName": "Demyx",
        "Description": "Organization XIII's Number IX. He was surveying the world of Olympus, and even swiped the Olympus Stone. He's a lousy fighter. Demyx called Sora \"Roxas.\"",
        "AdditionalInformation": ""
      },
      {
        "Title": "Demyx III",
        "CharacterName": "Demyx",
        "Description": "Organization XIII's Number IX. He used a type of instrument called a \"sitar\" to control water... but he wasn't very good at fighting. Demyx was under orders to \"liberate Sora's true disposition\" while surveying the world of Olympus.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dewey",
        "CharacterName": "Dewey",
        "Description": "One of Donald's three nephews who's helping out with Uncle Scrooge's ice cream business. Dewey always wears a blue cap. He's smart and cheerful and likes to come up with plans to have fun. The last time we saw Dewey, he was working in Traverse Town, saving up for an expedition.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "DiZ",
        "CharacterName": "DiZ",
        "Description": "An entity shrouded in mystery.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck I",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. Not long ago, Donald left Disney Castle with Goofy to search for King Mickey. During that quest, they met Sora and became fast friends. After they helped Sora save the worlds from darkness, Donald and Goofy continued their search for King Mickey, who had decided to stay behind in the realm of darkness. But before they could find the King, the three friends were plunged into a deep sleep.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck II",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds with Sora and Goofy in search of the King. The last time he visited Agrabah, Donald fought side by side with Aladdin to defend the city from Jafar.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck III",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds in search of clues to the whereabouts of the King. In his previous travels, Donald and his friends helped to defend Atlantica from Ursula, the sea witch.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck IV",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. Donald left Disney Castle in the Gummi Ship to search for King Mickey. Donald already knows the Beast. The last time they met, they fought together to free Belle from her captors.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck V",
        "CharacterName": "Donald",
        "Description": "A Magician who serves His Majesty. He and Sora join together to search for the missing King. At first, he was reluctant to serve as Santa's bodyguard, but once he stepped foot in Christmas Town, he was more than willing to take on the role.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck VI",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He woke one morning and found a letter the King had left behind before he disappeared. That's when Donald left Disney Castle on this long journey. His one wish is to be reunited with the King and for them to return to Disney Castle together.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck VII",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds with Sora and Goofy in search of the King. Not long ago, he helped unravel Oogie's scheme to take over Halloween Town.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck VIII",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He left Disney Castle on a journey to find the King, who had disappeared. He's traveling the worlds with Sora in search of clues to the whereabouts of King Mickey.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck IX",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. Donald and Goofy are traveling with Sora because the King's letter told them to \"follow the Keybearer.\" Not long ago, they helped Hercules stop Hades from taking over the world. Phil has dubbed him a \"Junior Hero.\"",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck X",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds in search of King Mickey, who set out to solve the riddle of Organization XIII. When he arrived at Port Royal, Donald couldn't hide the wonder he felt at how different it was from other worlds he'd visited.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XI",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds with Sora and Goofy in search of the King. Donald's got new wings in this world. So, naturally, he got the hang of it right away.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XII",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He's traveling the worlds with Sora and Goofy in search of King Mickey, who's battling the forces of darkness. Not long ago, Donald helped fight a great battle here against Maleficent, whose Heartless filled the castle corridors.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XIII",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. He left Disney Castle on a quest to find King Mickey. Donald tried to use Ansem's computer to find the King, but his impatient banging caused the MCP to transport the three friends into the world inside the computer system.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XIV",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. To save Disney Castle, Donald went through a doorway Merlin conjured up into a black-and-white world that seemed strangely familiar.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XV",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. Like Sora, Donald had fallen into a deep slumber, but woke up moments before Sora did. They're happy to be reunited after all this time... but what lies ahead?",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck XVI",
        "CharacterName": "Donald",
        "Description": "The Royal Court Magician. Donald, Goofy, and Sora have made lots of friends during their long journey. Donald's loyalty to the King and his friendship with Sora keep his spirits high as they approach the biggest battle of all.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Dr. Finkelstein",
        "CharacterName": "Dr. Finkelstein",
        "Description": "The mad scientist of Halloween Town. Sally is one of his creations. The first time Sora and his friends met the doctor, he was trying to create a heart. He failed, but he hasn't lost his appetite for strange inventions. The doctor's head is made out of steel plates that open up for maintenance.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Ed",
        "CharacterName": "Ed",
        "Description": "A witless hyena who's not very smart, but loves to laugh. He takes a lot of ribbing from his pals Shenzi and Banzai, but he doesn't seem to care.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Eeyore",
        "CharacterName": "Eeyore",
        "Description": "Eeyore always seems to be a bit gloomy. His usual residence is a house built of sticks. His tail is held on by a tack, but it keeps falling off and getting lost. Eeyore spends quite a lot of time wandering the Hundred Acre Wood looking for a new home, because his stick is always falling down.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Elizabeth Swann",
        "CharacterName": "Elizabeth Swann",
        "Description": "Daughter of Port Royal's governor. To protect Will, she kept his pirate medallion hidden from her father and his men. A bit romantic about pirate life, she likes to steal a glance at the medallion every now and then. Will is a bit shy and formal around Elizabeth because of her father's position. She kind of wishes he wouldn't be.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "The Emperor",
        "CharacterName": "The Emperor",
        "Description": "The Emperor rules China with wisdom that's said to be as vast as the ocean, and with a resolve that's as unshakable as a mountain. He is deeply grateful to Mulan and Captain Shang for saving China from the Huns.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "The Experiment",
        "CharacterName": "The Experiment",
        "Description": "Dr. Finkelstein's puppet creation. Unlike Sally, it didn't have a heart - so it went to find one in the love that's bundled with all presents.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Fauna",
        "CharacterName": "Fauna",
        "Description": "A sweet and gentle fairy, Fauna dresses in green. Always eager to please, she only uses magic to help others. Fauna helped Sora prepare for his journey with just the right traveling clothes.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Flora",
        "CharacterName": "Flora",
        "Description": "A kind and good fairy, Flora is always dressed in red. The leader of the group, she helps Fauna and Merryweather make the right decisions. Flora helped Sora prepare for his journey with just the right traveling clothes.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Flotsam",
        "CharacterName": "Flotsam",
        "Description": "An evil eel who works for Ursula. His left eye shines with a menacing golden gleam. Flotsam uses empty promises to lure unsuspecting mermen and mermaids into Ursula's clutches. He was defeated by Sora and his friends in the last battle, but Flotsam returned along with Ursula.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Flounder",
        "CharacterName": "Flounder",
        "Description": "Ariel's trusted friend Flounder would do anything for her. He's small and not exactly brave, but he'll never leave Ariel's side, even when it means facing danger.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Fuu",
        "CharacterName": "Fuu",
        "Description": "One of Seifer's followers. She never says a word more than she has to, leading to some very unusual \"one-worders.\" Fuu has Seifer's complete trust, and sees her mission in life as making herself useful to him.",
        "AdditionalInformation": "Final Fantasy VIII"
      },
      {
        "Title": "Genie",
        "CharacterName": "Genie",
        "Description": "Genie spent ten thousand years stuck inside the magic lamp until Aladdin found him. After Genie helped Aladdin defeat Jafar, Aladdin used his third and final wish to set Genie free. For Genie, it's a dream come true. Instead of being at every master's beck and call, he's enjoying a carefree life.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "The Ghost of Scar",
        "CharacterName": "Scar's Ghost",
        "Description": "This phantom appeared in the Pride Lands after Scar's death. It seems to have been created from the evil in Scar's heart, and it preys on the weakness in Simba's. The ghost may be a sign of more evil to come. Simba still can't seem to believe in himself, and the other lions are getting more and more worried.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Goofy I",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. Not long ago, Goofy left Disney Castle with Donald in search of King Mickey. Along the way, they joined Sora, obeying the King's command to \"follow the Keybearer.\" After helping save the worlds from darkness, Goofy continued his quest to find the King. But like Donald and Sora, he fell into a deep slumber before he could finish the quest. Wonder what Goofy was doing just before he fell asleep?",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy II",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds with Sora and Donald in search of the King. The last time he visited Agrabah, Goofy fought side by side with Aladdin to defend the city from Jafar.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy III",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds in search of clues to the whereabouts of King Mickey. In his previous travels, Goofy and his friends helped to defend Atlantica from Ursula, the sea witch.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy IV",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. Goofy left Disney Castle in the Gummi Ship to search for King Mickey. Goofy already knows the Beast. The last time they met, they fought together to free Belle from her captors.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy V",
        "CharacterName": "Goofy",
        "Description": "The Captain of the Royal Guard. He and Sora join forces together to search for the missing King. He always seems to get caught in the middle of Sora and Donald's antics.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy VI",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. A letter the King wrote before he disappeared is the reason Goofy left Disney Castle on this long journey. His one wish is to be reunited with the King and for them to return to Disney Castle together.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy VII",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds with Sora and Donald in search of the King. Not long ago, he helped unravel Oogie's scheme to take over Halloween Town.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy VIII",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He left Disney Castle on a journey to find the King, who had disappeared. Goofy's loyalty to King Mickey is second to none, and he's always ready to help his pal Sora when the going gets tough.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy IX",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. Goofy and Donald are traveling with Sora because the King's letter told them to \"follow the Keybearer.\" Not long ago, they helped Hercules stop Hades from taking over the world. Phil has dubbed him a \"Junior Hero.\"",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy X",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds in search of King Mickey, who set out to solve the riddle of Organization XIII. When he arrived at Port Royal, Goofy couldn't hide the wonder he felt at how different it was from other worlds he'd visited.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XI",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds with Sora and Donald in search of the King. Goofy's been transformed into a turtle in this world, and it seems to suit him just fine.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XII",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He's traveling the worlds with Sora and Donald in search of King Mickey, who's battling the forces of darkness. Not long ago, Goofy helped fight a great battle here against Maleficent, whose Heartless filled the castle corridors.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XIII",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. He left Disney Castle on a quest to find King Mickey. Donald tried to use Ansem's computer to find the King, but his impatient banging caused the MCP to transport the three friends into the world inside the computer system.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XIV",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. To save Disney Castle, Goofy went through a doorway Merlin conjured up into a black-and-white world that seemed strangely familiar.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XV",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. Like Sora, Goofy had fallen into a deep slumber. He doesn't remember why he was asleep, but he's thoroughly refreshed after sleeping so well. Who can say what's in store for our three reunited friends?",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy XVI",
        "CharacterName": "Goofy",
        "Description": "Captain of the Royal Knights. Goofy, Donald, and Sora have made lots of friends during their long journey. Courageous and dependable, Goofy's ready to fight the biggest battle of all to save his king and friends.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Gopher",
        "CharacterName": "Gopher",
        "Description": "Gopher is an excavation expert. That is, he's a specialist at digging holes. Whenever you need to find him, just look for a mound of fresh dirt.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Hades",
        "CharacterName": "Hades",
        "Description": "Lord of the Underworld. The last time Sora and his friends tangled with Hades, he was using the Heartless to try to take over the world. Together with Hercules, the three friends put a stop to his plans. But Hades is as evil as ever, and won't rest until he sends Hercules to the Underworld - for eternity.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Hayner",
        "CharacterName": "Hayner",
        "Description": "A boy who lives in Twilight Town who has a bit of an attitude problem. Once he gets an idea, he has to LIVE it - and Pence and Olette get dragged along for the ride. There's bad blood between Hayner and Seifer - the town's self-appointed \"disciplinarian.\"",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hercules I",
        "CharacterName": "Hercules",
        "Description": "A legendary hero with super strength - and a pretty great fellow, too. Hercules is the son of the gods Zeus and Hera, but he's not a god himself. Not long ago, he joined forces with Sora and his friends to stop Hades from taking over the world. Hercules really impresses the crowds when he battles in the Coliseum. He's never lost a match yet.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Hercules II",
        "CharacterName": "Hercules",
        "Description": "A legendary hero with super strength. When the Hydra destroyed the Coliseum, Hercules thought he'd let everyone down. Now he isn't sure he's the hero he thought he was, and he seems to have lost his fighting spirit.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Horace Horsecollar",
        "CharacterName": "Horace",
        "Description": "An old friend of King Mickey, Queen Minnie, and the other folks at Disney Castle. Horace wouldn't be Horace without his big plow collar. He's also close friends with Clarabelle Cow.",
        "AdditionalInformation": "The Plowboy (1929)"
      },
      {
        "Title": "Hostile Program",
        "CharacterName": "Hostile Program",
        "Description": "An executable called from the DTD dataspace to destroy the town.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Huey",
        "CharacterName": "Huey",
        "Description": "One of Donald's three nephews, Huey is the leader of the bunch. He keeps Dewey's plans in line and makes sure Louie doesn't fall behind while they help out with Uncle Scrooge's ice cream business. You can spot him by his trademark red cap. The last time we saw Huey, he was working in Traverse Town, saving up for an expedition.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "The Hydra",
        "CharacterName": "Hydra",
        "Description": "A legendary monster with many heads, sent by Hades to fight Hercules. If you cut off one of its heads, two more grow back.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Iago",
        "CharacterName": "Iago",
        "Description": "Jafar's boisterous and cunning parrot. He's Jafar's eyes and ears for everything going on in Agrabah. Iago's mischief finally landed him inside the lamp, imprisoned with Jafar. Now that he's finally free again, he swears he's turned over a new feather. But I wonder...",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Jack Skellington I",
        "CharacterName": "Jack Skellington",
        "Description": "The Pumpkin King. He loves scaring folks more than just about anything. When Sora and his friends first met Jack, he wanted to use the Heartless to spice up his frightening Halloween celebration. But things didn't work out quite like Jack planned. Now Jack's enchanted by Christmas. He's determined to give Santa a rest and show he can do a top-notch job running the big day.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Jack Skellington II",
        "CharacterName": "Jack Skellington",
        "Description": "He loves to scare people silly - but when Jack discovered Christmas, he was captivated. He even thought he could improve it by adding his own special brand of fright. Jack wanted to deliver presents to the children of the world for Santa. Santa helped him realize that his talents were really meant for Halloween. But Jack still has the Santa suit Sally made for him!",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Jafar I",
        "CharacterName": "Jafar",
        "Description": "Before he became an evil genie, Jafar was the Sultan's royal vizier. The last time we were in Agrabah, Jafar was trying to use the Heartless to take over the city. He even got control of Aladdin's pal Genie and wished to become a powerful genie himself. Aladdin, Sora, and his friends joined together to defeat Jafar, and imprisoned him in his own lamp.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Jafar II",
        "CharacterName": "Genie Jafar",
        "Description": "When he was master of the lamp, Jafar used his last wish to become an all-powerful genie. He was imprisoned in the lamp, but eventually made his escape, thanks to the Peddler. Jafar then used his magical power to grow to a colossal size. He tried to take over Agrabah, but Sora and his friends defeated him once more.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Jetsam",
        "CharacterName": "Jetsam",
        "Description": "An evil eel who works for Ursula. His right eye shines with a menacing golden gleam. Jetsam is a smooth talker, and he knows how to manipulate the hearts of others. He was defeated by Sora and his friends in the last battle, but Jetsam returned along with Ursula.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "Glad you could join us! Cricket's the name - Jiminy Cricket. Queen Minnie asked me to come along on this quest as the Royal Chronicler. And what an adventure it's been! You might remember that I also help my pal Pinocchio out as his official conscience. I try to keep the little fellow on the straight and narrow and show him right from wrong. He sure can be a handful sometimes.",
        "AdditionalInformation": "Pinocchio (1940)"
      },
      {
        "Title": "Kairi I",
        "CharacterName": "Kairi",
        "Description": "Longtime friend of Riku and Sora, and one of the Seven Princesses with ties to the Keys and Keyholes. Not long ago, when she was lost in the darkness, Riku and Sora both tried to save her, each in his own way. Thanks to them, Kairi was able to return to her home islands, but her memories of Sora were gone, and she soon stopped visiting the islet where they once played.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi II",
        "CharacterName": "Kairi",
        "Description": "Longtime friend of Riku and Sora, and one of the Seven Princesses with ties to the Keys and Keyholes. She had lost her memories of Sora, and after they returned, she wanted to meet him more and more with every passing day. Falling through an unexpected hole into the darkness, she arrived in Twilight Town and befriended Hayner, Pence, and Olette before being captured by Axel. Kairi is fervently hoping to meet up with Sora once more.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kanga",
        "CharacterName": "Kanga",
        "Description": "Roo's mother. When she leaves her house, she just pops little Roo into her pouch and off they go. Kanga is always ready with kind and gentle advice for her neighbors in the Hundred Acre Wood.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "King Mickey I",
        "CharacterName": "Mickey",
        "Description": "The king of Disney Castle. It's been a while since he set off alone to fight the darkness threatening the worlds. King Mickey and Riku stayed behind the realm of darkness to keep the Heartless from escaping again. Donald, Goofy, and Sora will keep searching until they're reunited with the King.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "King Mickey II",
        "CharacterName": "Mickey",
        "Description": "The king of Disney Castle. He was the first to realize what a threat the darkness was, and the first to act. King Mickey travels across the worlds, battling the Heartless and searching for an answer to the riddle of Organization XIII and the Nobodies. After many great battles, the King seems even more determined than ever to fight against the darkness.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "King Mickey III",
        "CharacterName": "Mickey",
        "Description": "The King of Disney Castle. He faced incredible danger as he sought out the secrets of Organization XIII on his own. The King seems to know something about what happened to Riku. Whatever it is, he's keeping it to himself.",
        "AdditionalInformation": ""
      },
      {
        "Title": "King Mickey (?) I",
        "CharacterName": "Mickey",
        "Description": "It's King Mickey all right, but in this world, he doesn't have a lot to say, and he doesn't look exactly like the king we all know. His Majesty's acting like he's somebody completely different. I wonder what's going on.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "King Mickey (?) II",
        "CharacterName": "Mickey",
        "Description": "It's King Mickey, but back when he was working on Pete's steamboat. One thing sure hasn't changed - His Majesty was just as brave back then as he is now.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "King Triton I",
        "CharacterName": "King Triton",
        "Description": "The Sea King who rules Atlantica; the trident is the symbol of his power. Triton dearly loves his daughter Ariel, but to ensure her safety and the security of his kingdom, he's strictly forbidden her to have contact with anyone from the human world.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "King Triton II",
        "CharacterName": "King Triton",
        "Description": "The Sea King who rules Atlantica. At least, he used to - until Ursula changed him into a small, ugly sea creature. But he was willing to pay that price to save Ariel from Ursula's evil magic.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Larxene",
        "CharacterName": "Larxene",
        "Description": "Formerly Organization XIII's Number XII. She has been eliminated. Larxene conspired with Marluxia to turn on the Organization. Larxene was unfeeling and loved nothing more than to bring people down, but she met her demise when that malice came full circle.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Leon",
        "CharacterName": "Leon",
        "Description": "A swordsman who carries a gunblade. His real name is Squall Leonhart. He took the name Leon to distance himself from his past self - the man who stood helpless as Heartless invaded his home. For some time he took refuge in a different town, but thanks in part to Sora's help, Leon was able to reclaim this, his hometown. Now he works tirelessly towards its restoration.",
        "AdditionalInformation": "Final Fantasy VIII"
      },
      {
        "Title": "Lexaeus",
        "CharacterName": "Lexaeus",
        "Description": "Formerly Organization XIII's Number V. He once brandished a giant tomahawk, but now he has been eliminated. Lexaeus rejected Marluxia's bid to dominate the Organization, and formulated his own plans - but the plans failed and he met his end.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ling",
        "CharacterName": "Ling",
        "Description": "One of the men drafted to help defend China from the Hun invasion. Ling loves to talk and tell jokes.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Lingering Will",
        "CharacterName": "Lingering Will",
        "Description": "A mysterious man who appeared in the portal within Disney Castle. Clad in armor, he controls the Keyblade and its power with more ease than Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lock",
        "CharacterName": "Lock",
        "Description": "A member of the prankster trio that includes Shock and Barrel. Their walking bathtub helps them get around while they commit all kinds of mischief. They sometimes help Oogie, but they're not really loyal to him.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Louie",
        "CharacterName": "Louie",
        "Description": "One of Donald's three nephews helping out with Uncle Scrooge's ice cream business. Louie is gentle and carefree, but notices a lot of things others miss. To find him, look for his green cap. The last time we saw Louie, he was working in Traverse Town, saving up for an expedition.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Lumière",
        "CharacterName": "Lumière",
        "Description": "The castle's maitre d'. He became a candlestick when an enchantress put a spell on the castle. Lumiere has a way with words and can be quite a charmer.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Luxord I",
        "CharacterName": "Luxord",
        "Description": "Organization XIII's Number X. The Organization has hinted that not only do they know about the Keyblade, but they may know things about Sora himself. Are they playing mind games, or is there truth to their words?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Luxord II",
        "CharacterName": "Luxord",
        "Description": "Organization XIII's Number X, a master of rhetoric whose words left Sora and his companions quite perplexed. Luxord was using the cursed medallions to conduct experiments on behalf of the Organization.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Luxord III",
        "CharacterName": "Luxord",
        "Description": "Organization XIII's Number X, a gambler who can manipulate time. Having shaken Sora and his companions with wily words, Luxord entertained himself by drawing them into a game-like battle. In Port Royal, Luxord used Heartless and the cursed medallions to conduct experiments on the Organization's behalf and collect hearts.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Magic Carpet",
        "CharacterName": "Carpet",
        "Description": "A magical flying carpet. Carpet is an old friend of Genie's. Ever since Aladdin found him in the Cave of Wonders, Carpet will do anything to help him. Carpet can carry Aladdin across the vastness of the desert in the blink of an eye.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Maleficent I",
        "CharacterName": "Maleficent",
        "Description": "A sorceress of frightening power. In the last adventure, she controlled the Heartless and led a group that was trying to harness the power of darkness. As part of her villainous plan, Maleficent tricked Riku into making the choice to dive into the realm of darkness. In the end, Maleficent yielded to the power of darkness herself and was defeated by Sora and his friends. But by using her last bit of evil power, she was able to come back again some time later.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Maleficent II",
        "CharacterName": "Maleficent",
        "Description": "A sorceress of frightening power who's behind the strange goings-on at Disney Castle. Maleficent is determined to take over Disney Castle, and she's using the power of darkness in her evil scheme.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Maleficent III",
        "CharacterName": "Maleficent",
        "Description": "A sorceress of frightening power. She's using the Heartless as part of her scheme to bring all the worlds under her control. Lock, Shock, and Barrel are just what Maleficent needs to make trouble for Sora and his friends while they're in Halloween Town.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Marluxia",
        "CharacterName": "Marluxia",
        "Description": "Formerly Organization XIII's Number XI. He has been eliminated. He plotted an Organization rebellion and tried to seize the power of the Keyblade, but Axel's betrayal led to his destruction.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Mayor",
        "CharacterName": "The Mayor",
        "Description": "The two-faced mayor of Halloween Town. His face switches from a happy version to a sad one depending on his mood, which seems to change pretty often. The Mayor relies on Jack to make preparations for Halloween. In fact, the Mayor can't decide a thing without Jack's help.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "MCP",
        "CharacterName": "MCP",
        "Description": "The Master Control Program. He rules the system as the chief control program. Instead of working for the users, the MCP is planning to take over the system for himself. By refusing to follow the users' orders and trying to enact his evil plan, he's causing chaos among the other programs.",
        "AdditionalInformation": "Tron (1982)"
      },
      {
        "Title": "Megara",
        "CharacterName": "Meg",
        "Description": "Or \"Meg\" for short. She's tough, witty, and a true friend to Hercules. Since she met him, Meg's been trusting folks a bit more than before. Meg set out alone for the Underworld. She knew Hercules was exhausted and wanted Hades to give him a break from fighting in the Coliseum.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Merlin",
        "CharacterName": "Merlin",
        "Description": "A powerful wizard who's currently living in Hollow Bastion. He's letting the Hollow Bastion Restoration Committee use his house as a meeting place. Merlin has wisdom and magical powers that are second to none, and he taught Donald most of what he knows about magic. He also has a mysterious bag that can hold anything, no matter how big it is.",
        "AdditionalInformation": "The Sword in the Stone (1963)"
      },
      {
        "Title": "Merryweather",
        "CharacterName": "Merryweather",
        "Description": "A spirited fairy dressed in blue, Merryweather can sometimes be a bit stubborn. Together with Fauna and Flora, she tries to stop Maleficent from harming others. Merryweather helped Sora prepare for his journey with just the right traveling clothes.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Queen Minnie",
        "CharacterName": "Minnie",
        "Description": "Queen of Disney Castle. She is ruling in Mickey's absence. At her request, I'm tagging along with Donald and Goofy as the Royal Chronicler. Queen Minnie is quite concerned about the King, but she knows in her heart that he'll be all right.",
        "AdditionalInformation": "Plane Crazy (1928)"
      },
      {
        "Title": "Moogles",
        "CharacterName": "Moogle(s)",
        "Description": "A strange race that pops up in even stranger places to open shop. Moogles hate having their pompoms ruffled (don't we all?), but the pompom rufflers just keep coming in droves. Maybe that's why the moogles use holograms to run their shops now, while they kick back at home.",
        "AdditionalInformation": "Final Fantasy III"
      },
      {
        "Title": "Mrs. Potts",
        "CharacterName": "Mrs. Potts",
        "Description": "The Beast's housekeeper and Chip's mother. She became a teapot when an enchantress put a spell on the castle. Mrs. Potts is always ready to warm your heart with a comforting cup of tea.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Mufasa",
        "CharacterName": "Mufasa",
        "Description": "A great king of the Pride Lands who was loved by all the animals who lived there. He passed on the wisdom of generations of kings to his son Simba. Mufasa tried to climb to safety after saving young Simba from a stampede, but Scar sent him falling to his death.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Mulan",
        "CharacterName": "Mulan",
        "Description": "The only daughter of the distinguished Fa family, Mulan has a hard time acting the way everybody wants her to. She's sure she'll never fit in. But when her aging father was ordered to join the Imperial Army, she sneaked away and risked her life to take his place.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Ping",
        "CharacterName": "Ping",
        "Description": "The only daughter of the distinguished Fa family. Her real name is Fa Mulan. She disguised herself as a man and joined the Imperial Army in her father's place to fight the Huns and uphold the family's honor. The other soldiers know her as Ping.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Mushu",
        "CharacterName": "Mushu",
        "Description": "He used to be one of the Fa family guardians, but Mushu's mistakes got him demoted to the lowly job of gong ringer. He hopes to prove himself and win back his place among the other guardians by helping Mulan. Mushu gave Sora and his friends some valuable help during their last adventure.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Nala",
        "CharacterName": "Nala",
        "Description": "Simba's childhood friend Nala has grown up to be a strong lioness. She's searching for help to save the Pride Lands, which have fallen into a terrible state.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Naminé",
        "CharacterName": "Naminé",
        "Description": "A girl with the power to manipulate memories. She seems to have some strong connection to Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Olette",
        "CharacterName": "Olette",
        "Description": "A girl who lives in Twilight Town. She spends most of her time with Hayner and Pence. Olette makes sure to look after the two of them, and won't stand for unfinished homework. She likes to go shopping on Market Street and watch the sunset while talking with her friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Oogie Boogie",
        "CharacterName": "Oogie Boogie",
        "Description": "An evil bag of bugs who loves gambling with dice and dreams of causing trouble for Jack in Halloween Town. Sora and his friends defeated Oogie once before, but Maleficent brought him back as part of her evil plan.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Owl",
        "CharacterName": "Owl",
        "Description": "Owl seems to be the wisest resident of the Hundred Acre Wood. Whenever anyone has a question they can't answer, they ask Owl. He's always happy to help, but his answers aren't exactly right!",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Pain",
        "CharacterName": "Pain",
        "Description": "One of Hades' lackeys. Pain tried to attack Hercules when the great hero was just a little baby, but Hercules just clobbered him. Pain can change form whenever he likes, but he's a bit of a bumbler. He's never far from his evil partner Panic.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Paine",
        "CharacterName": "Paine",
        "Description": "One of a teenybopping trio or Friendly Neighborhood something-or-others. They claim to come in peace... but, really, what ARE they?",
        "AdditionalInformation": "Final Fantasy X-2"
      },
      {
        "Title": "Panic",
        "CharacterName": "Panic",
        "Description": "One of Hades' lackeys. Panic tried to attack Hercules when the great hero was just a little baby, but Hercules just clobbered him. Panic can change form whenever he likes, but he's a bit of a bumbler. He's never far from his evil partner Pain.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "The Peddler",
        "CharacterName": "The Peddler",
        "Description": "He runs a shop offering all kinds of merchandise. There's definitely something suspicious about this fellow, though.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Pegasus",
        "CharacterName": "Pegasus",
        "Description": "A beautiful horse that can fly just like an eagle, Pegasus is Hercules' loyal partner. Hercules' father Zeus created Pegasus from a cloud and gave him to Hercules when he was a baby. Hercules and Pegasus were separated for a while, but they were reunited again when they grew up.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Pence",
        "CharacterName": "Pence",
        "Description": "A boy who lives in Twilight Town. He hangs out with Hayner (their \"leader\") and Olette (the responsible one). As for Pence himself, he's relatively laid back. When there's a problem, he takes his time and approaches the problem realistically. He likes spending time with his friends - especially when there's Sea Salt ice cream.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pete I",
        "CharacterName": "Pete",
        "Description": "A tough and mean former steamboat captain. Donald and Goofy know Pete real well - he's so bad that King Mickey was forced to banish him to another dimension. Maleficent found Pete there and helped him escape from exile. Since then, he's been traveling the worlds, assembling an army of Heartless for Maleficent. It's pretty certain that the two of them are planning to take over and rule all the worlds.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete II",
        "CharacterName": "Pete",
        "Description": "King Mickey's nemesis. Pete is collecting an army of Heartless and helping Maleficent in her scheme to take over all the worlds. He's also lending Hades a hand with his collection of Heartless.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete III",
        "CharacterName": "Pete",
        "Description": "Pete's using the Heartless to get control over all the worlds. He's helping Scar's phantom, too. Seems like Pete's trying to cover all his bases.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete IV",
        "CharacterName": "Pete",
        "Description": "King Mickey's old nemesis. He traveled back in time on Maleficent's orders. As part of Maleficent's scheme to take over Disney Castle, Pete plans to destroy the Cornerstone of Light. Without the Cornerstone, Disney Castle will be defenseless.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete V",
        "CharacterName": "Pete",
        "Description": "Pete's been a thorn in King Mickey's side ever since the days the King served on Pete's steamboat. Now Pete's teamed up with Captain Barbossa and his men. He's planning something bad - that much is certain.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete (?) I",
        "CharacterName": "Pete",
        "Description": "Captain of a river steamboat; this is a different Pete than the one we know. He doesn't seem to have any connection with the Heartless. Why, he doesn't even recognize Sora, Donald, and Goofy! I wonder if he's just trying to trick us.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Pete (?) II",
        "CharacterName": "Pete",
        "Description": "Captain of a river steamboat. He's Pete, but from the past. A long time ago, King Mickey started out working for Pete on his boat. Somehow, Pete's managed to get his boat stolen by himself - that is, by the Pete from the future!",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Peter Pan",
        "CharacterName": "Peter Pan",
        "Description": "The boy who can fly. He's from Neverland, where children never grow up. Not long ago, Peter helped Sora and the others defeat the Heartless. During this new adventure, Peter and his friend Tinker Bell help Sora out once again.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "Philoctetes Or \"Phil\" for short. Phil is a veteran trainer of heroes and Hercules' mentor. He also trained Sora and his friends during their first adventures with Hercules. These days Phil is busy running the Coliseum and screening contestants for the games.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Piglet",
        "CharacterName": "Piglet",
        "Description": "One of Pooh's friends in the Hundred Acre Wood. Piglet's tiny and startled by just about anything. But knowing he has friends like Pooh always helps Piglet feel a little more courageous.",
        "AdditionalInformation": "Winnie the Pooh and the Blustery Day (1968)"
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "The King's faithful dog. But Pluto's more than a pet. He and King Mickey are bound together by the strongest ties there are: friendship and loyalty. When the King disappeared, Pluto set out with the others to find his master. I hope that famous nose of his will lead him to the King.",
        "AdditionalInformation": "The Chain Gang (1930)"
      },
      {
        "Title": "Prince Eric",
        "CharacterName": "Prince Eric",
        "Description": "A prince from the world on land who loves the sea. Ariel saved him from drowning when his ship sank one stormy night. Prince Eric doesn't remember anything from that night except Ariel's enchanting voice. Now he's searching everywhere for the girl who saved him.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Princess Jasmine",
        "CharacterName": "Jasmine",
        "Description": "The princess of Agrabah and one of the Seven Princesses needed to open the door to the realm of darkness. Jasmine met Aladdin after she fled the palace to try and lead her own life. She's very grateful to Aladdin, Sora, and his friends for saving her city from Jafar.",
        "AdditionalInformation": "Aladdin (1992)"
      },
      {
        "Title": "Pumbaa",
        "CharacterName": "Pumbaa",
        "Description": "A warthog and one of Simba's closest pals. He found Simba, almost dead of thirst, when he was just a cub. Pumbaa and his best buddy Timon taught Simba their motto, Hakuna Matata, which means \"no worries.\" Some folks are a bit put off by Pumbaa's pungency, but a kinder fellow you'll never find.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "Rabbit is proud of all the vegetables he grows in his garden - especially the carrots. Pooh likes visiting Rabbit, as Rabbit always seems to have some honey to share. Rabbit is a very hard worker, and he wishes Tigger wouldn't bounce so close to his prized carrots.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Rafiki",
        "CharacterName": "Rafiki",
        "Description": "A mandrill who lives in the Pride Lands. Rafiki is a wise old shaman. Rafiki was a trusted adviser to Mufasa, and has always looked forward to the day Simba would take his father's place as king.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Rai",
        "CharacterName": "Rai",
        "Description": "One of Seifer's followers... y'know? Rai tends to get carried away - and truth be told, he feels like he can't hold a candle to Fuu.",
        "AdditionalInformation": "Final Fantasy VIII"
      },
      {
        "Title": "Reindeer",
        "CharacterName": "Reindeer",
        "Description": "A special set of Halloween-styled reindeer, custom-made by Dr. Finkelstein for Jack. They're just right for pulling Jack's coffin sleigh through the Christmas Eve sky.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Rikku",
        "CharacterName": "Rikku",
        "Description": "One of a teenybopping trio or Friendly Neighborhood something-or-others. It looks like these three have been hired by someone for some kind of mission... but what?",
        "AdditionalInformation": "Final Fantasy X-2"
      },
      {
        "Title": "Riku I",
        "CharacterName": "Riku",
        "Description": "The form Sora's longtime friend Riku chose. Though Xehanort tried to control Riku from within, Riku's heart proved stronger. But the only way to wield the darkness fully was to become it. Riku began calling himself \"Ansem,\" perhaps as a sign of resolve. He would live in darkness if that's what it took to wake Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku II",
        "CharacterName": "Riku",
        "Description": "Sora's longtime friend. He had clad himself in darkness in order to wield it, and had even changed in appearance. But when the real Ansem's Kingdom Hearts Encoder exploded, Riku returned to his old form. You could say it was a miracle - worked by a heart no darkness could eclipse.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Roo",
        "CharacterName": "Roo",
        "Description": "The youngest resident of the Hundred Acre Wood. Roo looks up to Tigger, and dreams of bouncing just like him someday.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Roxas I",
        "CharacterName": "Roxas",
        "Description": "A boy who lived in Twilight Town and saw Sora's memories in dreams. His summer vacation has come to an end, and many of his thoughts and feelings with it.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Roxas II",
        "CharacterName": "Roxas",
        "Description": "Organization XIII's Number XIII, a Keyblade wielder and denizen of darkness. He vanished with a satisfied look after battling Sora - but Sora was the only one who could see him in the first place.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx I",
        "CharacterName": "Saïx",
        "Description": "Organization XIII's Number VII. Nobodies like him may look like they respond emotionally, but this is, in fact, a ruse. Nobodies have no hearts.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx II",
        "CharacterName": "Saïx",
        "Description": "Organization XIII's Number VII. He was in pursuit of the renegade Axel, but for some reason seemed more concerned about Sora's well-being. Saïx has no heart, but knows all too well how to injure one. No doubt his poise belies a more savage nature. He also insinuated he knew something about Riku.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx III",
        "CharacterName": "Saïx",
        "Description": "Organization XIII's Number VII. Saïx relentlessly chased the renegade Axel. It was also he who caught Kairi after she eluded Axel and threw her into the castle dungeon. If Saïx sees something he can use, he will - and without a second thought.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sally",
        "CharacterName": "Sally",
        "Description": "One of Dr. Finkelstein's creations, Sally's patched together with parts that sometimes come off and move around on their own. She's gotten very good at mending herself with a needle and thread. Sally usually helps Dr. Finkelstein around the lab, but she'd much rather spend time with Jack.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Santa Claus",
        "CharacterName": "Sandy Claws",
        "Description": "Known to some as Father Christmas, Santa Claus makes children's dreams come true every year on December 25th, delivering presents in a sleigh drawn by flying reindeer. To get ready for Christmas, he depends on his list of this year's good little girls and boys. It seems our friend Jack Skellington is a bit confused. He thinks Santa's name is actually Sandy Claws.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Sark",
        "CharacterName": "Sark",
        "Description": "A powerful program who doesn't serve any user - just the MCP. Commander Sark is pretty harsh to any program that tries to resist his master's power.",
        "AdditionalInformation": "Tron (1982)"
      },
      {
        "Title": "Scar",
        "CharacterName": "Scar",
        "Description": "Simba's evil uncle and brother of Mufasa. After Mufasa's death and Simba's disappearance, Scar became king of the Pride Lands and used the hyenas to do his dirty work. Scar hasn't taken care of the Pride Lands, and almost all the animals have been forced to leave.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Scrooge McDuck",
        "CharacterName": "Scrooge McDuck",
        "Description": "Donald's uncle. Before the Heartless appeared, he was using the Gummi Ship to travel across worlds, setting up a big business empire. Scrooge has more money than most folks can count. But for some reason, he's pretty stingy about spending it. Nowadays Scrooge is working on an ice cream venture he hopes will make him millions.",
        "AdditionalInformation": "Scrooge McDuck and Money (1967)"
      },
      {
        "Title": "Sebastian",
        "CharacterName": "Sebastian",
        "Description": "King Triton's court composer. You could almost say he's a musical genius. Sebastian's also in charge of keeping an eye on Ariel to make sure she stays safe. Right now, he's working on a very special musical.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Seifer",
        "CharacterName": "Seifer",
        "Description": "Self-appointed head of the \"Twilight Disciplinary Committee.\" Seifer does his best to keep the town up to his own rigorous standards, but not everyone appreciates his high-handed tactics - take Hayner's gang, for example. His followers Fujin and Raijin are never far away.",
        "AdditionalInformation": "Final Fantasy VIII"
      },
      {
        "Title": "Selphie",
        "CharacterName": "Selphie",
        "Description": "A girl who lived on the same islands as Sora. She always played with Sora and the other boys. Selphie's whereabouts were in question after Destiny Islands vanished some time ago, but thanks to Sora's help, she was able to return home.",
        "AdditionalInformation": "Final Fantasy VIII"
      },
      {
        "Title": "Sephiroth",
        "CharacterName": "Sephiroth",
        "Description": "An unsurpassed swordsman who was once revered as a hero. For a long time Sephiroth's whereabouts were unknown, and no one can say for sure why he has returned. He seems to have some connection to Cloud's past.",
        "AdditionalInformation": "Final Fantasy VII"
      },
      {
        "Title": "Setzer",
        "CharacterName": "Setzer",
        "Description": "A wayfaring gambler who's ready for any game and any challenge. He'd even cast his life to the chips and let luck choose its course. Setzer is the Struggle's prior winner. He tends to be followed by an army of lovestruck, screaming girls.",
        "AdditionalInformation": "Final Fantasy VI"
      },
      {
        "Title": "Shan-Yu",
        "CharacterName": "Shan-Yu",
        "Description": "Leader of the Huns. He wants to take over all of China. Shan-Yu and his enormous army are fearsome fighters who have defeated some of the Emperor's best troops. Now Shan-Yu plans to use the Heartless to invade the Empire. Shan-Yu has fierce eyes, and is always seen with a hawk who serves as his eyes and ears from above.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Shenzi",
        "CharacterName": "Shenzi",
        "Description": "A cowardly hyena who hates lions. Shenzi takes the lead when she and her friends are up to mischief. She's always quick to follow the strongest leader.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Shock",
        "CharacterName": "Shock",
        "Description": "Another member of the trio of trouble makers. Shock is the most cunning of the three, and comes up with a lot of their ideas for mischief. Last time Oogie was defeated, she started behaving better - well, just a little bit better.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Simba",
        "CharacterName": "Simba",
        "Description": "Son of the great Mufasa who grew up to succeed his father and rule the Pride Lands. As a young cub, Simba mistakenly thought he was responsible for his father's death. He left the Pride Lands and met two new friends: Timon and Pumbaa. They taught him to lead a carefree life. During their first quest, Simba helped Sora, Donald, and Goofy whenever they called on him.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Sora I",
        "CharacterName": "Sora",
        "Description": "A boy chosen by the Keyblade, a mysterious weapon. Not long ago, Sora journeyed with Donald and Goofy in search of his longtime friend Kairi, who had been spirited away into the darkness. In the end, they saved the world of all worlds from the darkness that was closing in. Then, somewhere along the way, Sora fell into a deep slumber. Now that he is awake, he can't recall why he fell asleep to begin with.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora II",
        "CharacterName": "Sora",
        "Description": "A boy chosen by the Keyblade, a mysterious weapon. Not long ago, Sora journeyed with Donald and Goofy in search of his longtime friend Kairi, who had been spirited away into the darkness. In the end, they saved the world of all worlds from the darkness that was closing in. After that, Sora continued journeying in search of Riku, who was trapped on the other side of the door to darkness. And somewhere along the way, Sora fell into a deep slumber. With a new outfit and strengthened resolve, Sora has set out once more on a search for his friend Riku.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora III",
        "CharacterName": "Sora",
        "Description": "A boy who wields the Keyblade. Not long ago, he gathered up the scattered pages of a storybook and became friends with everyone inside.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora IV",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade who fights against the Heartless and the Nobodies. His journey in search of Riku continues. In his travels last time, he helped stop Jafar from taking over Agrabah by trapping him inside a magic lamp.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora V",
        "CharacterName": "Sora",
        "Description": "Hero of the Keyblade. Sora continues his search for Riku, separated from him in the great battle some time ago. In his previous travels, Sora defended Atlantica when Ursula tried to take the Trident.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora VI",
        "CharacterName": "Sora",
        "Description": "A young Keyblade wielder who fights Heartless and Nobodies. His first visit to Christmas Town was nothing short of exciting. That feeling combined with the Keyblade's power is the essence of this outfit.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora VII",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade who fights against the Heartless and the Nobodies. Not long ago, he helped unravel Oogie's scheme to take over Halloween Town.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora VIII",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade, a boy who fights against the Heartless and the Nobodies as the continues his journey. He is looking for the King, who in turn should know where Riku is. Sora came to Disney Castle in response to Queen Minnie's wish.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora IX",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade who fights against the Heartless and the Nobodies. Sora continues to hunt for clues to Riku's whereabouts since the two sere separated some time ago.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora X",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade, whose journey in search of Riku continues. Not long ago, he and Hercules put the freeze on Hades' plans to take over the world. Phil has dubbed him an honest-to-gods \"Junior Hero.\"",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XI",
        "CharacterName": "Sora",
        "Description": "The hero of the Keyblade, a boy destined to battle the Heartless and the Nobodies. Sora searches for Riku in hopes they can return to their island home together. When he arrived at Port Royal, Sora couldn't hide the wonder he felt at how different it was from other worlds he'd visited.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XII",
        "CharacterName": "Sora",
        "Description": "A boy who fights with Keyblade in hand, opening the way before him as he searches for Riku and a way home. Sora has taken a feline form in this world, but he seems to have two left feet... four left paws? Whatever.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XIII",
        "CharacterName": "Sora",
        "Description": "The chosen hero of the Keyblade. He's looking for his friend Riku so they can return to their island home together. Not long ago, Sora waged a great battle here against Maleficent, whose Heartless filled the castle corridors.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XIV",
        "CharacterName": "Sora",
        "Description": "A boy who carries the Keyblade, opening the world-gates in search of Riku. Tinkering with Ansem's computer triggered some kind of unique device that warped Sora inside the computer program.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XV",
        "CharacterName": "Sora",
        "Description": "A boy who searches for Riku and the King, his Keyblade opening the road before him. To save Disney Castle from a thorny fate, Sora passed through Merlin's doorway to a world of black-and-white.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XVI",
        "CharacterName": "Sora",
        "Description": "The chosen hero of the Keyblade who, not long ago, saved the world of all worlds. He has been deep asleep in a mysterious mansion with his friends Donald and Goofy. It looks like he's grown a few inches while he's been napping.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XVII",
        "CharacterName": "Sora",
        "Description": "The boy chosen by the Keyblade, truly the \"key\" to everything. The magic of Merryweather and her fairy friends has prepared new clothes for Sora These garments appear to come complete with various abilities, such as the power of transformation. With renewed resolve, Sora sets out for adventure once more.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora XVIII",
        "CharacterName": "Sora",
        "Description": "The chosen hero of the Keyblade. With Donald and Goofy at his side, he has carried on in search of Kairi and Riku. On the way he has met many people and overcome many trials. And now, at last, he has passed through the alternate Twilight Town and darkness itself to reach the final battleground. Beyond it, will he find light... or something else? Destiny rests on Sora's shoulders.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Stitch",
        "CharacterName": "Stitch",
        "Description": "A strange visitor from a distant planet. Stitch is very strong for his small size and prone to mischief. He's always ready to help his friend Sora whenever Sora needs him.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Tifa",
        "CharacterName": "Tifa",
        "Description": "A young woman in search of a certain someone. Unflinching, unrelenting, Tifa has looked far and wide. Her journey won't be over until she finds the person she seeks.",
        "AdditionalInformation": "Tigger sure is energetic. He loves to use his tail to bounce all over the Hundred Acre Wood. Sometimes his bouncing gets to be a bit much, but he doesn't mean any harm. Underneath that happy-go-lucky exterior, there's a sensitive, gentle heart."
      },
      {
        "Title": "Timon",
        "CharacterName": "Timon",
        "Description": "A meerkat and one of Simba's closest pals. He found Simba, almost dead of thirst, when he was just a cub. Timon and his best buddy Pumbaa taught Simba their motto, Hakuna Matata, which means \"no worries.\" And that's how Simba grew up - with no worries, taking life one day at a time.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Tron I",
        "CharacterName": "Tron",
        "Description": "A security program created by a computer user to watch the MCP.",
        "AdditionalInformation": "Tron (1982)"
      },
      {
        "Title": "Tron II",
        "CharacterName": "Tron",
        "Description": "A security program that was improved and upgraded by Ansem the Wise. He's the fellow who also reprogrammed the MCP. Tron is dedicated to making sure the system functions correctly, but the MCP wants to take control away from the users. Only Ansem knows why these two programs behave so differently.",
        "AdditionalInformation": "Tron (1982)"
      },
      {
        "Title": "Undead Pirate A",
        "CharacterName": "Undead Pirate(s)",
        "Description": "A pirate cursed by the Aztec treasure. By moonlight, his appearance is terrifying.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Undead Pirate B",
        "CharacterName": "Undead Pirate(s)",
        "Description": "A pirate cursed by the Aztec treasure. By moonlight, he becomes a skeleton and is vulnerable to magic attacks.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Undead Pirate C",
        "CharacterName": "Undead Pirate(s)",
        "Description": "A pirate cursed by the Aztec treasure. He and Captain Barbossa are searching for something that will break the curse.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Ursula",
        "CharacterName": "Ursula",
        "Description": "A sea witch who lives in a cave far from the palace. She used to serve King Triton, until her evil scheming got her banished. Some time ago, she tried to get rid of King Triton and take over Atlantica. Sora, Donald, and Goofy helped Ariel defeat her, but she used the power of darkness to return. Her grudge against King Triton is as strong as ever... and now she's looking for revenge.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Vanessa",
        "CharacterName": "Vanessa",
        "Description": "Ursula changed herself into a beautiful girl to ruin Ariel's chances with Prince Eric. Ariel gave her voice to Ursula when she signed their contract... and Ursula used Ariel's voice to mesmerize Prince Eric.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Vexen",
        "CharacterName": "Vexen",
        "Description": "Formerly Organization XIII's Number IV. He has been eliminated. Vexen, Lexaeus, and Zexion were among Organization XIII's founding members, and there was no love lost between them and neophytes like Marluxia. Vexen opposed Marluxia's plans to take over the Organization, and was consequently destroyed by Axel.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vivi",
        "CharacterName": "Vivi",
        "Description": "A boy who lives in Twilight Town. It's not so much that he follows Seifer. But he's so meek he does whatever he's told anyway, and usually gets stuck with the chores. In spite of all that, Vivi likes Seifer and admires his strength.",
        "AdditionalInformation": "Beauty and the Beast (1991)"
      },
      {
        "Title": "Will Turner",
        "CharacterName": "Will Turner",
        "Description": "A very talented swordsmith. As a boy, Will was rescued at sea after pirates burned his ship and left him to drown. About the same time he was rescued, the pirate medallion his father had given him disappeared. Young Elizabeth Swann was aboard the ship that rescued Will, and they've been friends ever since. As Elizabeth's father is governor of Port Royal, Will is a bit shy and rather formal around her.",
        "AdditionalInformation": "Pirates of the Caribbean (2003)"
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A bear who lives in the Hundred Acre Wood. Known as \"Pooh\" for short. He loves to eat, and his very favorite thing to eat is honey. Pooh likes to exercise every morning. He says it improves his appetite.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Xaldin I",
        "CharacterName": "Xaldin",
        "Description": "Organization XIII's Number III. Nobodies like him are made whenever people strong of heart and mind become Heartless. The empty shell they leave behind acts of its own will. Are they empty vessels devoid of hearts? Are they roaming spirits? Or are they simply nothing at all?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xaldin II",
        "CharacterName": "Xaldin",
        "Description": "Organization XIII's Number III. His wiles have clouded the Beast's heart.",
        "AdditionalInformation": "The Organization's motives are a string of mysteries - what could their true goal be?"
      },
      {
        "Title": "Xaldin III",
        "CharacterName": "Xaldin",
        "Description": "Organization XIII's Number III. He wanted the Beast's Heartless and Nobody in order to acquire Kingdom Hearts. In the end, however, Sora and his friends destroyed Xaldin.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xaldin IV",
        "CharacterName": "Xaldin",
        "Description": "Organization XIII's Number III. He sought the Beast's Heartless and Nobody in order to acquire Kingdom Hearts. He was a master of wind who wielded six lances - but he met his end at the hands of Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xehanort",
        "CharacterName": "Terra-Xehanort",
        "Description": "The former apprentice of Ansem the Wise. Even after becoming a Heartless, Xehanort persisted in his research of the doors and the heart of all worlds - all in the name of \"Ansem\", of course. Meanwhile, his Nobody Xemnas had taken leadership of Organization XIII.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar I",
        "CharacterName": "Xigbar",
        "Description": "Organization XIII's Number II. Nothing else about him has come to light. He vanished, leaving Sora with naught but puzzling words. Apparently Organization members can use the darkness to come and go as they please.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar II",
        "CharacterName": "Xigbar",
        "Description": "Organization XIII's Number II. When Sora called out to him, thinking he was Riku, Xigbar gave a curt reply. His motives and his methods remain unclear. Surely he has a greater goal in mind, but what could it be?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar III",
        "CharacterName": "Xigbar",
        "Description": "Organization XIII's Number II. He told Sora once that he reminded him of someone else. Puzzling words, indeed... Some part of him did seem to be enjoying Sora's reaction.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xemnas I",
        "CharacterName": "Xemnas",
        "Description": "Organization XIII's Number I. He directs the group as its leader. Organization XIII is a unique presence among the Nobodies. They think and plan, and seem to have a greater goal. What that is remains to be seen, but they appear to know a bit about the Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xemnas II",
        "CharacterName": "Xemnas",
        "Description": "Organization XIII's Number I. He directs the group as its leader. In truth, he is the Nobody of Xehanort, who was apprenticed to Ansem the Wise. In secret, Xehanort studied the doors and the heart of all worlds, ultimately stealing his master's name, Ansem. When Xehanort became a Heartless, his Nobody Xemnas came into being. Xemnas is using Sora, collecting the hearts released every time a Heartless falls to his Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xemnas III",
        "CharacterName": "Xemnas",
        "Description": "Organization XIII's Number I, who acts as leader of the group. Xemnas is the Nobody of Ansem's apprentice Xehanort. He used Sora and his Keyblade to collect hearts from the Heartless and see Kingdom Hearts to its completion.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yao",
        "CharacterName": "Yao",
        "Description": "One of the men drafted to help defend China from the Hun invasion. Yao's a compact sort of fellow who likes to brag that he's tougher than anybody else.",
        "AdditionalInformation": "Mulan (1998)"
      },
      {
        "Title": "Yen Sid",
        "CharacterName": "Yen Sid",
        "Description": "A powerful sorcerer, second to none. He tutored the King in magic. From conjuring up skies full of beautiful butterflies to parting an ocean, Yen Sid's feats of wizardry are... well, amazing. His name alone fills some folks with awe. Yen Sid shared some of his wisdom with Sora and his friends. He also taught them some valuable techniques to help prepare them for what they'll face on this new quest.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Yuffie",
        "CharacterName": "Yuffie",
        "Description": "One member of the town's Restoration Committee, a spirited girl who actively does her part to keep tabs on the town. Yuffie met Sora when she was living away from her hometown. Thanks to his help last time, the Heartless were ousted and she got to come home - so she's very grateful to him.",
        "AdditionalInformation": "Final Fantasy VII"
      },
      {
        "Title": "Yuna",
        "CharacterName": "Yuna",
        "Description": "One of a teenybopping trio or Friendly Neighborhood something-or-others. They were looking for Leon, but... why?",
        "AdditionalInformation": "Final Fantasy X-2"
      },
      {
        "Title": "Zero",
        "CharacterName": "Zero",
        "Description": "Jack's ghost dog. He comes out of his grave whenever Jack calls, and never gets tired of playing fetch with his master.",
        "AdditionalInformation": "The Nightmare Before Christmas (1993)"
      },
      {
        "Title": "Zexion",
        "CharacterName": "Zexion",
        "Description": "Formerly Organization XIII's Number VI. He has been eliminated. Zexion disliked dirtying his own hands, and relied on his wits to dispose of any rivals - but it was one of his own schemes that wound up destroying him.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts 358/2 Days": [
      {
        "Title": "Axel",
        "CharacterName": "Axel",
        "Description": "A member of Organization XIII. He prioritizes his own motives over the goals of the Organization. He eventually becomes friends with Roxas after their initial meeting. Like Roxas, he comes to worry for Xion after becoming friends with her as well.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Demyx",
        "CharacterName": "Demyx",
        "Description": "A member of Organization XIII. His easy-go-lucky personality is uncharacteristic of an Organization member. He can control water by playing his sitar, but is aware that he is unfit as a fighter.",
        "AdditionalInformation": ""
      },
      {
        "Title": "DiZ",
        "CharacterName": "DiZ",
        "Description": "A mysterious figure who waits with Naminé for Sora's memory to be restored. He despises Nobodies and pushes Naminé to complete restoring Sora's memories to achieve a certain goal.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi",
        "CharacterName": "Kairi",
        "Description": "Childhood friends with Sora and Riku. She was once targeted by the forces of darkness for being a Princess of Heart. Back at Destiny Islands, she waits for Sora and Riku's return.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Larxene",
        "CharacterName": "Larxene",
        "Description": "A member of Organization XIII. She is highly conceited and mocks all those around her with an abrasive attitude. She was sent to Castle Oblivion, but was disposed of by an unknown assailant.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lexaeus",
        "CharacterName": "Lexaeus",
        "Description": "A founding member of Organization XIII. He is a man of brawny physique and few words. He was sent to Castle Oblivion, but was disposed of by an unknown assailant.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Luxord",
        "CharacterName": "Luxord",
        "Description": "A member of Organization XIII. A gambler at heart who enjoys treating everything as a wager. He never lets down his gentlemanly and reserved attitude.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Marluxia",
        "CharacterName": "Marluxia",
        "Description": "A member of Organization XIII. Despite having joined late, he is sent to Castle Oblivion and named its lord based on his profound abilities. He is intrigued by the Keyblade wielder and harbors dark desires, but was disposed of by an unknown assailant.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The King",
        "CharacterName": "Mickey",
        "Description": "A Keyblade Master and lord of Disney Castle. He travelled with Riku, but worries after being separated from him. Wearing a black coat, he pretends to be a member of the Organization and gathers information on their actions.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé",
        "CharacterName": "Naminé",
        "Description": "A young girl with the power to rearrange the memories of Sora and everyone connected to him. She is currently restoring Sora's scattered memories.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku",
        "CharacterName": "Riku",
        "Description": "Childhood friends with Sora and Kairi. He donned the Organization's black coat pretending to be a member, and investigates their actions while waiting for Sora's memories to be restored.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Roxas",
        "CharacterName": "Roxas",
        "Description": "The thirteenth member of Organization XIII. He is often assigned to missions to collect hearts as he wields a Keyblade. A bit of a zombie when he first joined, Roxas slowly regains himself through interaction with Axel and Xion, becoming best friends with them.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx",
        "CharacterName": "Saïx",
        "Description": "A member of Organization XIII. As Xemnas's right-hand man, he is charged with giving orders to other members. He and Axel, an old acquaintance, are plotting something.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora",
        "CharacterName": "Sora",
        "Description": "A young boy who wields a Keyblade as a hero of light. He currently sleeps within Castle Oblivion to restore his memories after saving the world from darkness.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vexen",
        "CharacterName": "Vexen",
        "Description": "A founding member of Organization XIII. A brilliant scientist who carries out research on various Organization projects. He was in charge of the Replica Program at Castle Oblivion, but someone disposed of him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xaldin",
        "CharacterName": "Xaldin",
        "Description": "A founding member of Organization XIII. He is both a fierce warrior and a strategist. He seeks a heart, but despises love and the bonds that tie people together.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xemnas",
        "CharacterName": "Xemnas",
        "Description": "Organization XIII's leader. He has made completing Kingdom Hearts the Organization's goal, but harbors his own secret agenda.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar",
        "CharacterName": "Xigbar",
        "Description": "A senior member of Organization XIII. Second-in-command in deed as well as in name. He looks at the big picture and acts according to his unique perspective.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xion",
        "CharacterName": "Xion",
        "Description": "The fourteenth member of Organization XIII. Like Roxas, she wields a Keyblade. Through interactions with Roxas, she forms her own identity and develops a friendship with Roxas and Axel.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Zexion",
        "CharacterName": "Zexion",
        "Description": "A founding member of Organization XIII. A ruthless tactician who would use any means for his ends. He was sent to Castle Oblivion, but was disposed of by an unknown assailant.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts Birth By Sleep": [
      {
        "Title": "Aeleus",
        "CharacterName": "Aeleus",
        "Description": "A man of true grit who serves in the Royal Guard who watch over Radiant Garden. He values action over words.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Anastasia",
        "CharacterName": "Anastasia",
        "Description": "Lady Tremaine's daughter. She and her older sister Drizella bully Cinderella around. She takes pride in her skill as a flutist, despite not actually having any.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Aqua",
        "CharacterName": "Aqua",
        "Description": "The only one of Master Eraqus's pupils to have been recognized as a true Keyblade Master. A healthy rivalry and close friendship bind her and her training mates Terra and Ven together.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Aqua (A)",
        "CharacterName": "Aqua",
        "Description": "The only one of Master Eraqus's pupils to have been recognized as a true Keyblade Master. Her orders: to bring the Unversed situation under control, and to keep an eye on Terra. She is very concerned about Terra, as well as Ventus, who ran away from home to find him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Armor of Eraqus",
        "CharacterName": "Eraqus",
        "Description": "A sentient suit of armor containing a Keyblade Master's will.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Princess Aurora",
        "CharacterName": "Aurora",
        "Description": "A princess who was cursed at birth by Maleficent. To keep her safe, three good fairies hid her in the forest and gave her a new name: Briar Rose. On her sixteenth birthday, she learned of her origins and returned to the castle, but true to Maleficent's curse, she fell into eternal slumber. When brought together, seven hearts of pure light like Aurora's are the key to ruling all worlds.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Princess Aurora (A)",
        "CharacterName": "Aurora",
        "Description": "A princess who fell into eternal slumber as a result of Maleficent's curse. Prince Phillip woke her, however, with true love's kiss. When brought together, seven hearts of pure light like Aurora's are the key to ruling all worlds.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Bashful (V)",
        "CharacterName": "Bashful",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Bashful will turn red if you so much as say hello.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Bashful (A)",
        "CharacterName": "Bashful",
        "Description": "One of seven dwarfs who live with Snow White. Bashful will turn red if you so much as say hello.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Braig",
        "CharacterName": "Braig",
        "Description": "A mysterious man who is up to something behind the scenes. He and Master Xehanort have an understanding; Braig staged the Master's kidnapping to draw the darkness out of Terra, but that same darkness left Braig scarred.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Captain Hook",
        "CharacterName": "Captain Hook",
        "Description": "A pirate of Never Land, and Peter Pan's archenemy. For all his attempts to give \"that cowardly sparrow\" his comeuppance, he has yet to succeed. His usual swagger is replaced by terror at the very sight or sound of the crocodile.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Chip",
        "CharacterName": "Chip",
        "Description": "One of Disney Castle's engineers. He and his younger brother Dale put a lot of work into building a racetrack for the whole town to enjoy, and now the Unversed and Pete's antics are ruining all the fun. Chip is none too pleased.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Cinderella",
        "CharacterName": "Cinderella",
        "Description": "A young lady who believes dreams can come true. Lady Tremaine and her daughters seem determined to make her life a misery, but Cinderella endures it with grace. She and Jaq the mouse are good friends. When brought together, seven hearts of pure light, like Cinderella's, are the key to ruling all worlds.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Cinderella (T)",
        "CharacterName": "Cinderella",
        "Description": "A young lady who believes dreams can come true. Cinderella was devastated when Lady Tremaine and her daughters tore apart her dress for the ball, but was soon visited by her Fairy Godmother, who used magic to provide her a coach and a new dress. She caught Prince Charming's eye at the ball, but had to flee the palace by the stroke of twelve, before the magic wore off. When brought together, seven hearts of pure light like Cinderella's are the key to ruling all worlds.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "The Crocodile",
        "CharacterName": "The Crocodile",
        "Description": "Captain Hook's most feared enemy. Just a few ticks of the clock he swallowed are enough to send Hook running for dear life.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Cubby (V)",
        "CharacterName": "Cubby",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. Tinker Bell wanted him and Slightly to help her look for a shooting star, but they ended up going after Captain Hook's treasure with Peter instead.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Cubby (T)",
        "CharacterName": "Cubby",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. Peter took him and Slightly to try and swipe Captain Hook's treasure.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Cubby (A)",
        "CharacterName": "Cubby",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. Together, they went on an \"expatition\" to find the treasure marked on Peter's map.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Daisy Duck",
        "CharacterName": "Daisy",
        "Description": "Donald's girlfriend. She is assisting Queen Minnie with royal affairs until the King returns.",
        "AdditionalInformation": "Don Donald (1937)"
      },
      {
        "Title": "Dale",
        "CharacterName": "Dale",
        "Description": "One of Disney Castle's engineers. He and his older brother Chip just got through building a racetrack for everyone to enjoy. But now, the Unversed and Pete are messing everything up, and it's really rattling Dale's cage.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Dewey",
        "CharacterName": "Dewey",
        "Description": "One of Donald's triplet nephews. He runs an ice cream shop with Huey and Louie. They're trying to save up for a big adventure. It was Dewey's idea to combine rhythm and ice cream to attract customers.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Dilan",
        "CharacterName": "Dilan",
        "Description": "One of the Royal Guard who keep Radiant Garden safe. His savage looks belie a silver tongue and natural talent for manipulating the hearts of others.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Doc",
        "CharacterName": "Doc",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Doc is the most knowledgeable; he's the one with the glasses.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald",
        "Description": "A magician in the service of King Mickey. He and Goofy rushed to Yen Sid's tower when they heard their king had gone missing in the middle of his training.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Dopey (V)",
        "CharacterName": "Dopey",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Dopey is always one clumsy step behind the other dwarfs, and meets with many a mishap.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Dopey (A)",
        "CharacterName": "Dopey",
        "Description": "One of seven dwarfs who live with Snow White. Dopey loves Snow White so much, he'll dart to the front of the line just to see her.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Dragon",
        "CharacterName": "Dragon Maleficent",
        "Description": "Maleficent, after using the powers of darkness to transform herself. The green flames that leapt from her maw nearly spelled the end for Prince Phillip and Aqua, but in the end, Phillip's sword of truth flew swift and sure.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Drizella",
        "CharacterName": "Drizella",
        "Description": "Lady Tremaine's daughter. She and her younger sister Anastasia subject Cinderella to constant bullying. Her costly voice lessons do not seem to be doing much good.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Dr. Jumba Jookiba (T)",
        "CharacterName": "Dr. Jumba",
        "Description": "A self-proclaimed \"evil genius.\" He was imprisoned for illegal genetic experimentation to make the mightiest creature in the galaxy: Experiment 626, whose only instinct is to destroy everything he touches. He keeps his other creations besides 626 close at hand, in pod form.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Dr. Jumba Jookiba (A)",
        "CharacterName": "Dr. Jumba",
        "Description": "A self-proclaimed \"evil genius.\" He was imprisoned for illegal genetic experimentation to make the mightiest creature in the galaxy: Experiment 626, whose only instinct is to destroy everything he touches. Dr. Jumba made a brief escape, but is back in custody now.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Enchanted Brooms",
        "CharacterName": "Enchanted Broom(s)",
        "Description": "Wondrous broom that can move about because the King put a spell on them. Normally they work to keep the castle tidy, but are called upon as guards when the need arises.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Even",
        "CharacterName": "Even",
        "Description": "A researcher in Radiant Garden who has been delving into the workings of the heart. He and his fellows at the castle have taken Ienzo, an orphan, under their wing.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Experiment 221",
        "CharacterName": "Sparky",
        "Description": "An alien created by Dr. Jumba through genetic experimentation. His body stores an electric charge which he can use to shocking effect when threatened. Usually, 221 stays in pod form, and only emerges when hydrated.",
        "AdditionalInformation": "Stitch! The Movie (2003)"
      },
      {
        "Title": "Experiment 626 (V)",
        "CharacterName": "Stitch",
        "Description": "An alien created through illegal genetic experimentation by the self-proclaimed \"evil genius\" Dr. Jumba. He was carrying an imitation Wayfinder, and seemed intrigued by Ventus for some reason.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Experiment 626 (T)",
        "CharacterName": "Stitch",
        "Description": "An alien created through illegal genetic experimentation by the self-proclaimed \"evil genius\" Dr. Jumba. Despite being programmed to have only destructive instincts, his encounter with Terra seems to have sparked an interest in friendship.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Experiment 626 (A)",
        "CharacterName": "Stitch",
        "Description": "An alien created through illegal genetic experimentation by the self-proclaimed \"evil genius\" Dr. Jumba. He escaped before his exile could be carried out, so Aqua was asked to apprehend him and Dr. Jumba.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "The Fairy Godmother (T)",
        "CharacterName": "Fairy Godmother",
        "Description": "A kindhearted fairy who appears only to those who believe in their dreams. When Cinderella's dress for the ball was ruined, the Fairy Godmother used magic to give her a new dress and a coach.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "The Fairy Godmother (A)",
        "CharacterName": "Fairy Godmother",
        "Description": "A kindhearted fairy who appears only to those who believe in their dreams. She watches over Cinderella.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Fauna",
        "CharacterName": "Fauna",
        "Description": "The fairy dressed in green. She is the most level-headed of the three. Fauna gave the newborn Aurora the gift of song. To keep her safe from Maleficent, the three fairies lived with the princess in a cottage in the forest for 16 years.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Flora",
        "CharacterName": "Flora",
        "Description": "The fairy dressed in red. While scatterbrained at times, she acts as the leader of the tree. Flora gave the newborn Aurora the gift of beauty. To keep her safe from Maleficent, the three fairies lived with the princess in a cottage in the forest for 16 years.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Captain Gantu (V)",
        "CharacterName": "Gantu",
        "Description": "A captain in the Galactic Federation's army. He takes his responsibilities seriously, but his hotheaded attitude results in frequent failures. Now that both Experiment 626 and Dr. Jumba have escaped his custody, he is fighting just to hang on to his job.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Captain Gantu (T)",
        "CharacterName": "Gantu",
        "Description": "A captain in the Galactic Federation's army. He takes his responsibilities seriously, but his hotheaded attitude results in frequent failures.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Captain Gantu (A)",
        "CharacterName": "Gantu",
        "Description": "A captain in the Galactic Federation's army. Both Experiment 626 and Dr. Jumba Jookiba have escaped on his watch, throwing his suitability for the post into question. Unfortunately, he was so eager to look good again that he lost his temper - and as a result, his job.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "The captain of King Mickey's royal knights. He and Donald are with Yen Sid, where they anxiously wait the King's return.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "The Grand Councilwoman (T)",
        "CharacterName": "Grand Councilwoman",
        "Description": "Leader of the United Galactic Federation which oversees the universe. She rules firmly, but fairly and with an open mind.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "The Grand Councilwoman (A)",
        "CharacterName": "Grand Councilwoman",
        "Description": "Leader of the United Galactic Federation which oversees the universe. She rules firmly, but fairly and with an open mind. Repeated failures to apprehend Experiment 626 and Dr. Jumba led her to appoint Aqua to the task.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "The Grand Duke",
        "CharacterName": "Grand Duke",
        "Description": "A man who, at the king's insistence, is trying to help Prince Charming find a bride. While fiercely loyal, he tends to be a bit scatterbrained.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Grumpy (V)",
        "CharacterName": "Grumpy",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Grumpy is suspicious of everything and slow to trust anyone, and always wears a look of displeasure.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Grumpy (A)",
        "CharacterName": "Grumpy",
        "Description": "One of seven dwarfs who live with Snow White. At first, Grumpy had nothing pleasant to say about her, but her kindness warmed his heart over time. ",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Hades",
        "CharacterName": "Hades",
        "Description": "God of the Underworld. He is scheming to overthrow Zeus, ruler of Olympus, and take over the world. Hades would like nothing better than to find a powerful mortal he can fast-talk into helping him achieve his ambitions.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Happy",
        "CharacterName": "Happy",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Happy's constant smiles are a comfort to all around him.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "A boy with tremendous strength who goes by \"Herc\" for short. He was born a god, but someone kidnapped him when he was a baby, and ever since he has lived down on earth as a mortal. After learning he can rejoin the gods on Olympus if he becomes a true hero, he asked Phil to train him, and has been hard at work ever since.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Horace Horsecollar",
        "CharacterName": "Horace",
        "Description": "The fellow in charge of Fruitball. His job has gotten a lot harder since the Unversed showed up. He was a local fixture before Disney Castle was even built, and has known King Mickey and Queen Minnie for ages.",
        "AdditionalInformation": "The Plowboy (1929)"
      },
      {
        "Title": "Huey",
        "CharacterName": "Huey",
        "Description": "One of Donald's triplet nephews. He calls the shots at the ice cream shop he runs with Dewey and Louie. They're trying to save up for a big adventure. Step one: thinking up hit ice cream flavors no one's ever tasted before!",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "The Ice Colossus",
        "CharacterName": "Ice Titan",
        "Description": "A fake Ice Titan which Hades created to do battle in the Coliseum.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ienzo",
        "CharacterName": "Ienzo",
        "Description": "A young boy who speaks little - but his serene gaze suggests he sees much. Even and the others at the castle are raising him since he has lost his parents.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Isa",
        "CharacterName": "Isa",
        "Description": "A serene and self-possessed boy who always has time for a quick quip at his best friend Lea's expense.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jaq (V)",
        "CharacterName": "Jaq",
        "Description": "A personable mouse who looks after people and knows how to get things done. His friend Cinderella often saves him from the clutches of Lucifer the cat. Ventus helped Jaq make a dress for Cinderella to wear to the ball.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Jaq (A)",
        "CharacterName": "Jaq",
        "Description": "A personable mouse who looks after people and knows how to get things done. His friend Cinderella often saves him from the clutches of Lucifer the cat. His heroic efforts helped free Cinderella after Lady Tremaine locked her in the attic.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Kairi",
        "CharacterName": "Kairi",
        "Description": "A girl with the mysterious ability to drive the Unversed away. Her heart is pure light.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi's Grandma",
        "CharacterName": "Kairi's Grandma",
        "Description": "A loving grandmother. Kairi could listen to her story about the light a hundred times and never get bored.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lady Tremaine",
        "CharacterName": "Lady Tremaine",
        "Description": "Cinderella's wicked stepmother, who forces her to live in the attic and finish unreasonable amounts of chores each day. She herself lives in luxury and spoils her own daughters, Drizella and Anastasia, rotten.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Lea",
        "CharacterName": "Lea",
        "Description": "A likable, upbeat boy who tends to jump into things without consulting anybody else-sometimes with disastrous results. He seems to be hung up on other people remembering him, and taught Ventus the importance of making friends. He and his own best friend, Isa, have bigger plans.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Louie",
        "CharacterName": "Louie",
        "Description": "One of Donald's triplet nephews. He helps out in his own easygoing way at the ice cream shop. They're trying to save up for a big adventure.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Lucifer",
        "CharacterName": "Lucifer",
        "Description": "Lady Tremaine's bully of a cat. He is constantly tormenting Jaq.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Maleficent",
        "CharacterName": "Maleficent",
        "Description": "A terrifying evil fairy with a command of dark magic. She attended the celebration of Aurora's birth, despite not being invited, and prophesied that 16 years later, Aurora would prick her finger on the spindle of a spinning wheel and die. Maleficent's gleeful account of Terra's misdeeds has left Ven troubled.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "Maleficent (T)",
        "CharacterName": "Maleficent",
        "Description": "A terrifying evil fairy with a command of dark magic. She attended the celebration of Aurora's birth, despite not being invited, and prophesied that 16 years later, Aurora would prick her finger on the spindle of a spinning wheel and die. From Master Xehanort she learned about the existence of other worlds, and that she could rule them all by gathering seven hearts of pure light.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "The Masked Boy (V)",
        "CharacterName": "Vanitas",
        "Description": "A mysterious figure with ties to Master Xehanort. He warned Ventus that Terra was in some kind of danger, but disappeared before explaining any further.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Masked Boy",
        "CharacterName": "Vanitas",
        "Description": "A mysterious figure with ties to Master Xehanort.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master Eraqus (V)",
        "CharacterName": "Eraqus",
        "Description": "One of the true Keyblade Masters and also Terra, Aqua and Ventus's teacher. He has a strong aversion to darkness, and believes it the duty of every Keyblade Master to rid the world of it.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master Eraqus",
        "CharacterName": "Eraqus",
        "Description": "One of the true Keyblade Masters and also Terra, Aqua and Ventus's teacher. He has a strong aversion to darkness, and believes it the duty of every Keyblade Master to rid the world of it. Though strict on the outside, he is not unkind, and loves his pupils like his own children.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master Xehanort",
        "CharacterName": "Master Xehanort",
        "Description": "One of the true Keyblade Masters and a longtime acquaintance of Master Eraqus. He is connected with the masked boy, and harbors a hidden agenda.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master Xehanort (T)",
        "CharacterName": "Master Xehanort",
        "Description": "One of the true Keyblade Masters and a longtime acquaintance of Master Eraqus. He is connected with the masked boy, and harbors a hidden agenda. Unlike Master Eraqus, Xehanort believes darkness need not be rejected if it can be controlled.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Merlin",
        "CharacterName": "Merlin",
        "Description": "A great wizard who travels the world with a mysterious bag. He instantly recognized Ventus as a fellow \"world\" traveler, and allowed him access to a curious book.",
        "AdditionalInformation": "The Sword in the Stone (1963)"
      },
      {
        "Title": "Merlin (T)",
        "CharacterName": "Merlin",
        "Description": "A great wizard who travels the world with a mysterious bag. He is holding on to a curious book which Terra found.",
        "AdditionalInformation": "The Sword in the Stone (1963)"
      },
      {
        "Title": "Merryweather",
        "CharacterName": "Merryweather",
        "Description": "The fairy dressed in blue. She can be stubborn at times, and often bickers with Flora. Merryweather gave the newborn Aurora a ray of hope as her gift. To keep her safe from Maleficent, the three fairies lived with the princess in a cottage in the forest for 16 years.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "King Mickey",
        "CharacterName": "Mickey",
        "Description": "King of Disney Castle. He put aside his training under Yen Sid and ran off when he heard the worlds were in trouble.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "King Mickey (A)",
        "CharacterName": "Mickey",
        "Description": "King of Disney Castle. He put aside his training under Yen Sid and ran off when he heard the worlds were in trouble. So far his travels from world to world have been mostly accidental, since he cannot control the Star Shard he \"borrowed.\"",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Queen Minnie",
        "CharacterName": "Minnie",
        "Description": "Queen of Disney Castle, who reigns over the kingdom while King Mickey is away training. Right now, she is busy putting together the annual Disney Town Dream Festival, but Pete's hijinks aren't making the job any easier.",
        "AdditionalInformation": "Mickey's Surprise Party (1939)"
      },
      {
        "Title": "Monstro",
        "CharacterName": "Monstro",
        "Description": "A whale monster that lives in the star ocean.",
        "AdditionalInformation": "Pinocchio (1940)"
      },
      {
        "Title": "Mr. Smee",
        "CharacterName": "Mr. Smee",
        "Description": "A pirate in the service of Captain Hook. Blunderer and blockhead he may be, but Smee never abandons his captain.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "No Heart",
        "CharacterName": "Xehanort",
        "Description": "A suit of armor worn by one who wields a Keyblade. No one knows who's behind the mask.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Old Peddler Woman (V)",
        "CharacterName": "The Hag",
        "Description": "A mysterious old woman who dropped an apple. She claimed Terra threatened her with the Keyblade to find out about Master Xehanort - a troubling thought for Ventus.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Captain Dark",
        "CharacterName": "Captain Dark",
        "Description": "A \"secret\" identity assumed by Pete, Disney Town's biggest troublemaker. He is pretending to be a shadowy hero to garner votes and win the Million Dreams Award prize. Unfortunately, he's more shady than shadowy, and there's nothing heroic about him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Captain Justice",
        "CharacterName": "Captain Justice",
        "Description": "Pete - Disney Town's biggest trouble maker - in disguise. The truth-and-justice shtick is just a ploy to garner votes and win him the Million Dreams Award prize. Sadly, this particular \"hero\" is better known for his deeds of derring-don't.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Peter Pan (V)",
        "CharacterName": "Peter Pan",
        "Description": "A boy from Never Land, where no one ever has to grow up. Peter may hatch plans faster than he can stick to them, but he lacks nothing for courage and a sense of what's right. After trying to nab his nemesis Captain Hook's pirate treasure and coming up empty-handed, he and the Lost Boys decided to fill the chest with their own treasures instead.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Peter Pan (T)",
        "CharacterName": "Peter Pan",
        "Description": "A boy from Never Land, where no one ever has to grow up. Peter may hatch plans faster than he can stick to them, but he lacks nothing for courage and a sense of what's right. Captain Hook tricked Terra into fighting him, but the misunderstanding was soon cleared up, and Peter flew off to save Tinker Bell.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Peter Pan (A)",
        "CharacterName": "Peter Pan",
        "Description": "A boy from Never Land, where no one ever has to grow up. Peter may hatch plans faster than he can stick to them, but he lacks nothing for courage and a sense of what's right. To help Slightly and Cubby find courage, he drew a treasure map and sent them out on an \"expatition.\"",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "A renowned trainer of heroes who has whipped countless of hopefuls into shape. For a while, he had written off the whole hero business, but Hercules talked him out of retirement.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "King Mickey's trusty dog. While the King is away, Pluto helps Queen Minnie and Daisy hold down the fort. Well, at least he thinks he's helping.",
        "AdditionalInformation": "The Chain Gang (1930)"
      },
      {
        "Title": "The Prince",
        "CharacterName": "The Prince",
        "Description": "The prince of a neighboring kingdom who met Snow White one day after her beautiful singing drew him into the castle. Unable to forget her, he returned to the castle later, only to learn she had taken a bite from a poisonous apple and fallen into a deep sleep. With love's first kiss, however, he was able to wake her.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Prince Charming",
        "CharacterName": "Prince Charming",
        "Description": "The prince of this kingdom, who fell in love with a girl he met at the ball.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Prince Charming (A)",
        "CharacterName": "Prince Charming",
        "Description": "The prince of this kingdom, who fell in love with a girl he met at the ball. He was reunited with his true love when the glass slipper, his only clue to the girl's identity, fit Cinderella perfectly.",
        "AdditionalInformation": "Cinderella (1950)"
      },
      {
        "Title": "Prince Phillip",
        "CharacterName": "Prince Phillip",
        "Description": "The cheerful and likeable prince of a neighboring kingdom. He met Princess Aurora when she was still living in the forest. Maleficent imprisoned him to prevent his and Aurora's reunion, but the three good fairies rescued him. In the end, he defeated Maleficent in dragon form and, with true love's kiss, woke Aurora from her slumber.",
        "AdditionalInformation": "Sleeping Beauty (1959)"
      },
      {
        "Title": "The Queen",
        "CharacterName": "The Queen",
        "Description": "A vain woman who is convinced she is the fairest of all. When the Spirit of the Magic Mirror revealed Snow White to be fairer, the Queen decided to take the maiden's life.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "A crabby customer who just wants a quiet life. Somehow, though, the funny business always finds him, leaving his gardens in a terrible state and his precious honey pots drained to the last drop.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Riku (T)",
        "CharacterName": "Riku",
        "Description": "A little boy who yearns to see the outside world. Terra chose him to inherit the power of the Keyblade. Riku deeply cares for his friend Sora, and believes the strength he needs to protect people awaits him somewhere in the wider world.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku (A)",
        "CharacterName": "Riku",
        "Description": "A little boy who yearns to see the outside world. Aqua could sense he has acquired the power of the Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Scrooge McDuck",
        "CharacterName": "Scrooge McDuck",
        "Description": "An entrepreneur and shop owner from Disney Town. Hoping to take his already massive fortunes to cosmic levels, he moved to Radiant Garden with Merlin's help. The lifetime passes to Disney Town were a gift from Scrooge.",
        "AdditionalInformation": "Scrooge McDuck and Money (1967)"
      },
      {
        "Title": "Scrooge McDuck (A)",
        "CharacterName": "Scrooge McDuck",
        "Description": "An entrepreneur and shop owner from Disney Town. Hoping to take his already massive fortunes to cosmic levels, he moved to Radiant Garden with Merlin's help. Scrooge and Aqua got their wires crossed when she asked for help. She was looking for Terra, but he assumed she meant Ventus and sent her in the wrong direction.",
        "AdditionalInformation": "Scrooge McDuck and Money (1967)"
      },
      {
        "Title": "Sleepy",
        "CharacterName": "Sleepy",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Sleepy always looks ready to doze off.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Slightly (V)",
        "CharacterName": "Slightly",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. He and Cubby were helping Tinker Bell look for a shooting star, but Peter talked them into going after Captain Hook's treasure instead.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Slightly (T)",
        "CharacterName": "Slightly",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. He, Peter, and Cubby were hoping to swipe Captain Hook's treasure.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Slightly (A)",
        "CharacterName": "Slightly",
        "Description": "One of the Lost Boys who live in Peter Pan's hideout. Together, they went on an \"expatition\" to find the treasure marked on Peter's map.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Sneezy",
        "CharacterName": "Sneezy",
        "Description": "One of seven dwarfs who live in a cottage deep in the woods. Sneezy... Well, he sneezes a lot.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Snow White (V)",
        "CharacterName": "Snow White",
        "Description": "A lovely young maiden with a kind heart. So beautiful was Snow White that the Queen grew jealous and sought to end her life. Snow White was spared, however, and began living in a cottage deep in the woods with seven dwarfs she met.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Snow White (T)",
        "CharacterName": "Snow White",
        "Description": "A lovely young maiden with a kind heart. So beautiful was Snow White that the Queen grew jealous and sought to end her life. When brought together, seven hearts of pure light like Snow White's are the key to ruling all worlds.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Snow White (A)",
        "CharacterName": "Snow White",
        "Description": "A lovely young maiden with a kind heart. So beautiful was Snow White that the Queen grew jealous and gave her a poisoned apple. Snow White fell into a deep sleep, but was woken by a kiss from her beloved Prince.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Sora",
        "CharacterName": "Sora",
        "Description": "A cheerful, energetic little boy. He and his friend Riku always play together out on the island.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Spirit of the Magic Mirror",
        "CharacterName": "Magic Mirror",
        "Description": "A spirit who appears within the magic mirror at the queen's behest and answers all questions with the truth.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Terra",
        "CharacterName": "Terra",
        "Description": "A young man in training to become a Keyblade Master. He and his fellow pupils Aqua and Ventus share a healthy rivalry and strong bond of friendship.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Terra (T)",
        "CharacterName": "Terra",
        "Description": "A young man in training to become a Keyblade Master. He and his fellow pupils Aqua and Ventus share a healthy rivalry and strong bond of friendship. Though he is aware of the darkness in his heart, Terra refuses to accept it - and Master Xehanort's suggestions that it might be controlled have only deepened his quandary.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tigger",
        "CharacterName": "Tigger",
        "Description": "A friend of Pooh's who loves bouncing more than anything else. Unfortunately, his bouncing sometimes causes headaches for everybody else.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Tinker Bell (V)",
        "CharacterName": "Tinker Bell",
        "Description": "A pixie who lives in Never Land. Ventus kept her company after she and Peter Pan had a fight, but then Captain Hook kidnapped her. ",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Tinker Bell (T)",
        "CharacterName": "Tinker Bell",
        "Description": "A pixie who lives in Never Land. Terra saved her from the clutches of Captain Hook.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Tinker Bell (A)",
        "CharacterName": "Tinker Bell",
        "Description": "A pixie who lives in Never Land. She gets very jealous when other girls are around Peter Pan.",
        "AdditionalInformation": "Peter Pan (1953)"
      },
      {
        "Title": "Vanitas (V)",
        "CharacterName": "Vanitas",
        "Description": "A mysterious boy who hides his face behind a mask. He has ties to Master Xehanort. Vanitas warned Ventus that Terra was in some kind of danger, but disappeared before explaining any further.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vanitas",
        "CharacterName": "Vanitas",
        "Description": "A mysterious boy who hides his face behind a mask. He has ties to Master Xehanort.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vanitas Remnant",
        "CharacterName": "Vanitas Remnant",
        "Description": "A physical manifestation of what remained of Vanitas's powerful thoughts and feelings.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ventus (V)",
        "CharacterName": "Ventus",
        "Description": "One of Master Eraqus's pupils. He usually goes by \"Ven\" for short. He and Terra and Aqua train together, sharing both a healthy rivalry and a strong bond of friendship. Haunted by the masked boy's warnings about Terra, Ven defied Master Eraqus, ran away from home, and set off for the outside world to find his friend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ventus",
        "CharacterName": "Ventus",
        "Description": "One of Master Eraqus's pupils. He usually goes by \"Ven\" for short. He and Terra and Aqua train together, sharing both a healthy rivalry and a strong bond of friendship. Since Ventus is younger, Terra and Aqua tend to be very protective of him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A bear who lives in the Hundred-Acre Wood. Easygoing he may be, but when it comes to honey - his favorite - he tends to get just a little carried away.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "The Witch",
        "CharacterName": "The Hag",
        "Description": "A form the Queen assumed by drinking a potion. Jealous of Snow White's beauty, she wished to deceive the maiden into eating a poisonous apple. She succeeded in putting Snow White into a deep sleep, but the dwarfs chased her down, and she was never seen again.",
        "AdditionalInformation": "Snow White and the Seven Dwarfs (1937)"
      },
      {
        "Title": "Yen Sid (V)",
        "CharacterName": "Yen Sid",
        "Description": "A great sorcerer who dwells within the Mysterious Tower. Mickey is his apprentice. Yen Sid was the first to detect something amiss with the worlds, and alerted Master Eraqus as soon as he could. He is concerned about his apprentice, Mickey, who has run off.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Yen Sid (T)",
        "CharacterName": "Yen Sid",
        "Description": "A great sorcerer who dwells within the Mysterious Tower. Mickey is his apprentice. Yen Sid was the first to detect something amiss with the worlds, and alerted Master Eraqus as soon as he could.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Yen Sid (A)",
        "CharacterName": "Yen Sid",
        "Description": "A great sorcerer who dwells within the Mysterious Tower. Mickey is his apprentice. Yen Sid was the first to detect something amiss with the worlds, and alerted Master Eraqus as soon as he could. It was also he who delivered to Aqua the news of Master Eraqus's demise at the hands of Terra and Master Xehanort.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Unknown",
        "CharacterName": "Unknown",
        "Description": "A mysterious figure whose origins, identity, and purpose are unclear.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Zack (V)",
        "CharacterName": "Zack",
        "Description": "A boy who longs to become a hero. He heard that Phil specialized in training heroes, and competed to become his next student, but Hercules ended up edging him out. Nothing fazes Zack, who smiles his way through the worst of troubles.",
        "AdditionalInformation": "Crisis Core - Final Fantasy VII -"
      },
      {
        "Title": "Zack (T)",
        "CharacterName": "Zack",
        "Description": "A boy who longs to become a hero. Hades manipulated him and turned him into a warrior of darkness, but Zack's heart was freed when Terra defeated him.",
        "AdditionalInformation": "Crisis Core - Final Fantasy VII -"
      },
      {
        "Title": "Zack (A)",
        "CharacterName": "Zack",
        "Description": "A boy who longs to become a hero. Hades manipulated him and turned him into a warrior of darkness, but Zack's heart was freed when Terra defeated him. Now, he looks up to Terra as a hero.",
        "AdditionalInformation": "Crisis Core - Final Fantasy VII -"
      }
    ],
    "Kingdom Hearts Re:Coded": [
      {
        "Title": "Aladdin",
        "CharacterName": "Aladdin",
        "Description": "A young man who lives in the desert city of Agrabah and dreams of the day he can be with Princess Jasmine. But Aladdin proved to be an obstacle to Jafar's evil plans, and was banished to the desert. There, through a truly wild stroke of luck, he happened upon the Cave of Wonders, obtained the magic lamp, and became the Genie's new master.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Alice",
        "CharacterName": "Alice",
        "Description": "A girl who wandered into Wonderland quite by accident. Perhaps her curiosity was to blame, but then how can one not admire Alice's unyielding spirit when faced with such overwhelming oddness? The bugs in the datascape scrambled her memory and left her scratching her head, but in the end, she and Sora managed to set everything right.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Card Soldier",
        "CharacterName": "Card Soldier(s)",
        "Description": "Soldiers in the service of Wonderland's ruler, the Queen of Hearts. Seeing as they are quite fond of keeping their heads attached to their shoulders, they make a point not to defy her.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cerberus",
        "CharacterName": "Cerberus",
        "Description": "The ultimate guard dog: enormous, three-headed, armed to the teeth (with teeth), and loyal to its master, Hades. Be ready to block quickly and often if you don't want this Stygian pooch to turn you into dental floss.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Cheshire Cat",
        "CharacterName": "Cheshire Cat",
        "Description": "A strange feline from Wonderland whose unnerving grin and absurd interjections leave even the best conversationalist struggling to keep up. As if that weren't maddening enough, the Cheshire Cat tends to vanish into thin air almost as suddenly as he pops out of it.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Chip",
        "CharacterName": "Chip",
        "Description": "One of the engineers working at Disney Castle. Dale is his little brother. On Sora's previous journeys, they were in charge of the Gummi Ship, a flying machine which allowed Sora and friends to freely travel between worlds. He and Dale look a lot alike, but you can tell the pair apart by their nose colors and the shape of their front teeth.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cid",
        "CharacterName": "Cid",
        "Description": "A man with a gift for technology who's as good a pilot as he is an engineer. Once, Cid called another world home. Just before that world was lost to darkness, he gathered up what children he could save, and together, they fled to Traverse Town.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cloud",
        "CharacterName": "Cloud",
        "Description": "A buster sword-wielding soldier whose past failures continue to weigh on him. Believing himself weak, Cloud sought out the secrets of a hero's strength, as well as the secrets darkness might hold. Hades tried to use these desires against him, but once Cloud realized he was being manipulated, he wisely joined forces with Sora and Hercules.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dale",
        "CharacterName": "Dale",
        "Description": "One of the engineers working at Disney castle. Chip is his older brother. They are superb technicians, and now they have put on their system admin hats to digitize the journal and find out what's happening inside. He and Chip are sometimes hard to tell apart, but their nose colors and the shape of their front teeth are a dead giveaway.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Data-Riku",
        "CharacterName": "Data-Riku",
        "Description": "An entity that looks just like Sora's friend Riku. He is, however, not the real deal. Data-Riku was chosen as a sort of ark to keep all the collective data within Jiminy's journal safe from bugs; in a way, he IS the journal now. But even he could not explain the cause of the bugs, so, after adopting Riku's appearance, he \"imported\" Mickey and friends to help solve the mystery.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Data-Roxas",
        "CharacterName": "Data-Roxas",
        "Description": "A boy who used cards to guide Sora in the datascape version of Castle Oblivion. While he bears an uncanny resemblance to another boy deeply connected to Sora, it is more than coat and hood that prevent Sora from seeing. Was this boy just a phantom, a glitch? Or does this data tie into hurtful memories that sleep within Sora's heart?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dewey",
        "CharacterName": "Dewey",
        "Description": "One of Donald's three nephews. Can't pick Dewey out of the crowd? He's the one in the blue clothes. Dewey is the brains of the bunch, so even though he doesn't always mind Cid, he knows an opportunity to learn when he sees one.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald",
        "Description": "A magician in the service of King Mickey. While full of vim and vigor, his short temper sometimes gets him into hot water. Donald met the real Sora while on a journey to find Mickey; during the course of their travels they became fast friends. After reuniting with Mickey and fighting off the hordes of darkness, Donald returned to Disney Castle to enjoy a bit of peace.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dragon Maleficent",
        "CharacterName": "Dragon Maleficent",
        "Description": "Maleficent's dragon form, a staggering demonstration of the powers of evil. Sora had to face this mighty adversary while trying to save Data-Riku from the bugs corrupting him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Genie",
        "CharacterName": "Genie",
        "Description": "A bubbly, blue, boisterous character who lives inside the magic lamp. He has great power and will grant just three wishes to each of his masters. But not all masters have good intentions, and as for Genie's own wish - well, those he cannot make come true. In the datascape, Genie met Aladdin after the boy was banished to the desert by Jafar, and they became fast friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "The laid-back captain of King Mickey's royal knights. While a bit of a softy, Goofy lacks nothing for courage. He and Donald met the real Sora after leaving Disney Castle to search for Mickey, who had gone missing. Together, they overcame countless dangers and forged a one-of-a-kind friendship.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades",
        "CharacterName": "Hades",
        "Description": "The God of the Underworld, a former (and still aspiring!) world conqueror who would like nothing more than to see Hercules wiped off the face of the planet. With the Coliseum a tangle of bugs and Cloud a tangle of emotional issues, he ought to have found a way, but Sora showed up just in time to show HIM up, and prove once again that sliminess doesn't pay.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "A hero whose kind heart and bursting-at-the-seams biceps have won him the admiration of the Olympus Coliseum crowds. Despite being the son of a god, he lives down on earth as a mortal. Hercules was already inside the Coliseum investigating when Sora showed up. Later, the two joined forces and, together, got to the bottom of the bugs.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Huey",
        "CharacterName": "Huey",
        "Description": "One of Donald's three nephews. Can't tell Huey apart from the others? Just look for the red clothes. He thinks it's his job to keep Dewey and Louie in line, but in Traverse Town, it's really Cid who looks after all three of them.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Iago",
        "CharacterName": "Iago",
        "Description": "Jafar's henchman, a cunning parrot who doesn't know when to shut up. With Jafar plotting to take over Agrabah, Iago must have been busy flying around the city and making trouble.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar",
        "CharacterName": "Jafar",
        "Description": "A wizard who served as royal vizier in Agrabah's palace. The bugs plaguing the datascape version of Agrabah provided Jafar with just the tool he needed to seize the throne: a fake lamp Pete created from data. Later, Jafar used the real lamp, stolen from Aladdin, to become an all-powerful genie. In the end, though, he was imprisoned within yet another lamp: his own.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Genie Jafar",
        "CharacterName": "Genie Jafar",
        "Description": "Jafar, after using Pete's fake lamp to transform. The beams he shoots will afflict you with Slow, but you can turn the tables; block the beams and bounce them toward Iago to slow the bird down and create an opportunity to strike.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jasmine",
        "CharacterName": "Jasmine",
        "Description": "A young woman from the desert city of Agrabah who just happens to be its princess. Stifled by palace life, she was drawn toward the freedom of the streets and a young man named Aladdin. Jafar, newly empowered by the bugs, had designs on Jasmine, but Sora saved her from her plight.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "The cricket in charge of jotting down everything that goes on in Disney Castle. He also joined Sora on his adventures and kept a record of them in two journals. One of those books was almost completely erased (it's a long story). And when a mysterious message appeared in that same book, out of nowhere... Well, that's how this latest adventure began.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi",
        "CharacterName": "Kairi",
        "Description": "A girl born in Radiant Garden. Life carried her to the Destiny Islands, where she met Sora and Riku. Kairi is a princess of heart, and the forces of darkness tried to bend the pure light within her to sinister purposes; for a long time, she and Sora and Riku were separated. After a long journey, though, they were brought back together, their lives at last normal again.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Leon",
        "CharacterName": "Leon",
        "Description": "A swordsman from Radiant Garden. When he was still a boy, his home was lost to darkness, and he was forced to flee with Cid and the other children to Traverse Town. He no longer uses his real name, a symbolic farewell to the little boy who was not strong enough. Later, Leon would fight against the forces of darkness more than once, but thanks to Sora, he can now focus on rebuilding his home.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Louie",
        "CharacterName": "Louie",
        "Description": "One of Donald's three nephews. Not sure which one is Louie? Keep an eye out for the green clothes. Louie is the most laid back of the three - but if you ask Cid, who looks after them, that's not saying much.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent",
        "CharacterName": "Maleficent",
        "Description": "A terrifying evil fairy who commands dark magic. On one of Sora's previous adventures, Maleficent led the hordes of darkness in an attempt to conquer all worlds. It was her servant, Pete, who led her to this strange new world; while unaware of its true nature, she can see the potential it holds for steeping other worlds in darkness.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Mickey Mouse",
        "CharacterName": "Mickey",
        "Description": "The king of Disney Castle. Just like Sora, he wields a Keyblade. In the past, he traveled from world to world to watch over Sora, Donald, and the others, and guide them in their journey to save all worlds from the forces of darkness. Once the crisis was averted, Mickey returned to Disney Castle to live a peaceful life with his friends there.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé",
        "CharacterName": "Naminé",
        "Description": "A special Nobody whose counterpart is Kairi. Organization XIII exploited Naminé's unique powers to alter Sora's memory, but his true heart moved her to betray them. For Sora's memory to be repaired, he had to enter a long sleep. During this time, Naminé found hurtful memories hiding deep in his heart. Hoping their story might come to light, she added a message to Jiminy's journal.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pete",
        "CharacterName": "Pete",
        "Description": "A troublemaker who once lived in the same world as King Mickey, Donald, and friends. But after mouthing off and getting temporarily banished, Pete was approached by Maleficent and became her loyal servant. The datascape isn't the first place he has meddled with, but now that he's wandered in, he is hoping this will be his ticket to ruling a world or two.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "A world-renowned trainer who runs the show in Olympus Coliseum. He's trained a whole slew of heroes in his time (\"a lot of yusses\") with Hercules being his most recent protégé. After the bugs transformed the Coliseum into a strange labyrinth, Phil had to turn to Sora for help sorting the mess out.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Queen of Hearts",
        "CharacterName": "Queen of Hearts",
        "Description": "The ungenerous ruler of Wonderland who has a whole army of card soldiers at her command. Rub her the wrong way, and it is off with your head. If you're lucky, you might be granted a trial (preferably beforehand). After the bugs caused her memory to fail her, the Queen quickly decided Sora and Alice were to blame.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku",
        "CharacterName": "Riku",
        "Description": "Sora's best friend. They grew up together on the Destiny Islands. But Riku was so desperate to leave their small, stifling home that he succumbed to the darkness. Eventually, he and Sora clashed. Fortunately, he met Mickey. With his new friend's help, Riku learned to turn his wrongs into rights, and eventually became one of Sora's greatest, unseen allies.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Selphie",
        "CharacterName": "Selphie",
        "Description": "A girl from the Destiny Islands, and a friend of Sora's. Selphie isn't one to sit still; usually she's hanging out with Sora and Wakka and the other island boys. She might look like Ms. Independent and rely a bit too heavily on her fists, but don't be fooled; what you've got here is a classic closet romantic.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora",
        "CharacterName": "Sora",
        "Description": "A boy chosen by a strange sword called a \"Keyblade\". After his island home was lost to the darkness, he joined forces with Donald, Goofy, and Mickey and saved all worlds. All these adventures were carefully recorded in Jiminy's Journals. Inside the datascape generated within the computer, a digital version of the real Sora (Data-Sora) quests in our hero's stead.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tidus",
        "CharacterName": "Tidus",
        "Description": "A confident, athletic boy who lives on the Destiny Islands like Sora. He's almost always in good spirits; trying to bring Tidus down is like trying to fall up.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wakka",
        "CharacterName": "Wakka",
        "Description": "A boy from the Destiny Islands, just like Sora. He's the oldest kid in the bunch, but doesn't throw his weight around; when his bruddas (or sista) need something, he's there to make sure they're taken care of.",
        "AdditionalInformation": ""
      },
      {
        "Title": "White Rabbit",
        "CharacterName": "White Rabbit",
        "Description": "A retainer in the service of Wonderland's ruler, the Queen of Hearts. The bugs in the datascape messed with the White Rabbit's memories but, lucky for him, he at least had the good sense to remember the Queen was no one to trifle with.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yuffie",
        "CharacterName": "Yuffie",
        "Description": "A ninja girl who hails from Radiant Garden. Her home was beset by darkness when she was still very little, and she had to flee with Cid to Traverse Town. But someone as cheerful as Yuffie would never let this show. After meeting Sora in Traverse Town, she fought bravely alongside him against the darkness, and now she is back in Radiant Garden, hard at work rebuilding.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts Dream Drop Distance": [
      {
        "Title": "Aeleus",
        "CharacterName": "Aeleus",
        "Description": "The human form of Lexaeus, one of Organization XIII's Nobodies. At one time, he was one of Ansem the Wise's apprentices and helped guard the castle. He has awoken in Radiant Garden.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Robed Figure",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "A mysterious man whose identity is masked by a brown robe. Sora encountered him in the Destiny Islands right before his first journey began. Riku has seen him as well, though neither of them ever found out for certain who he was.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "He tried to open the door to Kingdom Hearts, but fell to Sora in the end. Once again, Riku finds himself face-to-face with his nemesis.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Anti Black Coat",
        "CharacterName": "Anti Black Coat",
        "Description": "A mysterious menace clad in a black coat. He can teleport and attack from all ranges to get the drop on you. Don't be too tenacious: just look for an opening and strike when you can.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Aqua",
        "CharacterName": "Aqua",
        "Description": "One of three Keyblade wielders who played a pivotal role in a historic clash more than a dozen years ago. To save a friend, she cast herself into the realm of darkness, never to be seen again.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Armored Ventus Nightmare",
        "CharacterName": "Armored Ventus Nightmare",
        "Description": "The armored form of someone who wished to protect Sora as darkness closed in. But the armor itself was also mantled in darkness, and posed a serious threat to Riku.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Axel",
        "CharacterName": "Axel",
        "Description": "One of Organization XIII's more unique personalities. He was especially close to Roxas, another of their members. Axel expired while fighting to save Sora—or perhaps someone else.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Beagle Boys",
        "CharacterName": "Beagle Boys",
        "Description": "Three rascals who work for Captain Pete. Unfortunately for their boss, they botch one job after another.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Beat",
        "CharacterName": "Beat",
        "Description": "A boy who has been forced into the Reapers' Game. You won't meet a sweeter guy than Beat, and he seems desperate to keep people from finding out. He picked a fight with Joshua to protect his Game partner.",
        "AdditionalInformation": "The World Ends With You\" (2008)"
      },
      {
        "Title": "Black Guard",
        "CharacterName": "Black Guard(s)",
        "Description": "Programs that have been repurposed to protect CLU.",
        "AdditionalInformation": "\"Tron: Legacy\" (2010)"
      },
      {
        "Title": "Blue Fairy",
        "CharacterName": "Blue Fairy",
        "Description": "The fairy who gave life to Pinocchio and appointed Jiminy his conscience.",
        "AdditionalInformation": "\"Pinocchio\" (1940)"
      },
      {
        "Title": "Braig",
        "CharacterName": "Braig",
        "Description": "The human form of Xigbar, one of Organization XIII's members. He became a Nobody during a certain experiment.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Chernabog",
        "CharacterName": "Chernabog",
        "Description": "A giant demon that emerged from the depths of the earth in a fiery eruption.",
        "AdditionalInformation": "\"Night on Bald Mountain\" (1940)"
      },
      {
        "Title": "Claude Frollo",
        "CharacterName": "Frollo",
        "Description": "A wicked man charged with keeping order in the city. He had no choice but to take Quasimodo in as an infant, but kept him locked in the cathedral bell tower. Frollo hates the very sight of gypsies, whom he believes are the root of all evil in the city.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "CLU",
        "CharacterName": "CLU",
        "Description": "A program Flynn made to look just like him. His original purpose was to help expand the Grid, but the emergence of the ISOs provoked him to usurp control.",
        "AdditionalInformation": "\"Tron: Legacy\" (2010)"
      },
      {
        "Title": "Dilan",
        "CharacterName": "Dilan",
        "Description": "The human form of Xaldin, one of Organization XIII's Nobodies. In an earlier time, he was one of Ansem the Wise's apprentices and helped guard the castle. He has awoken in Radiant Garden, but his condition remains unstable.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald",
        "Description": "King Mickey's court magician and a loyal friend. Donald has journeyed with Sora many times to save the worlds. He is with the king and Goofy, keeping an eye on Sora and Riku as they take the Mark of Mastery exam.",
        "AdditionalInformation": "\"The Wise Little Hen\" (1934)"
      },
      {
        "Title": "Musketeer Donald",
        "CharacterName": "Donald",
        "Description": "An overnight Musketeer and good friends with Mickey and Goofy. Donald was a chicken, but his adventures with Mickey and the others gave him the courage to become a Musketeer in heart and in name.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Enchanted Brooms",
        "CharacterName": "Enchanted Broom(s)",
        "Description": "Brooms brought to life by magic. Mickey created them to fetch water so he wouldn't have to.",
        "AdditionalInformation": "\"The Sorcerer's Apprentice\" (1940)"
      },
      {
        "Title": "Esmeralda",
        "CharacterName": "Esmeralda",
        "Description": "A gypsy woman who loves freedom. She was pursued relentlessly by Frollo, but Quasimodo saved her from the fires.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Even",
        "CharacterName": "Even",
        "Description": "The human form of Vexen, one of Organization XIII's Nobodies. In his previous life, he was one of Ansem the Wise's apprentices and researched the mysteries of the heart. He has awoken in Radiant Garden, but his condition remains unstable.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Geppetto",
        "CharacterName": "Geppetto",
        "Description": "Pinocchio's father. He went out to sea to find his son but was swallowed, boat and all, by Monstro the whale. Inside Monstro he was reunited with Pinocchio, and they all made it out safely.",
        "AdditionalInformation": "\"Pinocchio\" (1940)"
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "The captain of King Mickey's royal knights and also his good friend. Goofy has stuck by Sora's side through more than one adventure. Right now he, the king, and Donald are keeping an eye on Sora and Riku as they take the Mark of Mastery exam.",
        "AdditionalInformation": "\"Two Weeks Vacation\" (1952)"
      },
      {
        "Title": "Musketeer Goofy",
        "CharacterName": "Goofy",
        "Description": "An overnight Musketeer and good friends with Mickey and Donald. Goofy may not always be on the ball, but he grew alongside Mickey and the others and earned his Musketeer status.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Hugo",
        "CharacterName": "Hugo",
        "Description": "One of three cathedral gargoyles who can only be heard by Quasimodo, Sora and Riku. Hugo is the wise guy of the bunch, and quick to pick a fight.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Ienzo",
        "CharacterName": "Ienzo",
        "Description": "The human form of Zexion, one of Organization XIII's Nobodies. He used to be one of Ansem the Wise's apprentices and researched the mysteries of the heart. He has awoken in Radiant Garden.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "A faithful friend whom the Blue Fairy has appointed Pinocchio's conscience.",
        "AdditionalInformation": "\"Pinocchio\" (1940)"
      },
      {
        "Title": "Joshua",
        "CharacterName": "Joshua",
        "Description": "A boy who watches over the Players in the Game. He summoned Traverse Town to save Neku and the others before their existences could blink out.",
        "AdditionalInformation": "\"The World Ends With You\" (2008)"
      },
      {
        "Title": "Kevin Flynn",
        "CharacterName": "Kevin Flynn",
        "Description": "Sam's father, Kevin Flynn. Twenty years ago he was trapped inside the Grid. His disc is the key to reopening the Portal back to the real world.",
        "AdditionalInformation": "\"Tron\" (1982)"
      },
      {
        "Title": "Laverne",
        "CharacterName": "Laverne",
        "Description": "One of three cathedral gargoyles who can only be heard by Quasimodo, Sora and Riku. Laverne just wants Quasimodo to be safe and happy.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Lea",
        "CharacterName": "Lea",
        "Description": "The human form of Axel, one of Organization XIII's Nobodies. He has awoken in Radiant Garden.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent",
        "CharacterName": "Maleficent",
        "Description": "An evil fairy who wishes to see all worlds cast into darkness. She has clashed with more than one Keyblade wielder. This time, she tried to use Minnie as a bartering chip and claim the \"data\" of all worlds.",
        "AdditionalInformation": "\"Sleeping Beauty\" (1959)"
      },
      {
        "Title": "Maleficent's Raven",
        "CharacterName": "Diablo",
        "Description": "Maleficent's servant, who brought King Mickey a letter at its mistress's behest.",
        "AdditionalInformation": "\"Sleeping Beauty\" (1959)"
      },
      {
        "Title": "Master Xehanort",
        "CharacterName": "Master Xehanort",
        "Description": "A former Keyblade Master whose obsession with the Keyblade War led him to give his heart over to darkness. He tried to forge the χ-blade and trigger another Keyblade War, but three young Keyblade wielders put a stop to him. Now, he has revealed his ultimate goal: to create the real Organization XIII and infuse his heart into all its members.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Minnie Mouse",
        "CharacterName": "Minnie",
        "Description": "The queen of Disney Castle. Maleficent and Pete nabbed her while King Mickey was away.",
        "AdditionalInformation": "\"Mickey's Surprise Party\" (1939)"
      },
      {
        "Title": "Naminé",
        "CharacterName": "Naminé",
        "Description": "Kairi's Nobody. Organization XIII used her special powers to manipulate Sora's memories, but in the end, Sora saved her. She ceased to exist after reuniting with Kairi.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Neku",
        "CharacterName": "Neku",
        "Description": "A boy who has been forced into the Reapers' Game. He wouldn't be caught dead without his headphones... and wants nothing more than to shut other people out. But Sora, and his other new friends, may have the power to change him.",
        "AdditionalInformation": "\"The World Ends With You\" (2008)"
      },
      {
        "Title": "Peg Leg Pete",
        "CharacterName": "Pete",
        "Description": "Captain of the Musketeers. He was after the crown and kidnapped Princess Minnie to get it, but Mickey and the Musketeers put a stop to his schemes.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Pete",
        "CharacterName": "Pete",
        "Description": "An incorrigible troublemaker who was plucked out of his \"time out\" in Disney Town by none other than Maleficent. He has been her somewhat-sidekick ever since.",
        "AdditionalInformation": "\"Steamboat Willie\" (1928)"
      },
      {
        "Title": "Phoebus",
        "CharacterName": "Phoebus",
        "Description": "Captain of the guard. After meeting Quasimodo and Esmerelda, he began to question and then challenge Judge Frollo's methods.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Pinocchio",
        "CharacterName": "Pinocchio",
        "Description": "A wooden puppet Geppetto made. The Blue Fairy breathed life into him and appointed Jiminy his conscience. Pinocchio's nose grows every time he lies. But he is trying to be good so he can become a real boy.",
        "AdditionalInformation": "\"Pinocchio\" (1940)"
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "Mickey's canine companion, a faithful friend who gives his master courage and cheers him up in hard times.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Princess Minnie",
        "CharacterName": "Minnie",
        "Description": "Princess of this kingdom. After someone tried to do her harm, she demanded protection from the Musketeers and fell hopelessly in love with Mickey, one of the three who took the job.",
        "AdditionalInformation": "\"Mickey, Donald, Goofy: The Three Musketeers\" (2004)"
      },
      {
        "Title": "Quasimodo",
        "CharacterName": "Quasimodo",
        "Description": "A young man who lives in the bell tower of Notre Dame Cathedral. His master, Judge Frollo, has forbidden him from setting foot outside, but a woman named Esmerelda changed him and gave him the strength to see what's out there.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Quorra",
        "CharacterName": "Quorra",
        "Description": "The last of the ISOs, a new life form that manifested in the digital realm. She has always stuck by Flynn.",
        "AdditionalInformation": "\"Tron: Legacy\" (2010)"
      },
      {
        "Title": "Rhyme",
        "CharacterName": "Rhyme",
        "Description": "A girl who has been forced into the Reapers' Game. She has lost her memory but doesn't seem too worked up about it. She serves as Joshua's \"Portal.\"",
        "AdditionalInformation": "\"The World Ends With You\" (2008)"
      },
      {
        "Title": "Riku",
        "CharacterName": "Riku",
        "Description": "A boy who wields a Keyblade. His battles to save the worlds have often pitted him against the darkness in his own heart. Now, he is braving the Mark of Mastery examination to find out if he is still worthy of the Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Rinzler",
        "CharacterName": "Rinzler",
        "Description": "A hostile program formerly known as Tron. CLU wiped Tron's memory when he changed his code.",
        "AdditionalInformation": "\"Tron: Legacy\" (2010)"
      },
      {
        "Title": "Roxas",
        "CharacterName": "Roxas",
        "Description": "One of Organization XIII's members, and also Sora's Nobody. He was especially close to Axel, another of their members. Roxas ceased to exist after reuniting with Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx",
        "CharacterName": "Saïx",
        "Description": "One of Organization XIII's members. He expired after an epic clash with Sora. In his human years, he was named Isa and was Lea's close friend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sam Flynn",
        "CharacterName": "Sam Flynn",
        "Description": "Kevin Flynn's son. A message, supposedly from his father, led him into the Grid, where the two were reunited for the first time in twenty years.",
        "AdditionalInformation": "\"Tron: Legacy\" (2010)"
      },
      {
        "Title": "Shiki",
        "CharacterName": "Shiki",
        "Description": "A girl who has been forced into the Reapers' Game. Her constant companion is a stuffed animal named Mr. Mew. A stranger in a black coat tricked her into leading Riku into a trap.",
        "AdditionalInformation": "\"The World Ends With You\" (2008)"
      },
      {
        "Title": "Sora",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. He has used its power to save the worlds from crisis more than once. Now, he has agreed to take the Mark of Mastery examination in order to retrieve a new power.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Terra",
        "CharacterName": "Terra",
        "Description": "One of three Keyblade wielders who played a pivotal role in a historic clash more than a dozen years ago. Master Xehanort possessed his body, and although Aqua saved him, his heart may never find its way back where it belongs.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ventus",
        "CharacterName": "Ventus",
        "Description": "One of three Keyblade wielders who played a pivotal role in a historic clash more than a dozen years ago. His heart is sleeping, and he has been laid to rest in a secret chamber of a certain castle until someone can wake him up.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Victor",
        "CharacterName": "Victor",
        "Description": "One of three cathedral gargoyles who can only be heard by Quasimodo, Sora and Riku. Victor is the deep thinker of the bunch, and doesn't know what to do with Hugo.",
        "AdditionalInformation": "\"The Hunchback of Notre Dame\" (1996)"
      },
      {
        "Title": "Xemnas",
        "CharacterName": "Xemnas",
        "Description": "Xehanort's Nobody, who was once leader of Organization XIII. He tried to create Kingdom Hearts from the hearts of people, but Sora put an end to his plans and the man himself. So why is Sora seeing him now?",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar",
        "CharacterName": "Xigbar",
        "Description": "One of Organization XIII's members. As Number II, he has Xehanort's trust above all others. His job this time has been to vex Sora and lead him further into the abyss of sleep.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xion",
        "CharacterName": "Xion",
        "Description": "Organization XIII's mysterious fourteenth member. She was an experimental replica used to \"catch\" Roxas's memories and create a Keyblade wielder for the Organization. In the end, she was erased from existence and returned to Sora where she belonged.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yen Sid",
        "CharacterName": "Yen Sid",
        "Description": "A great sorcerer who watches over the balance between light and darkness. He was also King Mickey's teacher. With a new threat looming ever closer, he has decided Sora and Riku must be examined for the Mark of Mastery.",
        "AdditionalInformation": "\"The Sorcerer's Apprentice\" (1940)"
      },
      {
        "Title": "Young Xehanort",
        "CharacterName": "Young Xehanort",
        "Description": "Xehanort in his early years. He has traveled through time to guide Sora toward a ghastly fate.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts χ Back Cover": [
      {
        "Title": "Aced",
        "CharacterName": "Aced",
        "Description": "One of the Master's disciples who receives a copy of the Book of Prophecies. He is a fearless Keyblade Master and leader of the Union Ursus. Though he tends to rely on his physical prowess, he has a pure heart and strong sense of justice. His role is to support their new leader, Ira.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ava",
        "CharacterName": "Ava",
        "Description": "One of the Master's disciples who receives a copy of the Book of Prophecies. Despite being a Keyblade Master, she is often treated as a friend by other wielders due to her age. She is the leader of the Union Vulpes. Her role is to find exceptional Keyblade wielders regardless of Union and create her own organization.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Chirithy",
        "CharacterName": "Chirithy",
        "Description": "Created by the Master to serve the Keyblade wielders. They originally exist as helpful Spirits. If their wielder becomes lost to darkness, however, they turn black and become Nightmares.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ephemer",
        "CharacterName": "Ephemer",
        "Description": "A young and outgoing Keyblade wielder. He questions the way the world works and decides to solve its mysteries on his own.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Gula",
        "CharacterName": "Gula",
        "Description": "One of the Master's disciples who receives a copy of the Book of Prophecies. He is a coolheaded Keyblade Master and leader of the Union Leopardus. He prefers to keep his distance from the others and doesn't regard them as comrades. His role is to solve the mysteries of the Book of Prophecies.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Invi",
        "CharacterName": "Invi",
        "Description": "One of the Master's disciples who receives a copy of the Book of Prophecies. She is a virtuous Keyblade Master and leader of the Union Anguis. She holds the Master in high esteem. Her role is to watch over the others with a fair eye.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ira",
        "CharacterName": "Ira",
        "Description": "One of the Master's disciples who receives a copy of the Book of Prophecies. He is a reliable Keyblade Master and leader of the Union Unicornis. The Master often makes fun of his serious nature. His role is to become the new leader of the foretellers after the Master vanishes.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Luxu",
        "CharacterName": "Luxu",
        "Description": "The only one of the Master's disciples who does not receive a copy of the Book of Prophecies. He is bestowed with a Keyblade and a black box before setting out on his journey.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master of Masters",
        "CharacterName": "Master of Masters",
        "Description": "A mysterious man who possesses an eye that can see into the future. He uses that knowledge to write the Book of Prophecies. No one knows whether his mischievous nature is calculated or true. He disappears after bestowing five of his six apprentices with a copy of the Book.",
        "AdditionalInformation": ""
      }
    ],
    "Kingdom Hearts III": [
      {
        "Title": "Aeleus",
        "CharacterName": "Aeleus",
        "Description": "The human form of Lexaeus, one of Organization XIII's Nobodies. Before joining the Organization, he was one of Ansem the Wise's apprentices and guarded the castle together with Dilan.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Aced",
        "CharacterName": "Aced",
        "Description": "One of the ancient Keyblade Masters. A stalwart young man who dons a white robe and a bear mask.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Anna",
        "CharacterName": "Anna",
        "Description": "Elsa's younger sister. A random encounter brought her and Kristoff together, and together they pledged to end the unnatural winter plaguing Arendelle.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Ansem",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "A member of the real Organization XIII. This is Xehanort's Heartless. He was able to regain his original appearance by possessing Riku. In the past, Ansem attempted to open the door to Kingdom Hearts, but was destroyed by Sora and friends before he could succeed. Despite this, Ansem has returned.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem the Wise",
        "CharacterName": "Ansem the Wise",
        "Description": "The sage king who once ruled over Radiant Garden. After his apprentices stole his research into the heart, he assumed a new name: DiZ, or \"Darkness in Zero.\" Consumed by vengeance, he ruined more lives than one. In time, he saw the error of his ways, but in a last-ditch attempt to thwart the old Organization's plans, he was obliterated from the realm of light.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Anti-Aqua",
        "CharacterName": "Anti-Aqua",
        "Description": "Aqua, after she fell to darkness. Years and years of wandering through the realm of darkness ended with her being cast into the watery depths beyond its margin.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Apollo",
        "CharacterName": "Apollo",
        "Description": "One of the gods of Olympus.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Aqua",
        "CharacterName": "Aqua",
        "Description": "One of three Keyblade wielders who trained under Master Eraqus. Following the battle over the χ-blade more than a decade ago, she braved the realm of darkness to save a friend, and was trapped inside alone. After losing her Keyblade, she was unable to fight back the forces of the dark and was cast into the abyss below.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ariel",
        "CharacterName": "Ariel",
        "Description": "A friend that answered Sora's call through the power of the Heartbinder.",
        "AdditionalInformation": "The Little Mermaid (1989)"
      },
      {
        "Title": "Athena",
        "CharacterName": "Athena",
        "Description": "One of the goddesses of Olympus.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Baymax",
        "CharacterName": "Baymax",
        "Description": "A member of Big Hero 6. He was originally a healthcare robot developed by Hiro's older brother, Tadashi, but with the addition of combat data and an armored suit, Hiro upgraded him to \"Baymax 2.0.\"",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Boo",
        "CharacterName": "Boo",
        "Description": "A brave little human girl with boundless curiosity. She enjoys playing with Mike and Sulley on her occasional visits to Monsters, Incorporated.",
        "AdditionalInformation": "Monsters, Inc. (2001)"
      },
      {
        "Title": "The Boy in Black",
        "CharacterName": "Young Xehanort",
        "Description": "He and his best friend would often match wits playing chess between training sessions.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Boy in White",
        "CharacterName": "Young Eraqus",
        "Description": "He and his best friend would often match wits playing chess between training sessions.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Buzz Lightyear",
        "CharacterName": "Buzz",
        "Description": "A newer addition to Andy's toy lineup: an action figure who at one point believed he was a real, actual space ranger. Buzz reluctantly agreed to leave Andy's room and investigate Galaxy Toys.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "CDA Agent",
        "CharacterName": "CDA Agent(s)",
        "Description": "A member of an agency originally established to ensure no contaminants from human children accidentally cross over. The CDA sprang into action to aid Monsters, Incorporated in its time of crisis.",
        "AdditionalInformation": "Monsters, Inc. (2001)"
      },
      {
        "Title": "Chip",
        "CharacterName": "Chip",
        "Description": "One of Disney Castle's engineers. Serious and professional, his skills with machinery are top class. He invented the gummi ship and Gummiphone together with his younger brother Dale.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Chirithy",
        "CharacterName": "Chirithy",
        "Description": "A curious creature that begrudgingly offered Sora its assistance in The Final World.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cutler Beckett",
        "CharacterName": "Cutler Beckett",
        "Description": "Governor of the East India Trading Company. He took to the sea in order to eradicate all pirates and claim control of the waters for himself.",
        "AdditionalInformation": "Pirates: Dead Man's Chest (2006)"
      },
      {
        "Title": "Daisy Duck",
        "CharacterName": "Daisy",
        "Description": "Donald's girlfriend. She is assisting Queen Minnie with royal affairs until the King returns.",
        "AdditionalInformation": "Don Donald (1937)"
      },
      {
        "Title": "Dale",
        "CharacterName": "Dale",
        "Description": "One of Disney Castle's engineers. Despite his laid-back personality, his skills with machinery are top class. He invented the gummi ship and Gummiphone together with his older brother Chip.",
        "AdditionalInformation": "Private Pluto (1943)"
      },
      {
        "Title": "Dark Baymax",
        "CharacterName": "Dark Baymax",
        "Description": "The original Baymax. He was retrieved from anther dimension in a mantle of Darkubes, his program chip loaded with data from the hearts of the people the Darkubes attacked.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dark Riku",
        "CharacterName": "Dark Riku",
        "Description": "A member of the real Organization XIII. He looks exactly like Riku, except a year younger, and he wears the Organization's black coat.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Davy Jones",
        "CharacterName": "Davy Jones",
        "Description": "Captain of the Flying Dutchman. When Jack violated their agreement, Jones sent the Kraken after him.",
        "AdditionalInformation": "Pirates: Dead Man's Chest (2006)"
      },
      {
        "Title": "Demyx",
        "CharacterName": "Demyx",
        "Description": "A reserve member of the real Organization XIII. Despite his destruction at Sora's hands, Demyx has returned. He spends most of his time tuning his sitar, and his demeanor makes it extremely difficult to believe he's part of anything untoward.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dewey",
        "CharacterName": "Dewey",
        "Description": "One of Donald's triplet nephews, known for his trademark blue cap. He runs a gummi block shop together with his brothers.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Dilan",
        "CharacterName": "Dilan",
        "Description": "The human form of Xaldin, one of Organization XIII's Nobodies. Before joining the Organization, he was one of Ansem the Wise's apprentices and guarded the castle together with Aeleus.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald",
        "Description": "King Mickey's court magician and a loyal friend. Donald has journeyed with Sora many times to keep the worlds safe. He has pledged to help Sora through the trials ahead.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck (The Caribbean)",
        "CharacterName": "Donald",
        "Description": "King Mickey's court magician and a loyal friend. Donald has journeyed with Sora many times to keep the worlds safe. He has pledged to help Sora through the trials ahead. This is the guise Donald assumes when visiting Jack's world.",
        "AdditionalInformation": "The Wise Little Hen (1934)"
      },
      {
        "Title": "Donald Duck (Monstropolis)",
        "CharacterName": "Donald",
        "Description": "The captain of King Mickey's royal knights and also a good friend. Goofy has stuck by Sora's side through more than one adventure. He has pledged to help Sora through the trials ahead. This is the guise Donald assumes when visiting Sulley and Mike's world.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Donald Duck (Toy Box)",
        "CharacterName": "Donald",
        "Description": "The captain of King Mickey's royal knights and also a good friend. Goofy has stuck by Sora's side through more than one adventure. He has pledged to help Sora through the trials ahead. This is the guise Donald assumes when visiting Woody and Buzz's world.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Elizabeth Swann",
        "CharacterName": "Elizabeth Swann",
        "Description": "Daughter to the governor of Port Royal, and a friend of Jack's. We know Elizabeth from our past adventures. We were reunited with Elizabeth as she and the others came to rescue Jack from Davy Jones' Locker.",
        "AdditionalInformation": "Pirates: Curse of the Black Pearl (2003)"
      },
      {
        "Title": "Elsa I",
        "CharacterName": "Elsa",
        "Description": "Arendelle's queen and a wielder of powerful ice magic unlike any we've seen. We saw her leave her old home behind and run up the North Mountain.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Elsa II",
        "CharacterName": "Elsa",
        "Description": "Arendelle's queen and a wielder of powerful ice magic unlike any we've seen. We saw her leave her old home behind and run up the North Mountain. Anna's older sister. A quarrel with Anna on her coronation day resulted in Elsa unleashing the ice magic she'd been keeping hidden, and Elsa fled the castle.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Ephemer",
        "CharacterName": "Ephemer",
        "Description": "A mysterious boy who reached out to Sora's heart in a moment of crisis.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Flynn Rider I",
        "CharacterName": "Flynn Rider",
        "Description": "A young man who showed up with the Heartless hot on his heels. It seems they aren't the only ones he was running from. He discovered Rapunzel's tower while on the run and felt compelled to climb it. After meeting the girl inside, he agreed to serve as her guide.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Flynn Rider II",
        "CharacterName": "Flynn Rider",
        "Description": "A young man who showed up with the Heartless hot on his heels. It seems they aren't the only ones he was running from. He discovered Rapunzel's tower while on the run and felt compelled to climb it. After meeting the girl inside, he agreed to serve as her guide. Flynn, as it turns out, isn't his real name. He took the alias from The Tales of Flynnigan Rider, a book of stories about a swashbuckling rogue. Meeting Rapunzel prompted a change of heart, however, and now he goes by his real name, Eugene Fitzherbert.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Fred",
        "CharacterName": "Fred",
        "Description": "Tadashi's college friend, and a member of Big Hero 6. While not technically a student, Fred is a familiar face around campus. His suit is a kaiju costume heavily influenced by his personal tastes.",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Go Go Tomago",
        "CharacterName": "Go Go",
        "Description": "Tadashi's college friend, and a member of Big Hero 6. Go Go's suit functionality centers around a unique electromagnetic suspension system.",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "The captain of King Mickey's royal knights and also a good friend. Goofy has stuck by Sora's side through more than one adventure. He has pledged to help Sora through the trials ahead.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy (The Caribbean)",
        "CharacterName": "Goofy",
        "Description": "The captain of King Mickey's royal knights and also a good friend. Goofy has stuck by Sora's side through more than one adventure. He has pledged to help Sora through the trials ahead. This is the guise Goofy assumes when visiting Jack's world.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Goofy (Monstropolis)",
        "CharacterName": "Goofy",
        "Description": "The captain of King Mickey's royal knights and also a good friend. Goofy has stuck by Sora's side through more than one adventure. He has pledged to help Sora through the trials ahead.",
        "AdditionalInformation": "Two Weeks Vacation (1952)"
      },
      {
        "Title": "Gopher",
        "CharacterName": "Gopher",
        "Description": "A hard worker who lives in the Hundred Acre Wood. He's an expert digger, and can usually be found either burrowing a hole or falling into one.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Green Army Men",
        "CharacterName": "Green Army Men",
        "Description": "An army in a bucket, equipped with an array of gear that enables them to perform a broad range of missions.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "Gula",
        "CharacterName": "Gula",
        "Description": "One of the ancient Keyblade Masters. A coldly objective young man who dons a white robe and a leopard mask.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades",
        "CharacterName": "Hades",
        "Description": "God of the Underworld. Undaunted by all the losses he suffered at Hercules' hands, he revived the Titans and tried to use them to overthrow Zeus and chaim Olympus as his own.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Hamm",
        "CharacterName": "Hamm",
        "Description": "Andy's piggy bank. His belly, full of loose change, tends to slow him down when the call to action comes. Unlike Rex, he's more of a Gigas fan.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "Hans",
        "CharacterName": "Hans",
        "Description": "A young man we saw taking Elsa away from the ice palace. Darkness seemed to have a hold on him.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Hayner",
        "CharacterName": "Hayner",
        "Description": "An unruly boy who lives in Twilight Town. He hangs out with Pence and Olette, and feels an uncanny bond with Roxas. We know Hayner from our past adventures.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hector Barbossa",
        "CharacterName": "Barbossa",
        "Description": "A pirate captain who was cursed never to die and once caused us plenty of trouble. He was freed of the curse's bonds and mortal again just in time to be run through by Jack. However, Tia Dalma revived him, and the others came to rescue Jack from Davy Jones' Locker.",
        "AdditionalInformation": "Pirates: Curse of the Black Pearl (2003)"
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "A hero with a kind heart and tremendous strength. He was born a god, but lives down on earth as a mortal. We know Herc very well from the adventures we've shared together.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Hermes",
        "CharacterName": "Hermes",
        "Description": "One of the gods of Olympus.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Hiro Hamada",
        "CharacterName": "Hiro",
        "Description": "A boy genius living in San Fransokyo, and a member of Big Hero 6. After Hiro presented the microbots he invented, events took a turn for the tragic and he lost his brother, Tadashi. Together with Tadashi's friends and his brother's robot, Baymax, Hiro got to the bottom of the incident, and now the team continues to keep the peace as Big Hero 6.",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Honey Lemon",
        "CharacterName": "Honey Lemon",
        "Description": "Tadashi's college friend, and a member of Big Hero 6. Honey Lemon's special purse allows her to quickly create \"chem-balls\" containing a variety of unique chemical compounds.",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Huey",
        "CharacterName": "Huey",
        "Description": "One of Donald's triplet nephews, known for his trademark red cap. He runs a gummi block shop together with his brothers.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Ice Titan",
        "CharacterName": "Ice Titan",
        "Description": "A gargantuan being made of frigid ice.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Ienzo",
        "CharacterName": "Ienzo",
        "Description": "The human form of Zexion, one of Organization XIII's Nobodies. Before joining the Organization, he was one of Ansem the Wise's apprentices and researched the mysteries of the heart. He is now hard at work deciphering Ansem's Code.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Invi",
        "CharacterName": "Invi",
        "Description": "One of the ancient Keyblade Masters. A genteel young woman who dons a white robe and a snake mask.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ira",
        "CharacterName": "Ira",
        "Description": "One of the ancient Keyblade Masters. A judicious young man who dons a white robe and a unicorn mask.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jack Sparrow",
        "CharacterName": "Jack Sparrow",
        "Description": "A legendary pirate, and captain of the Black Pearl. We know Jack well from our past adventures. After we parted ways, Jack was devoured by the Kraken and sent to Davy Jones' Locker, where our paths crossed again.",
        "AdditionalInformation": "Pirates: Curse of the Black Pearl (2003)"
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "Hello, worlds! Cricket's the name - Jiminy Cricket. I'll be tagging along with Sora and the others, chronicling every moment of our grand adventure. It's good to be back!",
        "AdditionalInformation": "Pinocchio (1940)"
      },
      {
        "Title": "Joshamee Gibbs",
        "CharacterName": "Gibbs",
        "Description": "A member of the Black Pearl's crew. He and Jack get along swimmingly, and one is rarely more than a stone's throw away from the other. We met Gibbs as he and the others came to rescue Jack from Davy Jones' locker.",
        "AdditionalInformation": "Pirates: Curse of the Black Pearl (2003)"
      },
      {
        "Title": "Kairi",
        "CharacterName": "Kairi",
        "Description": "Sora and Riku's childhood friend. As one of the seven princesses of heart, she became a target of the forces of darkness, but thankfully Sora and Riku came to the rescue. She now trains with Lea as a Keyblade wielder herself to prepare for the final battle ahead.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kristoff",
        "CharacterName": "Kristoff",
        "Description": "A young iceman who is never apart from his reindeer friend, Sven. A random encounter brought him and Anna together, and together they pledged to end the unnatural winter plaguing Arendelle.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Larxene",
        "CharacterName": "Larxene",
        "Description": "A member of the real Organization XIII. Despite her destruction at Sora's hands, Larxene has returned to keep tabs on the \"New Seven Hearts,\" whom the Organization may need should their original plan go awry.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lava Titan",
        "CharacterName": "Lava Titan",
        "Description": "A gargantuan being made of molten lava.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Lea",
        "CharacterName": "Lea",
        "Description": "A Keyblade wielder who was once a Nobody and member of Organization XIII, at which time he went by the name \"Axel.\" After regaining his humanity, Lea joined forces with Sora and the other guardians of light. Through difficult training, he learned to summon and wield a Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lingering Will",
        "CharacterName": "Lingering Will",
        "Description": "A suit of armor imbued with Terra's thoughts and wishes.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Little Chef",
        "CharacterName": "Little Chef",
        "Description": "The chef of a well-reviewed restaurant. After meeting Scrooge, he was encouraged to come to Twilight Town to open a bistro, where he has been using ingredients from other worlds to further his culinary talents.",
        "AdditionalInformation": "Ratatouille (2007)"
      },
      {
        "Title": "Little Green Men",
        "CharacterName": "Little Green Alien(s)",
        "Description": "An identical trio that were prizes from the Pizza Planet crane game. They tend to stick together.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "Louie",
        "CharacterName": "Louie",
        "Description": "One of Donald's triplet nephews, known for his trademark green cap. He runs a gummi block shop together with his brothers.",
        "AdditionalInformation": "Donald's Nephews (1938)"
      },
      {
        "Title": "Lumpy",
        "CharacterName": "Lumpy",
        "Description": "A young heffalump who lives near the edge of the Hundred Acre Wood. After he met Roo and the two became good friends, Lumpy comes by to visit and play all the time.",
        "AdditionalInformation": "Pooh's Heffalump Movie (2005)"
      },
      {
        "Title": "Luxord",
        "CharacterName": "Luxord",
        "Description": "A member of the real Organization XIII. He is a lover of games, and sometimes even prioritizes them over his Organization duties. Despite his destruction at Sora's hands, Luxord has returned.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent",
        "CharacterName": "Maleficent",
        "Description": "An evil fairy who seeks to rule over all worlds. She and Pete are searching for a black box.",
        "AdditionalInformation": "Despite his destruction at Sora's hands, Marluxia has returned to keep tabs on the \"New Seven Hearts,\" whom the Organization may need should their original plan go awry."
      },
      {
        "Title": "Marshmallow",
        "CharacterName": "Marshmallow",
        "Description": "A fearsome sentinel that protects Elsa. He was created by her magic.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Master Eraqus",
        "CharacterName": "Eraqus",
        "Description": "The true Keyblade Master who mentored Terra, Aqua, and Ventus. He was struck down by his own brother-in-training, Master Xehanort, in the clash over a decade ago.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master of Masters",
        "CharacterName": "Master of Masters",
        "Description": "A mysterious figure shrouded in a hooded black coat. Aside from his claim that he is one of the Lost Masters, not much else is known about him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Master Xehanort",
        "CharacterName": "Master Xehanort",
        "Description": "The most powerful Keyblade Master of them all. Master Xehanort's pursuit of the World's true nature and obsession with the Keyblade War led him to give his heart over to darkness. He tried to forge the χ-blade and trigger another Keyblade War, but three young Keyblade wielders put a stop to him. Now, he has created a new Organization - the real Organization XIII - and intends to divide his heart among its other twelve members to create thirteen darknesses.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maximus",
        "CharacterName": "Maximus",
        "Description": "The proud, white steed belonging to the captain of the royal guards. Maximus was chasing after Flynn, but begrudgingly agreed to work with him at Rapunzel's request.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Megara",
        "CharacterName": "Meg",
        "Description": "A woman dear to Hercules' heart. In the past, Hades blackmailed her into doing his bidding, but meeting Hercules put an end to that dark chapter of her life.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Merlin",
        "CharacterName": "Merlin",
        "Description": "A great wizard able to manipulate time itself. He used his magic to furnish Kairi and Lea with a special training ground so they wouldn't need to rush their study of the Keyblade. Merlin's capricious nature means that he rarely stays in the same time or place for long.",
        "AdditionalInformation": "The Sword in the Stone (1963)"
      },
      {
        "Title": "King Mickey",
        "CharacterName": "Mickey",
        "Description": "The king of Disney Castle and one of the true Keyblade Masters. He was among the first to notice something amiss in the worlds and take action. In order to gather the remaining guardians of light to confront Master Xehanort, King Mickey and Riku have gone searching for the lost Keyblade wielders who vanished over ten years ago.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Mike",
        "CharacterName": "Mike",
        "Description": "An employee at Monsters, Incorporated and Sulley's best buddy since college. He cares for Boo like one of his own.",
        "AdditionalInformation": "Monsters, Inc. (2001)"
      },
      {
        "Title": "Queen Minnie",
        "CharacterName": "Minnie",
        "Description": "Queen of Disney Castle, who reigns over the kingdom while King Mickey is away.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Moogles",
        "CharacterName": "Moogle(s)",
        "Description": "Strange creatures that pop up in even stranger places to open up shop. In truth, the shops are run by holographic projections while the real moogles remain elsewhere.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Mother Gothel I",
        "CharacterName": "Mother Gothel",
        "Description": "Rapunzel's mother. She left the tower to look for her missing daughter.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Mother Gothel II",
        "CharacterName": "Mother Gothel",
        "Description": "Rapunzel's mother. She left the tower to look for her missing daughter. However, we came to learn this was all a lie. \"Mother\" Gothel was the one who took Rapunzel from her real parents—for no reason other than to exploit the mysterious healing powers in the girl's hair.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Naminé",
        "CharacterName": "Naminé",
        "Description": "Kairi's Nobody. The previous Organization XIII used Naminé's unique powers to manipulate Sora's memories, but Sora freed her from their clutches. She ceased to exist after rejoining with Kairi's heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Olaf",
        "CharacterName": "Olaf",
        "Description": "A walking, talking snowman brought to life by Elsa's magic. After meeting Anna, Kristoff, and the rest of us, Olaf led us to the ice palace.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Olette",
        "CharacterName": "Olette",
        "Description": "A mature girl who lives in Twilight Town. Se hangs out with Hayner and Pence, and feels an uncanny bond with Roxas. We know Olette from our past adventures.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pascal",
        "CharacterName": "Pascal",
        "Description": "A chameleon who has been a good friend to Rapunzel. Pascal was the only one she really felt she could talk to while she was growing up inside the tower.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Pegasus",
        "CharacterName": "Pegasus",
        "Description": "A flying horse and Hercules' trusty partner. He was a gift from Herc's father, Zeus.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Pence",
        "CharacterName": "Pence",
        "Description": "A boy who lives in Twilight Town and has a knack for technology. He hangs out with Hayner and Olette, and feels an uncanny bond with Roxas. We know Pence from our past adventures.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pete",
        "CharacterName": "Pete",
        "Description": "Maleficent's henchman. The two of them are looking for a black box.",
        "AdditionalInformation": "Steamboat Willie (1928)"
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "A renowned trainer of heroes who has whipped countless hopefuls into shape, including Hercules.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Piglet",
        "CharacterName": "Piglet",
        "Description": "Pooh's dearest friend in the Hundred Acre Wood. Piglet is timid and startled by just about anything.",
        "AdditionalInformation": "Winnie the Pooh and the Blustery Day (1968)"
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "King Mickey's trusty dog.",
        "AdditionalInformation": "The Chain Gang (1930)"
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "A devoted farmer who lives in the Hundred Acre Wood. Pooh frequently drops by to eat all his honey, much to Rabbit's annoyance.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Randall",
        "CharacterName": "Randall",
        "Description": "A former scarer at Monsters, Incorporated. Getting banished from the company didn't put an end to his scheming, and he came back more determined than ever to get revenge on Sulley and Mike.",
        "AdditionalInformation": "Monsters, Inc. (2001)"
      },
      {
        "Title": "Rapunzel",
        "CharacterName": "Rapunzel",
        "Description": "A girl with a lot of hair and a lot of heart. She set foot outside her tower, for the first time in her life, to see the lights in the sky that she had watched from her window since childhood.",
        "AdditionalInformation": "Tangled (2010)"
      },
      {
        "Title": "Rex",
        "CharacterName": "Rex",
        "Description": "Andy's toy Tyrannosaurus. His fierce appearance belies a meek and anxious nature. Rex is an avid video game fan, and his current character obsession is Yozora.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "Riku",
        "CharacterName": "Riku",
        "Description": "A true Keyblade Master and childhood friend of Sora and Kairi. Though he struggled with the darkness in the past, he learned to control his heart and successfully earned the Mark of Mastery. In order to gather the remaining guardians of light to confront Master Xehanort, Riku and King Mickey have gone searching for the lost Keyblade wielders who vanished over ten years ago.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku Replica",
        "CharacterName": "Riku Replica",
        "Description": "An experimental replica created by the former Organization XIII using combat data taken from Riku. He dueled the real Riku to prove his right to exist, but lost and was destroyed. Riku Replica's heart wandered the realm of darkness, eventually taking refuge alongside Riku's heart after the two were reunited.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Rock Titan",
        "CharacterName": "Rock Titan",
        "Description": "A gargantuan being made of solid stone.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Roo",
        "CharacterName": "Roo",
        "Description": "Kanga's son. He loves Tigger, and the two spend lots of time practicing their bouncing together. Roo was the first in the Hundred Acre Wood to befriend Lumpy.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Roxas",
        "CharacterName": "Roxas",
        "Description": "Sora's Nobody and the thirteenth member of the previous Organization XIII. He was a Keyblade wielder and Axel's closest friend. After rejoining with Sora's heart, Roxas ceased to exist. Thanks to a replica that was able to contain his heart and memories, Roxas became real again and joined the guardians of light.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Saïx",
        "CharacterName": "Saïx",
        "Description": "A member of the real Organization XIII. He and Axel were good friends in the old days before they first became Nobodies. Despite his destruction at Sora's hands, Saïx has returned.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Simba",
        "CharacterName": "Simba",
        "Description": "A friend that answered Sora's call through the power of the Heartbinder.",
        "AdditionalInformation": "The Lion King (1994)"
      },
      {
        "Title": "Sora",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. Having surmounted countless challenges, he was at last given a chance to complete the Mark of Mastery examination, but the attempt ended in failure. He was overtaken by the darkness, and lost nearly all of his powers and strength in the process. Together with Donald and Goofy, he has set forth on a new adventure to reclaim that lost strength and acquire the power of waking in order to prepare for the looming battle with Master Xehanort.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (The Caribbean)",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. Having surmounted countless challenges, he was at last given a chance to complete the Mark of Mastery examination, but the attempt ended in failure. He was overtaken by the darkness, and lost nearly all of his powers and strength in the process. Together with Donald and Goofy, he has set forth on a new adventure to reclaim that lost strength and acquire the power of waking in order to prepare for the looming battle with Master Xehanort. This is the guise Sora assumes when visiting Jack's world.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (Monstropolis)",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. Having surmounted countless challenges, he was at last given a chance to complete the Mark of Mastery examination, but the attempt ended in failure. He was overtaken by the darkness, and lost nearly all of his powers and strength in the process. Together with Donald and Goofy, he has set forth on a new adventure to reclaim that lost strength and acquire the power of waking in order to prepare for the looming battle with Master Xehanort. This is the guise Sora assumes when visiting Sulley and Mike's world.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (San Fransokyo)",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. Having surmounted countless challenges, he was at last given a chance to complete the Mark of Mastery examination, but the attempt ended in failure. He was overtaken by the darkness, and lost nearly all of his powers and strength in the process. Together with Donald and Goofy, he has set forth on a new adventure to reclaim that lost strength and acquire the power of waking in order to prepare for the looming battle with Master Xehanort. This is Sora wearing the AR device he received in San Fransokyo.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (Toy Box)",
        "CharacterName": "Sora",
        "Description": "A boy who wields a Keyblade. Having surmounted countless challenges, he was at last given a chance to complete the Mark of Mastery examination, but the attempt ended in failure. He was overtaken by the darkness, and lost nearly all of his powers and strength in the process. Together with Donald and Goofy, he has set forth on a new adventure to reclaim that lost strength and acquire the power of waking in order to prepare for the looming battle with Master Xehanort. This is the guise Sora assumes when visiting Woody and Buzz's world.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Stitch",
        "CharacterName": "Stitch",
        "Description": "A friend that answered Sora's call through the power of the Heartbinder.",
        "AdditionalInformation": "Lilo and Stitch (2002)"
      },
      {
        "Title": "Sulley",
        "CharacterName": "Sulley",
        "Description": "The CEO of Monsters, Incorporated. He has become fast friend with a little human girl named Boo.",
        "AdditionalInformation": "Monsters, Inc. (2001)"
      },
      {
        "Title": "Sven",
        "CharacterName": "Sven",
        "Description": "Kristoff's reindeer friend. To say he loves carrots would be an understatement.",
        "AdditionalInformation": "Frozen (2013)"
      },
      {
        "Title": "Terra",
        "CharacterName": "Terra",
        "Description": "One of three Keyblade wielders who trained under Master Eraqus. He nearly succumbed to the darkness at the end of the battle over the χ-blade more than a decade ago, but Aqua saved him - or so it seemed. In truth, a different heart had taken hold of his body. Terra's deep connection with Aqua and Ventus broke the dark shackles that held him, and he returned as a guardian of light.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Terra-Xehanort",
        "CharacterName": "Terra-Xehanort",
        "Description": "A member of the real Organization XIII. This is the Master Xehanort that took control of Terra's body.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tia Dalma",
        "CharacterName": "Tia Dalma",
        "Description": "A beguiling woman Will and the others turned to in order to extricate Jack from Davy Jones' Locker. Tia Dalma and Jack seemed to already know each other.",
        "AdditionalInformation": "Pirates: Dead Man's Chest (2006)"
      },
      {
        "Title": "Tigger",
        "CharacterName": "Tigger",
        "Description": "An energetic personality who lives in the Hundred Acre Wood. He loves to bounce, and has a tendency to get carried away and cause trouble for others, but he means no harm.",
        "AdditionalInformation": "Winnie the Pooh and the Blustery Day (1968)"
      },
      {
        "Title": "Tornado Titan",
        "CharacterName": "Wind Titan",
        "Description": "A gargantuan being made of violent winds.",
        "AdditionalInformation": "Hercules (1997)"
      },
      {
        "Title": "Vanitas",
        "CharacterName": "Vanitas",
        "Description": "A member of the real Organization XIII. This is the pure darkness that Master Xehanort extracted from Ventus's heart. He was pitted against Ventus in order to forge the χ-blade, but Ventus prevailed and Vanitas ceased to exist. Now that he is back, he continues to seek his \"brother,\" Ventus.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ventus",
        "CharacterName": "Ventus",
        "Description": "One of three Keyblade wielders who trained under Master Eraqus. His heart fell into slumber at the end of the battle over the χ-blade more than a decade ago. Since then, Aqua has kept his body hidden away in the Chamber of Waking. Ventus's deep connection with Aqua was what ultimately woke him from his sleep within Sora's heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Vexen",
        "CharacterName": "Vexen",
        "Description": "A reserve member of the real Organization XIII. Despite being recompleted as a human, Vexen returned to the Organization willingly in order to pursue his research, which he values above all else.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wasabi",
        "CharacterName": "Wasabi",
        "Description": "Tadashi's college friend, and a member of Big Hero 6. Wasabi's suit gives him access to laser-induced plasma blades.",
        "AdditionalInformation": "Big Hero 6 (2014)"
      },
      {
        "Title": "Will Turner",
        "CharacterName": "Will Turner",
        "Description": "A young man from Port Royal, and a friend of Jack's. We know Will from our past adventures. We were reunited with Will as he and the others came to rescue Jack from Davy Jones' Locker.",
        "AdditionalInformation": "Pirates: Curse of the Black Pearl (2003)"
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A friendly bear who lives inside a great big tree in the Hundred Acre Wood. He loves to eat, especially if there's honey to be had.",
        "AdditionalInformation": "Winnie the Pooh and the Honey Tree (1966)"
      },
      {
        "Title": "Woody",
        "CharacterName": "Woody",
        "Description": "Andy's treasured toy cowboy and the de facto leader of the other toys. He took the initiative in getting to the bottom of their strange new circumstances.",
        "AdditionalInformation": "Toy Story (1995)"
      },
      {
        "Title": "Wreck-It Ralph",
        "CharacterName": "Ralph",
        "Description": "A friend that answered Sora's call through the power of the Heartbinder.",
        "AdditionalInformation": "Wreck-It Ralph (2012)"
      },
      {
        "Title": "Xehanort (Re:Mind)",
        "CharacterName": "Young Xehanort",
        "Description": "During a training journey in preparation for his Mark of Mastery exam, a certain Keyblade wielder was given a coat that wards off darkness from a mysterious figure.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xemnas",
        "CharacterName": "Xemnas",
        "Description": "A member of the real Organization XIII. This is Xehanort's Nobody. In the past, he tried to create an artificial Kingdom Hearts from the hearts of people, but Sora and Riku put an end to his plans and Xemnas himself. Despite this, Xemnas has returned.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xigbar",
        "CharacterName": "Xigbar",
        "Description": "A member of the real Organization XIII. Despite his defeat at Sora's hands, Xigbar has returned, and continues his attempts to manipulate and mislead Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Xion",
        "CharacterName": "Xion",
        "Description": "The former Organization XIII's mysterious fourteenth member. She was an experimental replica used to siphon Sora's memories out of Roxas, and this allowed her to become a Keyblade wielder. Xion grew to question the meaning of her existence, and ultimately elected to return her memories to Sora and disappear. Master Xehanort was using Xion to fill a spot in his new Organization XIII, but when she was confronted by her best friends Axel and Roxas, her memories came back to her and she chose to become a guardian of light.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yen Sid",
        "CharacterName": "Yen Sid",
        "Description": "A great sorcerer who watches over the balance between light and darkness. He was also King Mickey's teacher. In the past, he, too, served as a true Keyblade Master, but these days he chooses to mentor Keyblade wielders from his tower. As the final battle with Xehanort looms ahead, Master Yen Sid has been leading the effort to gather the seven guardians of light we need.",
        "AdditionalInformation": "The Sorcerer's Apprentice (1940)"
      },
      {
        "Title": "Young Xehanort",
        "CharacterName": "Young Xehanort",
        "Description": "A member of the real Organization XIII. This is Master Xehanort's younger self. He has traveled forward through time more than once in order to guide Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yozora",
        "CharacterName": "Yozora",
        "Description": "A young man who was destined to meet Sora. His true identity is shrouded in mystery.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Zeus",
        "CharacterName": "Zeus",
        "Description": "Hercules' father and king of the gods of Olympus.",
        "AdditionalInformation": "Hercules (1997)"
      }
    ]
  }
}