{
  "Characters": {
    "Kingdom Hearts": [
      {
        "Title": "99 Puppies",
        "CharacterName": "Dalmation(s)",
        "Description": "Pongo and Perdita's puppies. When they work together, they can be tough to beat. Ever since their world was destroyed by the darkness, they've been trying to get back together again.",
        "AdditionalInformation": "They were first spotted on-screen in \"101 Dalmatians\" (1961)."
      },
      {
        "Title": "Abu",
        "CharacterName": "Abu",
        "Description": "Aladdin's faithful furry sidekick. Abu's size and ability make him valuable in tight spots. He's got a weakness for jewels and treasure, and when he's around them he can't think of anything else.",
        "AdditionalInformation": "He was all monkey-business in \"Aladdin\" (1992)."
      },
      {
        "Title": "Aerith",
        "CharacterName": "Aerith",
        "Description": "She lost her home to the Heartless at a very young age. Beneath her gentle disposition lies a strong will and a firm sense of duty. Many are naturally drawn to her. Aerith works with Leon and Yuffie to learn more about the Heartless and the \"key\".",
        "AdditionalInformation": "\"Final Fantasy VII\""
      },
      {
        "Title": "Aladdin I",
        "CharacterName": "Aladdin",
        "Description": "A young man living in the desert city of Agrabah. He fell in love with princess Jasmine, but he's afraid to tell her about his humble background. He found the legendary lamp and released Genie, who is now his partner.",
        "AdditionalInformation": "He first stole our hearts in \"Aladdin\" (1992)."
      },
      {
        "Title": "Aladdin II",
        "CharacterName": "Aladdin",
        "Description": "A young man living in Agrabah. He helped Sora defeat Jafar and used his last wish to release Genie from the lamp. Aladdin asked Sora and friends to help save Jasmine, who has been abducted.",
        "AdditionalInformation": "He stole the scene in \"Aladdin\" (1992)."
      },
      {
        "Title": "Alice I",
        "CharacterName": "Alice",
        "Description": "A girl who fell down a rabbit hole into Wonderland. She often daydreams and is naturally curious. Falsely accused of trying to steal the queen's heart, she was given an unfair trial and falsely convicted.",
        "AdditionalInformation": "She fell down the rabbit hole in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Alice II",
        "CharacterName": "Alice",
        "Description": "Fell down a rabbit hole into Wonderland. Arrested on suspicion of trying to steal the queen's heart. Sora and his friends proved her innocence, but the Heartless captured her as part of their plan to open the final Keyhole.",
        "AdditionalInformation": "She fell down the rabbit hole in \"Alice in Wonderland\" (1951)"
      },
      {
        "Title": "Ansem I",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "A researcher who studied the Heartless and delved into secrets of the worlds. He organized his findings into a single volume known as Ansem's report. When he inexplicably vanished, most of its pages were scattered to the winds.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem II",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "As a researcher and ruler of his world, he studied the Heartless and delved into the many secrets of the worlds. While studying the heart and the darkness within it, he was possessed by darkness and ultimately destroyed his own world. He sacrificed his body to attain great power and later possessed Riku's to regain a physical presence. Failure to stop him means the end of all worlds.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ariel I",
        "CharacterName": "Ariel",
        "Description": "The youngest daughter of Triton, king of Atlantica. Outgoing and full of curiosity, Ariel hates being cooped up in her father's palace. She dreams of visiting the world on land, where people live.",
        "AdditionalInformation": "Her voice enchanted us in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Ariel II",
        "CharacterName": "Ariel",
        "Description": "Triton's youngest daughter. Ursula tricked her into helping steal his trident. With help from Sora and the others, all was put right. Still, she'll never stop dreaming of exploring the world outside her father's palace.",
        "AdditionalInformation": "Her voice enchanted us in \"The Little Mermaid\" (1989)"
      },
      {
        "Title": "Aurora",
        "CharacterName": "Aurora",
        "Description": "A young woman with a lovely voice. She is loved by three good fairies and cursed by Maleficent. The sorceress captured Aurora to help open the final Keyhole.",
        "AdditionalInformation": "She had her first encounter with Maleficent in \"Sleeping Beauty\" (1959)."
      },
      {
        "Title": "Bambi",
        "CharacterName": "Bambi",
        "Description": "A young deer, son of the great stag who rules the forest. He prances around and gives you items. The more foes Sora defeats, the better the items become. The type of items he gives varies depending on the area. Cost: 1 MP",
        "AdditionalInformation": "The forest prince was born in \"Bambi\" (1942)."
      },
      {
        "Title": "Barrel",
        "CharacterName": "Barrel",
        "Description": "A member of the trio that includes Lock and Shock. He's a little slow, and often ends up as the butt of his partners' pranks and practical jokes.",
        "AdditionalInformation": "He created havoc in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Beast",
        "CharacterName": "Beast",
        "Description": "A prince who was changed into a hideous beast because of his selfish heart. Belle has helped heal the loneliness he's suffered due to his ugliness. To save Belle, he made his way to Hollow Bastion alone.",
        "AdditionalInformation": "He was first enchanted by Belle in \"Beauty and the Beast\" (1991)."
      },
      {
        "Title": "Belle",
        "CharacterName": "Belle",
        "Description": "A brave and intelligent young woman who understands the Beast's true nature. She's one of the seven princesses needed to open the final Keyhole. She and the Beast have lost their world to the darkness.",
        "AdditionalInformation": "She appeared at the Beast's castle for the first time in \"Beauty and the Beast\" (1991)"
      },
      {
        "Title": "Brooms",
        "CharacterName": "Enchanted Broom(s)",
        "Description": "Enchanted brooms with a life of their own. They tidy up, maintain the gummi ship, do house repairs, wait on others—just about anything useful.",
        "AdditionalInformation": "They swept onto the screen in \"Fantasia\" (1940)."
      },
      {
        "Title": "Captain Hook I",
        "CharacterName": "Captain Hook",
        "Description": "The pirate who is working with the Heartless to pay revenge to Peter Pan, who caused him to lose his left hand. He is as arrogant as a pirate can be, but hides away when the crocodile comes close. With the Heartless' powers, he can travel to many other worlds.",
        "AdditionalInformation": "He hooked us in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Captain Hook II",
        "CharacterName": "Captain Hook",
        "Description": "The pirate with a grudge against Peter Pan, who caused him to lose his hand to the crocodile. He threw in his lot with Maleficent and the Heartless, but ended up being chased over the horizon by the crocodile.",
        "AdditionalInformation": "He hooked us in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Cards (Hearts)",
        "CharacterName": "Card Soldier(s)",
        "Description": "Spear-carrying guards who serve the Queen of Hearts. They fear the short-tempered queen and are careful not to irritate her.",
        "AdditionalInformation": "Marched onto the scene in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Cards (Spades)",
        "CharacterName": "Card Soldier(s)",
        "Description": "Troops with heavy axes who serve the Queen of Hearts. They fear their short-tempered queen, and are careful not to irritate her.",
        "AdditionalInformation": "Marched onto the scene in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Carpet",
        "CharacterName": "Carpet",
        "Description": "A magical flying carpet, loyal to Aladdin. Carpet can carry passengers over the vastness of the desert at great speed. The Heartless had Carpet pinned to the floor under a chest.",
        "AdditionalInformation": "He enchanted us in \"Aladdin\" (1992)."
      },
      {
        "Title": "Cerberus",
        "CharacterName": "Cerberus",
        "Description": "Guardian of the entrance of the Underworld and Hades's loyal servant. Herc defeated him once, but Hades has brought him back to fight Sora and his friends.",
        "AdditionalInformation": "He first stood watch for Hades in \"Hercules\" (1997)."
      },
      {
        "Title": "Cheshire Cat",
        "CharacterName": "Cheshire Cat",
        "Description": "A mysterious, grinning cat who talks in riddles and can appear and disappear at will. He loves to mislead and confuse.",
        "AdditionalInformation": "He entered with a big smile in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Chip",
        "CharacterName": "Chip",
        "Description": "One of the kingdom's specialists. Helps maintain the gummi ship, which can travel to any destination. Chip is more serious and diligent than his easygoing, playful partner, Dale.",
        "AdditionalInformation": "Chip 'n' Dale's first appearance was in \"Private Pluto\" (1943)."
      },
      {
        "Title": "Cid",
        "CharacterName": "Cid",
        "Description": "Owner of an accessory shop in Traverse Town. A highly skilled engineer and a first-rate pilot. When the Heartless invaded his world, he escaped to Traverse Town on a gummi ship he'd built himself. He is an expert on gummi ships.",
        "AdditionalInformation": "\"Final Fantasy VII\""
      },
      {
        "Title": "Cinderella",
        "CharacterName": "Cinderella",
        "Description": "A hardworking young girl who's often bullied by her stepmother and stepsisters. She is one of the princesses needed to open the final Keyhole, and was captured by the Heartless. Her world has already been destroyed.",
        "AdditionalInformation": "Prince Charming first swept her away in \"Cinderella\" (1950)."
      },
      {
        "Title": "Clayton I",
        "CharacterName": "Clayton",
        "Description": "A veteran hunter. He acts as Jane's guide on her expedition to the jungle. He thinks of animals only as prey, and dreams of the money to be made selling gorillas to zoos back at home.",
        "AdditionalInformation": "He first set his sights on the apes in \"Tarzan\" (1999)."
      },
      {
        "Title": "Clayton II",
        "CharacterName": "Clayton",
        "Description": "A veteran hunter, Jane's guide on her expedition to the jungle. He thinks of animals only as prey. His lust for power and the darkness in his heart attracted the Heartless, and they used him for their own evil purposes.",
        "AdditionalInformation": "He first set his sights on the apes in \"Tarzan\" (1999)."
      },
      {
        "Title": "Cloud",
        "CharacterName": "Cloud",
        "Description": "A fighter hired by Hades to compete in the Coliseum. Despite his association with Hades, his heart remains untouched by the Heartless. Cloud keeps very much to himself, which makes him something of an enigma. What is he seeking?",
        "AdditionalInformation": "\"Final Fantasy VII\""
      },
      {
        "Title": "The Crocodile",
        "CharacterName": "The Crocodile",
        "Description": "A seagoing reptile big enough to swallow a man whole—and he's always hungry! He got a taste of Hook once and never forgot it. Hook can tell when he's near by the sound of the clock ticking away in his stomach.",
        "AdditionalInformation": "He had a taste for Captain Hook in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Daisy Duck",
        "CharacterName": "Daisy",
        "Description": "Donald's sweetheart. She's helping Minnie while the others look for King Mickey. She has Donald under her thumb, and does a good job of keeping him in line.",
        "AdditionalInformation": "She originally appeared as Daisy in \"Mr. Duck Steps Out\" (1940)."
      },
      {
        "Title": "Dale",
        "CharacterName": "Dale",
        "Description": "One of the kingdom's specialists. Helps maintain the gummi ship, which can travel to any destination. Compared to the more serious Chip, he takes a happy-go-lucky approach to life.",
        "AdditionalInformation": "Chip 'n' Dale's first appearance was in \"Private Pluto\" (1943)."
      },
      {
        "Title": "Dewey",
        "CharacterName": "Dewey",
        "Description": "One of Donald's three nephews. Always wears a blue cap. Cheerful and easygoing. He works with his brothers in a shop in Traverse Town.",
        "AdditionalInformation": "Dewey began tormenting his Uncle Donald in \"Donald's Nephews\" (1938)."
      },
      {
        "Title": "Donald Duck I",
        "CharacterName": "Donald",
        "Description": "Royal Magician. Skilled in magic, but can be short-tempered and stubborn. He set out in the gummi ship with Goofy to find the king. Donald has joined forces with Sora, the key bearer alluded to in the king's letter.",
        "AdditionalInformation": "Donald made his screen debut in \"The Wise Little Hen\" (1934)."
      },
      {
        "Title": "Donald Duck II",
        "CharacterName": "Donald",
        "Description": "Royal magician. Skilled in magic, but short-tempered and stubborn. Because Mickey said to follow the key bearer, he once left Sora to follow Riku. But friendship soon led him back to Sora.",
        "AdditionalInformation": "Donald made his screen debut in \"The Wise Little Hen\" (1934)."
      },
      {
        "Title": "Doorknob",
        "CharacterName": "Doorknob",
        "Description": "A talking doorknob in the door to Wonderland. To enter, you must turn him—and \"One good turn deserves another,\" as he would say.",
        "AdditionalInformation": "Doorknob was the only character in \"Alice in Wonderland\" (1951) who didn't first appear in the original story."
      },
      {
        "Title": "Dragon",
        "CharacterName": "Dragon Maleficent",
        "Description": "Maleficent became a huge dragon when the Keyblade released the darkness in her heart. The dragon wielded both Maleficent's power and the terrible forces of darkness.",
        "AdditionalInformation": "Maleficent's powerful alter ego first appeared in \"Sleeping Beauty\" (1959)."
      },
      {
        "Title": "Dr. Finkelstein",
        "CharacterName": "Dr. Finkelstein",
        "Description": "The mad scientist who created a \"heart\" to help Jack control the Heartless' dancing. Sally is another of his creations. She helps him around the lab, but she'd much rather spend time with Jack.",
        "AdditionalInformation": "He created some scares in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Dumbo",
        "CharacterName": "Dumbo",
        "Description": "A baby circus elephant. He was taunted because of his huge ears, but his talent for flying made him the star of the circus. Ascend with Circle button, descend with Square button. Attack: Splash. Cost: 3 MP.",
        "AdditionalInformation": "He first flew onto the screen in \"Dumbo\" (1941)."
      },
      {
        "Title": "Eeyore",
        "CharacterName": "Eeyore",
        "Description": "Timid, retiring Eeyore lives in a little house in the roots of a tree. His tail is held on by a tack, but it keeps falling off and getting lost. Now he's wandering the woods, looking for a new home.",
        "AdditionalInformation": "He reluctantly appeared in \"Winnie the Pooh and the Honey Tree\" (1966)."
      },
      {
        "Title": "Fairy Godmother",
        "CharacterName": "Fairy Godmother",
        "Description": "A powerful but generous and good-hearted fairy who helps Sora and his friends. Slightly absent-minded, but an expert at magic. She gives Sora and the others lessons in magic as well as advice on their journey.",
        "AdditionalInformation": "She first appeared as Cinderella's fairy godmother in \"Cinderella\" (1950)."
      },
      {
        "Title": "Flotsam",
        "CharacterName": "Flotsam",
        "Description": "Ursula's lackey, along with Jetsam. An evil moray eel, Flotsam is a smooth talker who loves to deceive. His specialty is using empty promises to lure unsuspecting mermen and mermaids into Ursula's clutches.",
        "AdditionalInformation": "He ran interference for Ursula in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Flounder",
        "CharacterName": "Flounder",
        "Description": "Ariel's trusted friend. Flounder will do anything for her. He's small and not exactly brave, but he'll never leave Ariel's side, even when it means facing danger.",
        "AdditionalInformation": "He appeared in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Genie I",
        "CharacterName": "Genie",
        "Description": "The wacky spirit of the lamp. He spent centuries cooped up in the lamp till Aladdin found him. He must grant three wishes to whoever controls the lamp, even if they are evil.",
        "AdditionalInformation": "He granted our wish by appearing in \"Aladdin\" (1992)."
      },
      {
        "Title": "Genie II",
        "CharacterName": "Genie",
        "Description": "The spirit of the magic lamp, who has been freed by Aladdin with his third wish. Genie has joined forces with Sora and friends to rescue Jasmine from captivity. He will attack all locked-on targets with Showtime. Cost: 2 MP",
        "AdditionalInformation": "He granted our wish by appearing in \"Aladdin\" (1992)."
      },
      {
        "Title": "Geppetto I",
        "CharacterName": "Geppetto",
        "Description": "The kind, gentle clock maker. All his skill went into making Pinocchio. When the little puppet disappeared, Geppetto set out to find him, but he and his tiny boat were swallowed by Monstro, the whale.",
        "AdditionalInformation": "He provided shelter in \"Pinocchio\" (1940)."
      },
      {
        "Title": "Geppetto II",
        "CharacterName": "Geppetto",
        "Description": "The kind, gentle clock maker. Sora and friends helped him escape from Monstro's belly. These days he's living in Traverse Town and looking forward to the day Pinocchio becomes a real boy.",
        "AdditionalInformation": "He provided shelter in \"Pinocchio\" (1940)."
      },
      {
        "Title": "Goofy I",
        "CharacterName": "Goofy",
        "Description": "Captain of the royal knights. He avoids fighting whenever possible. Mickey's most loyal subject. He set out in the gummi ship with Donald to find King Mickey. He has joined forces with Sora, obeying Mickey's command to follow the key bearer.",
        "AdditionalInformation": "Goofy made his first screen appearance in \"Mickey's Revue\" (1932)."
      },
      {
        "Title": "Goofy II",
        "CharacterName": "Goofy",
        "Description": "Captain of the royal knights. He avoids fighting whenever possible. Mickey's most loyal subject. Because Mickey said to follow the key bearer, he once left Sora to follow Riku. But friendship soon led him back to Sora.",
        "AdditionalInformation": "Goofy made his first screen appearance in \"Mickey's Revue\" (1932)."
      },
      {
        "Title": "Hades I",
        "CharacterName": "Hades",
        "Description": "Lord of the Underworld. He's using the Heartless to try and take over the world. To get Hercules and Sora out of the way, he sent Cloud to fight them in the Coliseum.",
        "AdditionalInformation": "He heated things up in \"Hercules\" (1997)."
      },
      {
        "Title": "Hades II",
        "CharacterName": "Hades",
        "Description": "Lord of the Underworld. He's using the Heartless to try to take over the world. Hades wants Herc and Sora out of the way, but all his schemes against Sora and the others seem to end in failure.",
        "AdditionalInformation": "He heated things up in \"Hercules\" (1997)."
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "A legendary hero with godlike strength. He's the son of the gods Zeus and Hera, but not a god himself. The people regard Hercules as a true hero.",
        "AdditionalInformation": "He went from \"zero to hero\" in \"Hercules\" (1997)."
      },
      {
        "Title": "Huey",
        "CharacterName": "Huey",
        "Description": "One of Donald's three nephews. Huey is the leader, and he keeps playful Dewey and laid-back Louie in line. You can spot Huey by his trademark red cap.",
        "AdditionalInformation": "Huey began tormenting his Uncle Donald in \"Donald's Nephews\" (1938)."
      },
      {
        "Title": "Iago",
        "CharacterName": "Iago",
        "Description": "Jafar's cunning, crotchety parrot. He's Jafar's eyes and ears as he flies around Agrabah, spying on his master's enemies. Iago takes after Jafar, with a penchant for intrigue and evil.",
        "AdditionalInformation": "He squawked around in \"Aladdin\" (1992)."
      },
      {
        "Title": "Ice Titan",
        "CharacterName": "Ice Titan",
        "Description": "Defeated once by Hercules, he received new powers from Hades and resurfaced. His body is made of large blocks of seemingly impregnable ice. But the ice shaping his face is quite fragile. Naturally, he is weak against fire.",
        "AdditionalInformation": "He shook the scene in \"Hercules\" (1997)."
      },
      {
        "Title": "Jack Skellington",
        "CharacterName": "Jack Skellington",
        "Description": "The pumpkin king. He loves to scare people out of their wits. Headstrong, confident, and likes grand gestures. Now he's working night and day to make this year's Halloween festival the greatest ever.",
        "AdditionalInformation": "He scared up some fun in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Jafar I",
        "CharacterName": "Jafar",
        "Description": "The royal vizier of Agrabah. Jafar is unprincipled and ruthless in pursuit of his aims. Now he's using the Heartless to try to take over the city.",
        "AdditionalInformation": "He played the villain in \"Aladdin\" (1992)."
      },
      {
        "Title": "Jafar II",
        "CharacterName": "Jafar",
        "Description": "The vizier of Agrabah. He joined forces with Maleficent and tried to control the Heartless. He gained control of the lamp and became a powerful genie, but was defeated by Sora and his friends.",
        "AdditionalInformation": "He played the villain in \"Aladdin\" (1992)."
      },
      {
        "Title": "Jafar-Genie",
        "CharacterName": "Genie Jafar",
        "Description": "With his last wish he became an all-powerful Genie himself, but he forgot that all genies share the same fate: To serve whoever controls their lamp. In the end, his lamp became his prison.",
        "AdditionalInformation": "He played the villain in \"Aladdin\" (1992)."
      },
      {
        "Title": "Jane Porter",
        "CharacterName": "Jane",
        "Description": "A naturalist who's in the jungle with Clayton, her guide, to study gorillas. She met Tarzan in the jungle and is gradually teaching him about human ways. She's courageous and will face any danger for her research.",
        "AdditionalInformation": "Exploring the jungle, she encountered \"Tarzan\" (1999)."
      },
      {
        "Title": "Jasmine I",
        "CharacterName": "Jasmine",
        "Description": "The strong-willed princess of Agrabah. Jasmine longs for the freedom of life outside the palace. She's in love with Aladdin, but doesn't know his real identity. She left the palace to seek Aladdin's help against Jafar.",
        "AdditionalInformation": "She appeared in \"Aladdin\" (1992)."
      },
      {
        "Title": "Jasmine II",
        "CharacterName": "Jasmine",
        "Description": "Spirited princess of Agrabah. Longing for a life of freedom, she slipped away from the palace and encountered Aladdin, who she quickly grew fond of. As one of the princesses with the power to open the Keyhole, she was abducted by Jafar and the Heartless.",
        "AdditionalInformation": "She appeared in \"Aladdin\" (1992)."
      },
      {
        "Title": "Jetsam",
        "CharacterName": "Jetsam",
        "Description": "Ursula's lackey, along with Flotsam. An evil moray eel, Jetsam is a smooth talker who loves to deceive. His specialty is using empty promises to lure unsuspecting mermen and mermaids into Ursula's clutches.",
        "AdditionalInformation": "He ran interference for Ursula in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy",
        "Description": "That's me! The cricket who keeps Pinocchio to the straight and narrow. I'm along on the quest as the royal chronicler.",
        "AdditionalInformation": "Look for me in \"Pinocchio\" (1940)."
      },
      {
        "Title": "Kairi I",
        "CharacterName": "Kairi",
        "Description": "Islander. Kairi, Sora, and Riku were best friends. They built a raft to sail out and see new worlds. The three were separated when a mysterious force struck the Destiny Islands. Thus did Sora's search for Kairi begin.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi II",
        "CharacterName": "Kairi",
        "Description": "Kairi, Sora, and Riku always hung out together. When their island vanished, Kairi lost her heart. It turned out that it was hidden within Sora's. As one of the princesses with the power to unlock the secret Keyhole, Kairi restored Sora's heart when he was turned into a Heartless.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kala",
        "CharacterName": "Kala",
        "Description": "The gorilla who found Tarzan in the jungle. She has always helped and defended him, even when he was scorned by the others. Kala is not happy about Tarzan's contact with people, but she knows it's important to him.",
        "AdditionalInformation": "She was second banana in \"Tarzan\" (1999)."
      },
      {
        "Title": "Kerchak",
        "CharacterName": "Kerchak",
        "Description": "Boss of the gorilla pack. He was against letting Tarzan join the group, but Kala's resolve won him over. Kerchak worries that Tarzan's contact with people will bring danger to the gorilla community.",
        "AdditionalInformation": "He established himself as leader of the pack in \"Tarzan\" (1999)."
      },
      {
        "Title": "King Triton",
        "CharacterName": "King Triton",
        "Description": "King of Atlantica, who is backed by the power of his trident. He has forbidden Ariel to have any contact with outsiders, which only led to her yearn to grow even stronger.",
        "AdditionalInformation": "He ruled the seas in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Leon",
        "CharacterName": "Leon",
        "Description": "A swordsman who wields the Gunblade. His real name: Squall Leonhart. He escaped to Traverse Town when the Heartless raided his home world. To part with his old self, a man who had been helpless to stop them, he changed his name. Since meeting the king, who has been so vigilant against the Heartless, Leon has sought the truth behind the \"key\".",
        "AdditionalInformation": "\"Final Fantasy VIII\""
      },
      {
        "Title": "Lock",
        "CharacterName": "Lock",
        "Description": "The ringleader of the trio that includes Shock and Barrel. Their walking bathtub helps them get around while they commit all kinds of mischief. They sometimes help Oogie, but they're not really fond of him.",
        "AdditionalInformation": "He created havoc in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Louie",
        "CharacterName": "Louie",
        "Description": "One of Donald's three nephews. Works with his brothers in a shop in Traverse Town. Gentle and carefree, but notices a lot of things others miss. To find him, look for a green cap.",
        "AdditionalInformation": "Louie began tormenting his Uncle Donald in \"Donald's Nephews\" (1938)."
      },
      {
        "Title": "Maleficent I",
        "CharacterName": "Maleficent",
        "Description": "A sorceress of awesome power. She controls the Heartless, and is said to have destroyed many worlds. No one knows what her true intentions are.",
        "AdditionalInformation": "She first appeared to curse Aurora in \"Sleeping Beauty\" (1959)."
      },
      {
        "Title": "Maleficent II",
        "CharacterName": "Maleficent",
        "Description": "A sorceress of awesome power. She leads the villains who seek to harness the power of the Heartless. She has also tricked Riku into joining her and is using him as part of her evil plans.",
        "AdditionalInformation": "She first appeared to curse Aurora in \"Sleeping Beauty\" (1959)."
      },
      {
        "Title": "The Mayor",
        "CharacterName": "The Mayor",
        "Description": "The two-faced mayor of Halloween Town. He switches from his happy face to his sad face depending on his mood, which changes constantly. He's working with Jack to make this year's festival the best ever.",
        "AdditionalInformation": "He appeared in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Merlin",
        "CharacterName": "Merlin",
        "Description": "A great sorcerer living on the outskirts of Traverse Town. Merlin's wisdom and magic powers rank second to none, and he teaches Sora and his friends about magic. He has a mysterious bag that can hold anything, no matter how large.",
        "AdditionalInformation": "Merlin first tutored Arthur in how to be king in \"The Sword in the Stone\" (1963)."
      },
      {
        "Title": "Mickey Mouse",
        "CharacterName": "Mickey",
        "Description": "King of Disney Castle. He set out to learn more about the darkness, and left instructions for Donald and Goofy to find and follow the key bearer. No one knows where King Mickey is now, but they are determined to find him.",
        "AdditionalInformation": "He made his debut in \"Steamboat Willie\" (1928)."
      },
      {
        "Title": "Minnie Mouse",
        "CharacterName": "Minnie",
        "Description": "Queen of Disney Castle, ruling in Mickey's absence. I, Jiminy Cricket, am accompanying Donald and Goofy as the royal chronicler at her request. Queen Minnie is more concerned than anyone about the king's disappearance.",
        "AdditionalInformation": "Minnie made her screen debut in \"Steamboat Willie\" (1928)."
      },
      {
        "Title": "Moogles",
        "CharacterName": "Moogle(s)",
        "Description": "Escaped to Traverse Town when the Heartless invaded their home. They know how to combine various items to form new ones.",
        "AdditionalInformation": "Many \"Final Fantasies\"."
      },
      {
        "Title": "Mr. Smee",
        "CharacterName": "Mr. Smee",
        "Description": "Hook's first mate. He lives to take orders from Hook, but he's as slow-witted as Hook is obnoxious.",
        "AdditionalInformation": "He appeared in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Mushu",
        "CharacterName": "Mushu",
        "Description": "One of the guardian spirits of an ancient clan. He was banished by the other guardians because of his foolish ways. Though small, he has the power of a great dragon. Press X Button for Fire Breath attack. Cost: 3 MP",
        "AdditionalInformation": "This ancient dragon heated things up in \"Mulan\" (1998)."
      },
      {
        "Title": "Oogie Boogie I",
        "CharacterName": "Oogie Boogie",
        "Description": "This evil bag of bugs wants Jack out of town so he can take over. To further his plot, he's after the heart Dr. Finkelstein created, and he's sent Lock, Shock and Barrel to steal it.",
        "AdditionalInformation": "He came apart at the seams in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Oogie Boogie II",
        "CharacterName": "Oogie Boogie",
        "Description": "The villain who tried to take over Halloween Town. The heart he stole from Dr. Finkelstein attracted the Heartless, and the result was his doom.",
        "AdditionalInformation": "He came apart at the seams in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Owl",
        "CharacterName": "Owl",
        "Description": "The wisest resident of the Hundred Acre Wood. Whenever anyone has a question he can't answer, he asks the Owl... though Owl isn't always right! Owl likes to talk, but sometimes he puts his listeners to sleep.",
        "AdditionalInformation": "He showed us the wisdom of his ways in \"Winnie the Pooh and the Honey Tree\" (1966)."
      },
      {
        "Title": "Perdita",
        "CharacterName": "Perdita",
        "Description": "A beautiful dalmatian. With her partner Pongo, she takes care of 99 dalmatian puppies. Perdita will brave any danger to protect her spotted charges.",
        "AdditionalInformation": "Perdita was first spotted on-screen in \"101 Dalmatians\" (1961)."
      },
      {
        "Title": "Peter Pan",
        "CharacterName": "Peter Pan",
        "Description": "The flying boy from Neverland, where no one ever grows up. He can be stubborn, but he's also fearless and has a strong sense of justice. He snuck on board Hook's ship to rescue Wendy, who was kidnapped.",
        "AdditionalInformation": "He led the Lost Boys in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Phil",
        "Description": "Phil the satyr is a veteran trainer of heroes and Herc's mentor. These days he's very busy running the Coliseum and choosing competitors suitable for the games.",
        "AdditionalInformation": "He came out of retirement in \"Hercules\" (1997)."
      },
      {
        "Title": "Piglet",
        "CharacterName": "Piglet",
        "Description": "Pooh's best friend in the Hundred Acre Wood. Tiny, timid Piglet is startled by just about anything. When that happens, he covers his eyes with his floppy ears.",
        "AdditionalInformation": "He appeared on a \"windsday\" in \"Winnie the Pooh and the Blustery Day\" (1968)."
      },
      {
        "Title": "Pinocchio I",
        "CharacterName": "Pinocchio",
        "Description": "He was crafted by Geppetto. The Blue Fairy brought him to life to answer Geppetto's prayers for a son. He must learn courage, kindness, and honesty to prove he's worthy to be a real boy. It's my job to keep him out of trouble.",
        "AdditionalInformation": "There were no strings to hold him down in Pinocchio (1940)."
      },
      {
        "Title": "Pinocchio II",
        "CharacterName": "Pinocchio",
        "Description": "Crafted by Geppetto and brought to life by the Blue Fairy. He'd have lost his heart to the Heartless if I hadn't come to the rescue. Now he's living in Traverse Town with Geppetto and working hard to become a real boy.",
        "AdditionalInformation": "There were no strings to hold him down in Pinocchio (1940)."
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "Mickey's faithful dog. Pluto is more than a pet. He and Mickey are bound by strong ties of loyalty. Pluto set out with the others to find his master. Will that famous nose of his lead him to Mickey?",
        "AdditionalInformation": "Pluto originally appeared in \"The Chain Gang\" (1930)."
      },
      {
        "Title": "Pongo",
        "CharacterName": "Pongo",
        "Description": "A brave and intelligent dalmatian. With his mate Perdita, he looks after 99 dalmatian puppies. Quick-witted Pongo is an expert at escaping from tight spots.",
        "AdditionalInformation": "Pongo was first spotted on-screen in \"101 Dalmatians\" (1961)."
      },
      {
        "Title": "Queen of Hearts",
        "CharacterName": "Queen of Hearts",
        "Description": "A queen of Wonderland who lives in a castle with decks and decks of card soldiers. Selfish and short-tempered, she beheads anyone who crosses her. She thinks Alice tried to steal her heart.",
        "AdditionalInformation": "She struck terror in our hearts in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "Rabbit is an earnest, hardworking member of the Hundred Acre Wood community. He keeps to himself, but lends a hand when others need him. He's not always comfortable around the exuberant Tigger.",
        "AdditionalInformation": "He appeared in \"Winnie the Pooh and the Honey Tree\" (1966)."
      },
      {
        "Title": "Riku I",
        "CharacterName": "Riku",
        "Description": "Islander. A self-confident youth always competing with Sora. He hated the monotony of island life and built a raft with Sora and Kairi to explore the outside world. Riku seems to have vanished along with the Destiny Islands.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku II",
        "CharacterName": "Riku",
        "Description": "Islander. A self-confident youth always competing with Sora. When the Destiny Islands vanished, so did he. By the time Riku reappeared, Sora had already found new friends, so Riku didn't rejoin him. Riku is willing to go to any length to save Kairi--even join forces with Maleficent.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku III",
        "CharacterName": "Riku",
        "Description": "Riku gained immense power through the forces of darkness. But ordinary humans are no match for the darkness, and it is gradually consuming his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku IV",
        "CharacterName": "Riku",
        "Description": "When Kairi lost her heart, Riku allied himself with Maleficent to save her. Riku was actually the rightful master of the Keyblade, but once he chose darkness over light, the weapon chose Sora instead. Ansem exploited Riku's weakness of heart and possessed him.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Rock Titan",
        "CharacterName": "Rock Titan",
        "Description": "Immortal giant in the form of a stone crag. He has two heads, but can only think with one at a time. Defeated once by Hercules, he's now on the loose again, courtesy of Hades.",
        "AdditionalInformation": "He shook the scene in \"Hercules\" (1997)."
      },
      {
        "Title": "Roo",
        "CharacterName": "Roo",
        "Description": "Roo dreams of bouncing as well as Tigger someday. He's mischievous, energetic, and fearless, but grows uneasy when Tigger is not around.",
        "AdditionalInformation": "He hopped onto the screen in \"Winnie the Pooh and the Honey Tree\" (1966)."
      },
      {
        "Title": "Sabor",
        "CharacterName": "Sabor",
        "Description": "A leopard feared by all who live in the jungle, and an enemy of Tarzan and the gorillas. Sabor is a cunning hunter who targets the weak and helpless.",
        "AdditionalInformation": "He stalked onto the scene in \"Tarzan\" (1999)."
      },
      {
        "Title": "Sally",
        "CharacterName": "Sally",
        "Description": "Dr. Finkelstein's creation. She's patched together from parts that sometimes come off and move about on their own. She loves Jack and tries to steer him in the right direction, though it doesn't always work.",
        "AdditionalInformation": "She appeared in \"Tim Burton's The Nightmare Before Christmas\"."
      },
      {
        "Title": "Sebastian",
        "CharacterName": "Sebastian",
        "Description": "Triton's concert master, a musical genius. The little crab is also responsible for keeping an eye on Ariel to ensure her safety. Whenever she leaves the palace, he's on pins and needles.",
        "AdditionalInformation": "He conducted himself in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Selphie",
        "CharacterName": "Selphie",
        "Description": "A spunky girl who lived on the Destiny Islands. She is rather impulsive, and quite the romanticist. Nobody knows what happened to her after her island disappeared.",
        "AdditionalInformation": "\"Final Fantasy VIII\""
      },
      {
        "Title": "Sephiroth",
        "CharacterName": "Sephiroth",
        "Description": "Once known as the greatest of swordsmen, his whereabouts have been unknown for some time. He challenged Sora to a one-on-one duel. No one knows why he has suddenly returned. Apparently, he and Cloud have crossed paths before.",
        "AdditionalInformation": "\"Final Fantasy VII\""
      },
      {
        "Title": "Shock",
        "CharacterName": "Shock",
        "Description": "Along with Lock and Barrel, she's part of Oogie Boogie's plot to take over Halloween Town. Shock is the most cunning member of the trio. She keeps her cool when the other two are losing it.",
        "AdditionalInformation": "She created havoc in \"Tim Burton's The Nightmare Before Christmas\" (1993)."
      },
      {
        "Title": "Simba",
        "CharacterName": "Simba",
        "Description": "The leader of the pride. He rules over the other animals of the Pride Lands, his savanna kingdom. Hold down the X button to charge up his power. When the command changes to Proud Roar release the button to unleash the attack. Hold the button down longer for more power. Cost: 2 MP",
        "AdditionalInformation": "He roared onto the scene in \"The Lion King\" (1994)."
      },
      {
        "Title": "Snow White",
        "CharacterName": "Snow White",
        "Description": "A beautiful princess, gentle and pure as snow. She is one of the princesses needed to open the final Keyhole, and was captured by the Heartless. Her world has already been swallowed by the darkness.",
        "AdditionalInformation": "The fair-skinned princess first appeared in \"Snow White and the Seven Dwarfs\" (1937)."
      },
      {
        "Title": "Sora I",
        "CharacterName": "Sora",
        "Description": "A spirited youth. He was cast into an unknown world when a swarm of Heartless raided his island. He battles the Heartless with a mysterious weapon called the Keyblade as he searches for his friend Kairi.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora III",
        "CharacterName": "Sora",
        "Description": "The one who fights the Heartless. Upon reclaiming the Keyblade from his rival, Riku, Sora sacrificed his heart to free Kairi and became a Heartless. Kairi's deep feelings for Sora restored him. Now he must confront Ansem, the seeker of darkness.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tarzan",
        "CharacterName": "Tarzan",
        "Description": "A young man raised from infancy by gorillas. His gorilla \"mother\" is Kala. Tarzan spoke only the language of the apes until he met Jane. Since then he's learning to speak English at an astonishing rate.",
        "AdditionalInformation": "He swung onto the screen in \"Tarzan\" (1999)."
      },
      {
        "Title": "Terk",
        "CharacterName": "Terk",
        "Description": "A young female gorilla, and Tarzan's close friend. She is protective of the other young gorillas and acts as their leader. Unlike the other gorillas, her curiosity about humans is greater than her fear of them.",
        "AdditionalInformation": "She was up to some monkey business in \"Tarzan\" (1999)."
      },
      {
        "Title": "Tigger",
        "CharacterName": "Tigger",
        "Description": "Tigger loves to bounce more than anything. Sometimes his bouncing gets out of hand, but he doesn't mean any harm. Beneath that happy-go-lucky exterior beats a sensitive, gentle heart.",
        "AdditionalInformation": "He bounced onto the scene in \"Winnie the Pooh and the Blustery Day\" (1968)."
      },
      {
        "Title": "Tidus",
        "CharacterName": "Tidus",
        "Description": "A cheerful, self-confident boy who lived on the Destiny Islands. He considers himself a champ at everything. Nobody knows what happened to him after his island disappeared.",
        "AdditionalInformation": "\"Final Fantasy X\""
      },
      {
        "Title": "Tinker Bell I",
        "CharacterName": "Tinker Bell",
        "Description": "The little pixie of Neverland. She's Peter Pan's loyal partner, but she has a short fuse, and she's very jealous of any girl who gets near Peter. With a little of her pixie dust, you can fly... if you believe.",
        "AdditionalInformation": "She made us believe in fairies in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Tinker Bell II",
        "CharacterName": "Tinker Bell",
        "Description": "The little pixie from Neverland. Peter Pan asked her to accompany Sora and friends on their quest, but she's anxious to see Peter. She can restore party's HP, and prevents Sora from being defeated, though only once. Cost: 3 MP.",
        "AdditionalInformation": "She made us believe in fairies in \"Peter Pan\" (1953)."
      },
      {
        "Title": "Ursula I",
        "CharacterName": "Ursula",
        "Description": "An evil sea witch living in a vast cave far from the palace. Has the power to grant wishes, but in return demands a heavy sacrifice. She's trying to oust Triton and take over Atlantica.",
        "AdditionalInformation": "She appeared in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Ursula II",
        "CharacterName": "Ursula",
        "Description": "She deceived Ariel and stole the trident to take over Atlantica. Using its power, she became an enormous monster and battled Sora, Goofy and Donald.",
        "AdditionalInformation": "She appeared in \"The Little Mermaid\" (1989)."
      },
      {
        "Title": "Wakka",
        "CharacterName": "Wakka",
        "Description": "A boy who lived on the Destiny Islands. He looks out for Tidus and Selphie like a big brother. Nobody knows what happened to him after his island disappeared.",
        "AdditionalInformation": "\"Final Fantasy X\""
      },
      {
        "Title": "Wendy",
        "CharacterName": "Wendy",
        "Description": "A dreamy girl whose wish to visit Neverland came true. Peter Pan showed her the way, but she got caught up in Hook's vendetta against Peter, and was kidnapped by Hook.",
        "AdditionalInformation": "She watched over the Lost Boys in \"Peter Pan\" (1953)."
      },
      {
        "Title": "White Rabbit",
        "CharacterName": "White Rabbit",
        "Description": "Loyal servant to the Queen of Hearts. He led Sora and his friends to the Queen of Hearts' castle.",
        "AdditionalInformation": "He wasn't late for his appearance in \"Alice in Wonderland\" (1951)."
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A little bear living in the Hundred Acre Wood. His favorite food is honey. Being a Bear of Very Little Brain, he's a bit absent-minded. Sometimes he even forgets what it was he was trying to remember.",
        "AdditionalInformation": "He warmed up the screen in \"Winnie the Pooh and the Honey Tree\" (1966)."
      },
      {
        "Title": "?",
        "CharacterName": "Xemnas",
        "Description": "A mysterious figure who appeared in Hollow Bastion.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yuffie",
        "CharacterName": "Yuffie",
        "Description": "A female ninja who escaped to Traverse Town when her home world was taken by the Heartless. She stays strong and cheerful in any situation. She works with Leon and Aerith to unravel the secret of the \"key\".",
        "AdditionalInformation": "\"Final Fantasy VII\""
      }
    ],
    "Kingdom Hearts Re:Chain of Memories": [
      {
        "Title": "Aerith",
        "CharacterName": "Aerith",
        "Description": "A young woman who fought the Heartless. Her calm demeanor hides an unbreakable will. Aerith also has a mysterious sense of truth, and is aware that Traverse Town and its inhabitants are a figment of Sora's memory.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Aladdin",
        "CharacterName": "Aladdin",
        "Description": "A young man who lives in Agrabah and dreams of meeting Princess Jasmine. Aladdin became Genie's master when he found the magic lamp. At first Aladdin wanted to become a prince and impress Jasmine, but in the end he gave Genie his freedom and decided to show Jasmine his true self.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Alice",
        "CharacterName": "Alice",
        "Description": "A curious girl who fell down the rabbit hole into Wonderland. Alice was falsely accused of stealing the Queen of Hearts' memory and put on trial, but we intervened and helped her clear her name.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ansem",
        "CharacterName": "Ansem Seeker of Darkness",
        "Description": "Pursuer of darkness. To open the door to darkness, Ansem used the Heartless to steal countless hearts. He enslaved Riku, but met his demise at Sora's hand. Nonetheless, Ansem's shadow lives on in the depths of Riku's heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ariel",
        "CharacterName": "Ariel",
        "Description": "The daughter of King Triton who longs to see the outside world. Worried by Flounder's disappearance, Ariel was cajoled by Ursula into forking over the king's trident. We helped Ariel save Flounder and recover the trident, and she resolved to tell her father the truth.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Axel (SS)",
        "CharacterName": "Axel",
        "Description": "A mysterious figure who stands in Sora's path. Hard to read, half the time Axel seems to just be messing around... but for all we know, he's done more thinking than everyone else put together. He knows a lot more than he lets on.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Axel (RR)",
        "CharacterName": "Axel",
        "Description": "No. 8 in the Organization. He is a Nobody whose intentions and secrets are hidden from all. Axel has no qualms about exploiting others to suit his needs. He used Sora and Naminé to silence Marluxia and halt his plot against the Organization. Axel claims he and Sora have something in common, but that connection is unclear.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Bambi",
        "CharacterName": "Bambi",
        "Description": "A young deer prince whose father is king of the Forest. Sora can call on Bambi for help anytime.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Beast",
        "CharacterName": "Beast",
        "Description": "A prince transformed into a beast because of his selfishness. Meeting Belle restored humanity to his heart. Though stunned by Belle's cold behavior, his faith in their love never wavered.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Belle",
        "CharacterName": "Belle",
        "Description": "A young woman who saw kindness behind the Beast's gruff exterior. Realizing Maleficent sought her heart, Belle acted coldly toward the Beast to keep her heart beyond the witch's reach.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hook (SS)",
        "CharacterName": "Captain Hook",
        "Description": "A pirate who holds a grudge against Peter Pan. Hook kidnapped Wendy to lure Peter out. Normally proud, Hook falls to pieces the moment the crocodile that took his hand shows up.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hook (RR)",
        "CharacterName": "Captain Hook",
        "Description": "A pirate of Neverland. Hook appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Card of Hearts",
        "CharacterName": "Card of Heart(s)",
        "Description": "Guards in the service of the Queen of Hearts. They fear her temper and will do anything she orders.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Card of Spades",
        "CharacterName": "Card of Spade(s)",
        "Description": "Guards in the service of the Queen of Hearts. They fear her temper and will do anything she orders.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Cheshire Cat",
        "CharacterName": "Cheshire Cat",
        "Description": "A mysterious, grinning cat who always talks in riddles. He appears when you least expect it, and disappears whenever he pleases.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cid",
        "CharacterName": "Cid",
        "Description": "A gifted pilot who saved Leon and the others from the Heartless when they were just children. Cid lives in Traverse Town now.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Cloud",
        "CharacterName": "Cloud",
        "Description": "A swordsman hired by Hades to take out Hercules. Cloud seeks the true memories he has lost. Were they memories of someone dear to him, or memories of his hazy past?",
        "AdditionalInformation": ""
      },
      {
        "Title": "DiZ",
        "CharacterName": "DiZ",
        "Description": "Truly an enigma. DiZ appeared before Riku in the guise of Ansem, presenting him with choices regarding the darkness within his heart. It is said he and the king have met.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Donald Duck",
        "CharacterName": "Donald Duck",
        "Description": "Court Wizard at Disney Castle who set out with Goofy after the king's disappearance with orders to find the Keyblade Master. His short temper sometimes gets him into trouble, but he is very brave and caring of his loved ones. He would put his life on the line if it meant helping a friend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dragon Maleficent",
        "CharacterName": "Dragon Maleficent",
        "Description": "Maleficent's dragon form. Her own sorcery mingled with the vast powers of darkness made Maleficent a fearful opponent.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dr. Finkelstein",
        "CharacterName": "Dr. Finkelstein",
        "Description": "The mad scientist of Halloween Town. He's always immersed in his odd experiments. This time Dr. Finkelstein came up with a potion to restore true memories, only to have it guzzled by Oogie Boogie.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Dumbo",
        "CharacterName": "Dumbo",
        "Description": "A small elephant born in a circus. The other animals laughed at his big ears, but the courage to fly made Dumbo the star of the circus. If Sora calls, Dumbo will come to the rescue.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Eeyore",
        "CharacterName": "Eeyore",
        "Description": "A gloomy donkey whose tail keeps falling off and getting lost. Eeyore is timid and always a little down, and likes to take things slow.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Flounder",
        "CharacterName": "Flounder",
        "Description": "A young fish. He's not exactly brave, but Flounder is Ariel's most loyal friend. Ursula kidnapped Flounder as part of her plan to trick Ariel and steal the trident.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Genie",
        "CharacterName": "Genie",
        "Description": "Captive of the magic lamp. Genie must grant the lamp's holder three wishes He longs for freedom, but can only get it if someone uses a wish to set him free.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Geppetto",
        "CharacterName": "Geppetto",
        "Description": "A gentle and earnest clockmaker who carved Pinocchio from a block of wood. Geppetto was swallowed by Monstro, boat and all, while searching for Pinocchio. The two were reunited inside the giant whale, and escaped with our help.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Goofy",
        "CharacterName": "Goofy",
        "Description": "Captain of the Disney Castle Royal Knights. He set out with Donald after the king's disappearance. He is cheerful and calm, and no one is more loyal to the king. Goofy and Sora are especially good friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades (SS)",
        "CharacterName": "Hades",
        "Description": "Ruler of the Underworld. Hades can't stand Hercules. He tricked Cloud into challenging Hercules to the death, but we put an end to his plotting.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hades (RR)",
        "CharacterName": "Hades",
        "Description": "God of the Underworld who seeks to rule over all. Hades appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Hercules",
        "CharacterName": "Hercules",
        "Description": "Son of the god Zeus and Hera, but not a god himself. With godlike strength and a gentle heart, Hercules is a true hero. He has never lost at the Coliseum games.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Iago",
        "CharacterName": "Iago",
        "Description": "A cunning and chatty parrot. Iago flies about Agrabah, serving as the evil Jafar's eyes and ears.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jack Skellington",
        "CharacterName": "Jack Skellington",
        "Description": "Halloween Town's master of the macabre. Jack is always looking for new ways to bring the spooks and shivers of Halloween to all.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar",
        "CharacterName": "Jafar",
        "Description": "A sorcerer and Agrabah's royal vizier. Jafar stole the magic lamp from Aladdin and, with Genie's power, schemed to become ruler of Agrabah.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar-Genie (SS)",
        "CharacterName": "Genie Jafar",
        "Description": "Jafar's genie form. After taking the magic lamp from Aladdin, Jafar wished for the powers of a genie and tried to do us in.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jafar-Genie (RR)",
        "CharacterName": "Genie Jafar",
        "Description": "A sorcerer and also Agrabah's royal vizier, transformed by magic. Jafar appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jasmine",
        "CharacterName": "Jasmine",
        "Description": "Princess of Agrabah. Jasmine feels cooped up in the palace and longs for the freedom outside its walls.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Jiminy Cricket",
        "CharacterName": "Jiminy Cricket",
        "Description": "That's right, me again. I'm keeping a journal of everyone's adventures. I also act as Pinocchio's conscience, so he'll know right from wrong.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi (SS)",
        "CharacterName": "Kairi",
        "Description": "Sora's childhood friend. Sora's journey began as a search for Kairi, who disappeared when their island home was swallowed by darkness. Kairi was held captive by the Heartless, but thanks to Sora she and the islands were saved. She waits there for Sora and Riku's return.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Kairi (RR)",
        "CharacterName": "Kairi",
        "Description": "Riku and Sora's friend growing up. Kairi vanished when their home islands were devoured by darkness. Riku and Sora both journeyed to find her. Kairi was held captive by the Heartless, but thanks to Sora, she and the islands were saved. She waits there for Sora and Riku's return.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The King",
        "CharacterName": "Mickey",
        "Description": "The king who reigns over Disney Castle. He set off alone to protect his world and all worlds from the dominion of the dark. When Riku fell into the realm of darkness, the king showed him the way, but the two were separated when the door to darkness was closed.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Larxene (SS)",
        "CharacterName": "Larxene",
        "Description": "A member of the group that controls Castle Oblivion. Larxene is unfeeling and loves nothing more than to bring other people down. She is on good terms with Axel but still mocks everyone and trusts no one.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Larxene (RR)",
        "CharacterName": "Larxene",
        "Description": "No. 12 in the Organization. Larxene conspired with Marluxia to take over the group, and intended to pull Axel in as well. However, her abrasive, unfeeling personality proved her downfall—provoking Sora's anger was a fatal error.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Leon",
        "CharacterName": "Leon",
        "Description": "A cool and collected swordsman who wields a gunblade. His real name: Squall Leonhart. Leon once fought with Sora against the Heartless, but the Leon we met in Castle Oblivion is a product of Sora's memory, so he can't remember much of what happened before.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Lexaeus",
        "CharacterName": "Lexaeus",
        "Description": "No. 5 in the Organization. A born warrior, Lexaeus effortlessly brandishes a gigantic tomahawk. To counterbalance his rival Marluxia's bid for Sora's power, Lexaeus tried to conquer Riku, but was defeated by Riku's dark powers.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent (SS)",
        "CharacterName": "Maleficent",
        "Description": "A witch who commands the darkness. Sora faced Maleficent and her Heartless once before. She stole Belle's heart to perfect her dark powers, though Belle had seen through her plan.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Maleficent (RR)",
        "CharacterName": "Maleficent",
        "Description": "A witch who commands the darkness. Maleficent's charms won over Riku, and she empowered him with darkness. In Castle Oblivion she stood before Riku again, this time as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Marluxia (SS)",
        "CharacterName": "Marluxia",
        "Description": "Lord of Castle Oblivion and a member of the Organization. In a move to bring the group under his control, Marluxia used Naminé to overrun Sora's memory and tried to claim the power of the Keyblade.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Marluxia (RR)",
        "CharacterName": "Marluxia",
        "Description": "No. 11 in the Organization. Marluxia lured Sora to Castle Oblivion in hopes of using his power to seize the Organization. He ordered Naminé to alter Sora's memories, and fooled Vexen into challenging him. All was going according to plan, but Marluxia's scheme dissolved when Axel set Naminé free. Marluxia was ultimately destroyed by Sora.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Moogles",
        "CharacterName": "Moogle(s)",
        "Description": "A strange race that seems to pop up just about anywhere. In Castle Oblivion, the moogles run shops where Sora can trade in unwanted cards.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Mushu",
        "CharacterName": "Mushu",
        "Description": "Once a guardian dragon of a Chinese family. Due to past mistakes, he lost much of his former power. If Sora calls, Mushu will come to our aid.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé (SS)",
        "CharacterName": "Naminé",
        "Description": "A young witch who, under orders from Marluxia, rewrote much of Sora's memory. Because Naminé based the false memories on Sora's feelings toward Kairi, Sora believed he and Naminé had been friends since childhood. But truth be told, the two had never met before Castle Oblivion.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Naminé (RR)",
        "CharacterName": "Naminé",
        "Description": "A young witch who can manipulate memories. Under orders from the Organization, Naminé shadowed Kairi and altered Sora's memory. But the forgiveness in Sora's heart moved her to disobey those orders. Now she watches over Sora until the reconstruction of his memories is complete.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Oogie Boogie (SS)",
        "CharacterName": "Oogie Boogie",
        "Description": "A villain who's always plotting against Jack. Oogie Boogie stole Dr. Finkelstein's potion thinking it would make him stronger, but it drove him mad with fear instead.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Oogie Boogie (RR)",
        "CharacterName": "Oogie Boogie",
        "Description": "A villain who's always causing trouble in Halloween Town. Oogie Boogie appeared before Riku as a token of the indelible darkness in his heart.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Peter Pan",
        "CharacterName": "Peter Pan",
        "Description": "A boy who lives in Neverland, where no one grows up. Peter can be stubborn, but deep down he's brave and just. He was upset that Wendy wanted to return to London, but in the end he wished her well.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Philoctetes",
        "CharacterName": "Philoctetes",
        "Description": "Trainer of countless heroes, including Hercules. Nowadays Phil runs the Coliseum and manages the games.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Piglet",
        "CharacterName": "Piglet",
        "Description": "Pooh's closest friend. Piglet is very shy, and when he's surprised he covers his eyes with his floppy ears.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pinocchio",
        "CharacterName": "Pinocchio",
        "Description": "A wooden puppet Geppetto made, brought to life by the Blue Fairy. To become a real boy, Pinocchio has to learn bravery, kindness, and honesty. He and Geppetto were swallowed by Monstro, but they escaped with a little help from us.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Pluto",
        "CharacterName": "Pluto",
        "Description": "The king's faithful dog. The strength of their bond goes beyond master and pet. He had left Disney Castle with Donald and Goofy, but is now on his own. His keen sense of smell might lead us to secrets yet uncovered.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The Queen of Hearts",
        "CharacterName": "Queen of Hearts",
        "Description": "A selfish ruler who commands an army of card soldiers. A Heartless stole the Queen's memory, but she accused Alice and put her on trial.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Rabbit",
        "CharacterName": "Rabbit",
        "Description": "A diligent gardener who's always busy with his vegetables. Sometimes Rabbit is a bit short-tempered, especially when Tigger bounces around in his garden.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku (SS)",
        "CharacterName": "Riku",
        "Description": "Sora's childhood friend. Baited by the darkness and used by Maleficent and Ansem, Riku once fought against Sora. In order to seal the door to darkness, Riku stayed with the king on the other side. His current whereabouts are unknown. Sora journeys in the hopes of finding Riku.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku (RR)",
        "CharacterName": "Riku",
        "Description": "A boy who was born and raised on a small group of islands. Riku dreamt of seeing other worlds, and so he forsook the islands—only to be seduced by the power of darkness. Enslaved by Ansem, pursuer of darkness, Riku clashed with his childhood friend Sora. But in the end, he was able to regain himself, and together with Sora closed the door to darkness. Still, the dark wounds in Riku's heart have yet to mend.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku Replica (SS)",
        "CharacterName": "Riku Replica",
        "Description": "A replica of Riku created by Vexen from the real Riku's data. Through Naminé's power he was infused with false memories and made to believe he was the real Riku. The truth has wounded him deeply.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Riku Replica (RR)",
        "CharacterName": "Riku Replica",
        "Description": "A replica of Riku created by Vexen from the real Riku's data. Unlike the real Riku, he wields darkness freely, but is burdened by the fact that he is an imitation.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Roo",
        "CharacterName": "Roo",
        "Description": "A feisty kangaroo who's full of energy. Little Roo wants to learn to bounce as high as Tigger.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sally",
        "CharacterName": "Sally",
        "Description": "Dr. Finkelstein's helper at the lab. He created her from various odds and ends. Sally is secretly in love with Jack.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sebastian",
        "CharacterName": "Sebastian",
        "Description": "Triton's music director and Ariel's guardian. Sebastian is constantly scolding Ariel for her escapades, but only because he worries for her safety.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Selphie",
        "CharacterName": "Selphie",
        "Description": "A perky girl from Sora's islands. Selphie is assertive and tends to leap before she looks. She also has a romantic side.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Simba",
        "CharacterName": "Simba",
        "Description": "Successor to his father as ruler of the Pride Lands. Sora need only call and Simba will appear and lend his strength.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (SS)",
        "CharacterName": "Sora",
        "Description": "A bright and spirited boy chosen by the Keyblade to battle the Heartless. It was Sora who defeated Ansem, ending his plan to shroud the world in darkness. However, Sora continued his journey, seeking the friends he lost during the struggle.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Sora (RR)",
        "CharacterName": "Sora",
        "Description": "Riku's childhood friend, and the hero of light chosen by the Keyblade to stand against the darkness. Riku fought Sora while bridled by darkness, but their friendship proved stronger, and they ultimately worked together to close the door to darkness.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tidus",
        "CharacterName": "Tidus",
        "Description": "A young boy from Sora's islands with a sunny personality and lots of energy. Tidus has no shortage of confidence either, and considers himself a champ at everything.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tigger",
        "CharacterName": "Tigger",
        "Description": "The one and only. Cheerful Tigger loves to bounce all day long. Sometimes his energy is too much for the others, but he always means well.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Tinker Bell",
        "CharacterName": "Tinker Bell",
        "Description": "A fairy with a jealous streak, especially when Peter pays attention to other girls.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ursula (SS)",
        "CharacterName": "Ursula",
        "Description": "The sea witch. She once lived in the palace, but was banished for scheming. Ursula deceived Ariel and stole the trident in an attempt to rule all Atlantica.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Ursula (RR)",
        "CharacterName": "Ursula",
        "Description": "The sea witch who plotted to rule all of the undersea kingdom Atlantica. Ursula appeared before Riku as a token of the indelible darkness in his heart. Vexen (SS): A man absorbed in his dubious research in Castle Oblivion. Vexen tried to destroy Sora by controlling Riku and pitting the two against each other. When this plan failed, he confronted Sora personally. Vexen (RR): No. 4 in the Organization. He, Lexaeus, and Zexion have been in the group since its inception, and there is no love lost between them and neophytes like Marluxia. After battling Riku, Vexen turned to events unfolding aboveground, but successive failures led to his termination by Axel.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wakka",
        "CharacterName": "Wakka",
        "Description": "A boy from Sora's islands. Despite being the oldest, Wakka is modest and takes good care of his friends.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Wendy",
        "CharacterName": "Wendy",
        "Description": "A dreamy English girl. Peter showed her the way to Never Land. Wendy really likes Peter, but decided to return home to London.",
        "AdditionalInformation": ""
      },
      {
        "Title": "The White Rabbit",
        "CharacterName": "White Rabbit",
        "Description": "A loyal retainer of the Queen of Hearts. He always carries out the Queen's orders, no matter what they may be.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Winnie the Pooh",
        "CharacterName": "Pooh",
        "Description": "A bear who lives in the base of a tree in the Hundred Acre Wood. Pooh loves to eat—especially honey. He's easygoing, but a little absent-minded.",
        "AdditionalInformation": ""
      },
      {
        "Title": "Yuffie",
        "CharacterName": "Yuffie",
        "Description": "A girl whose cheerful personality belies her painful memories. When she was still young the Heartless robbed her of her home. Never one to sweat the small stuff, Yuffie seems unfazed by her fuddled memory.",
        "AdditionalInformation": ""
      }
    ]
  }
}