{
  "KINGDOM HEARTS; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Led by a mysterious voice, Sora stepped through the door that marked the start of his journey. Sora, Riku, and I wanted to see the world beyond our island. One day, Sora came face-to-face with a man from another world. Meanwhile, Donald and Goofy received a letter from Mickey asking them to find the holder of a certain key."
    }
  ],
  "KINGDOM HEARTS; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "One fateful night, darkness consumed Destiny Islands. As Riku disappeared into the darkness, my heart managed to escape to safety inside Sora. The darkness overwhelmed Sora, and he awoke in an unfamiliar town."
    }
  ],
  "KINGDOM HEARTS; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Having been chosen by the Keyblade, Sora teamed up with Donald and Goofy. The trio traveled together through many worlds, locking the worlds' Keyholes in order to keep them safe from the encroaching darkness. Meanwhile, Riku awoke in the Dark Depths."
    }
  ],
  "KINGDOM HEARTS; Chapter 4": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "With his heart clouded by darkness, Riku stood in Sora's way. As they fought, Sora realized that his power came from his friends, not his weapon. When Sora found out that my heart had been inside him all along... he saved me without sparing a thought for what might happen to him. Now it was my time to save him. As I wished for that strength, something incredible happened. Hoping that we would never be separated again, I gave Sora my lucky charm."
    }
  ],
  "KINGDOM HEARTS; Chapter 5": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "The light emanating from Kingdom Hearts destroyed Ansem, the strongest darkness Sora faced. But the darkness behind the door still threatened to burst out at any moment. With Riku and Mickey on the inside and Sora on the outside, they sealed Kingdom Hearts from both sides. And so, Sora and his two friends continued on their journey."
    }
  ],
  "KINGDOM HEARTS Re:Chain of Memories; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora continued his journey in search of Riku and Mickey and found himself at Castle Oblivion. Using cards made from memories of the worlds they'd visited, the group continued deeper into the castle. Meanwhile, Riku awoke beneath the castle and was met by a mysterious voice. With Sora headed for the top floor, and Riku aiming for the ground floor, the two continued to climb, each on their own path."
    }
  ],
  "KINGDOM HEARTS Re:Chain of Memories; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "As Sora advanced through the castle, his memories started to fade. In exchange, new memories of Naminé grew clearer. It quickly became his goal to save her from where she was being held captive in the castle. Meanwhile, Riku was fighting the darkness within himself as he continued through the castle. Lying in wait to confront him was a boy who looked just like him-- a replica of himself created by the Organization. This replica was planted with false memories that caused him to stand in Sora's way."
    }
  ],
  "KINGDOM HEARTS Re:Chain of Memories; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Naminé had the power to overwrite the memories of Sora and those connected to him. The Organization used this power for their own gain. Even after discovering the shocking truth-- that his memories of Naminé were fake-- Sora still chose to protect her. He prepared for the final battle, eager to finally retrieve his lost memories."
    }
  ],
  "KINGDOM HEARTS Re:Chain of Memories; Chapter 4": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "The battle at Castle Oblivion came to an end. To regain his memories, Sora would have to forget all about Naminé. He fell into a deep sleep, but not before leaving himself a reminder to thank her when he woke up. Meanwhile, Zexion decided that Riku had outlived his usefulness. From within a shroud of magic, Riku heard Naminé. Riku accepted the power of darkness without fear, and he used it to defeat both Zexion and the replica of himself. Naminé offered to use her powers to lock away the darkness in Riku's heart for good, but he refused, choosing instead to wield its power as his own. Riku and Mickey set out from Castle Oblivion, continuing along the path where darkness lies hidden within light-- the road to dawn."
    }
  ],
  "KINGDOM HEARTS 358/2 Days; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Seven days after Roxas was given a name and a place in Organization XIII, he encountered No. 14, Xion, and the gears of fate began to turn. The Organization was made up of Nobodies, those without hearts, and their goal was to complete Kingdom Hearts in order to become whole again. To achieve this, the Keyblade that Roxas held was an indispensable tool. As the days passed, Roxas completed his missions. Along the way, he became closer friends with Axel and Xion. The Organization had another goal as well--the creation of replicas. They had copied Sora's scattered memories and powers from Castle Oblivion into an artificial replica, resulting in Xion. Riku found out that this is what was keeping Sora from waking up. And Xion was distraught to learn that she was nothing more than a puppet. Axel did what he thought was best for everyone... and Roxas left the Organization to find out who he truly was. Xion was determined to return her memories to Sora, so she paid a visit to Naminé. As she neared completion as a replica, Xion asked to be destroyed. And she wanted Roxas to be the one to do it. Trusting Roxas to set free the hearts they'd collected, Xion returned to the place she belonged-- inside Sora."
    }
  ],
  "KINGDOM HEARTS 358/2 Days; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Roxas headed for the Organization's castle, but Riku blocked his path. Upon learning that Roxas was Sora's Nobody, Riku unleashed all his powers of darkness to defeat him, paying no mind to the cost. Roxas awoke, ready to start a brand-new day of summer vacation."
    }
  ],
  "KINGDOM HEARTS II; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "In Twilight Town, Roxas was supposed to be enjoying his last week of summer vacation. But he kept having dreams about Sora, and all sorts of strange, unexplainable occurrences started happening around him. Roxas ended up at an abandoned mansion, where he remembered that he used to be a member of Organization XIII. He also learned that the world he knew was a fake one set up by DiZ to restore Sora's memories. With one day left, Roxas's summer vacation was over."
    }
  ],
  "KINGDOM HEARTS II; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora finally awoke and found a message written in Jiminy's journal. With some guidance from Mickey, he set off to continue his journey once more. Sora felt his heart grow heavy as the train carried him away from town. At the tower, Yen Sid warned him about Organization XIII. Mickey had set out to learn more about the Organization. Sora, Donald, and Goofy searched for him, again visiting different worlds."
    }
  ],
  "KINGDOM HEARTS II; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora returned to Hollow Bastion, where he learned the startling truth... He thought he had defeated Ansem, but that was actually an impostor. The real Ansem had an apprentice named Xehanort, whose Heartless called himself Ansem, seeker of darkness. And Xehanort's Nobody, Xemnas, was the leader of Organization XIII. The Organization's aim was revealed. They planned to collect all the hearts released by the Keyblade to create another Kingdom Hearts, and they would harness it for their own gain. Realizing he was being used, Sora almost gave up the fight. But with the help of a mysterious stranger, he pulled through and continued onward."
    }
  ],
  "KINGDOM HEARTS II; Chapter 4": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "To ensure that Sora would make it to Organization XIII's headquarters, Axel sacrificed himself. Roxas appeared within Sora and challenged him for the right to exist. But Roxas realized Sora's strength and disappeared. At last, Sora, Riku, and I were reunited. Kingdom Hearts loomed overhead, but Ansem the Wise managed to bring its completion to a halt. Sora, alongside Riku, faced the final battle with Xemnas, the last member of Organization XIII."
    }
  ],
  "KINGDOM HEARTS II; Chapter 5": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Xemnas was finally defeated... but, after the battle, Sora and Riku found themselves trapped in the realm of darkness. Suddenly, a bottle washed up on shore. The message inside led them back to the realm of light."
    }
  ],
  "KINGDOM HEARTS Re:coded; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "A strange entry was found in the journal that chronicled Sora's adventures. To investigate, the journal was converted to data, but it was full of bugs. Mickey called on Data-Sora to help them restore the world inside the journal. As he restored the datascape, more and more strange messages kept appearing. Mickey and the others should have been watching from the other side of the screen, but somewhere along the way Data-Riku, the embodiment of the journal, had imported them into the datascape to help solve the mystery of the message. Maleficent and Pete were causing all sorts of trouble with their plan to take over the real world through the data-scape. Data-Sora drew power from the connections with his friends in his heart and used it to fight and forge a path forward. He defeated Sora's Heartless, the bug in the data that had corrupted the journal. That should have been the end of this journey, but Mickey received word that a door to a new world had appeared, and he once again entered the datascape. On the other side of the door was Castle Oblivion. Led by a figure in black, Data-Sora repeatedly relived the pain residing in his heart. If he kept holding onto that hurt, he would be dragged down into the darkness... But Data-Sora realized that his pain was what tied his memories together. He swore to the cloaked figure, Roxas, that he accepted the pain. The hurt of those connected to Sora remained dormant in his heart. And to help find a way to face and heal that pain, Naminé had left the mysterious journal entry, \"Their hurting will be mended when you return to end it.\" Mickey and Data-Sora now knew the true meaning of those words. Data-Sora thanked Naminé, and they said their goodbyes. Mickey wrote Sora a letter detailing the events that took place in the datascape. \"You are who you are because of those people... They need you... And now the door to your next journey is ready to be opened.\""
    }
  ],
  "KINGDOM HEARTS Birth by Sleep; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Master Eraqus's three apprentices affirmed their bonds of friendship as they prepared for the Mark of Mastery exam. But Aqua was the only one to pass the exam and become a Keyblade Master. Leaving Terra no time for disappointment, the three immediately received word that creatures called the Unversed had emerged to threaten the world of light, and Master Xehanort had gone missing. Both Terra and Aqua were tasked with bringing the situation under control. Meanwhile, a masked boy left Ventus with a distressing thought. Terra resisted the call of darkness as he sought out Xehanort and the Unversed. Ventus chased after him... and Aqua carried out orders to monitor Terra. Everything was going perfectly according to Master Xehanort's plan."
    }
  ],
  "KINGDOM HEARTS Birth by Sleep; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "It turns out that when I was little, Aqua came to my rescue in Radiant Garden. Then she reunited with Terra and Ventus, but, once again, their paths and hearts quickly diverged. Terra was guided by a light to a young boy, Riku. He bequeathed Riku his Keyblade. Meanwhile, Ventus learned he would become the χ-blade, and Master Eraqus tried to seal him away. Determined to save his friend, Terra unleashed the power of darkness as he faced his own master. The χ-blade would form when pure light and pure darkness clashed. Ventus set out toward the Keyblade Graveyard to bring all of this to an end. "
    }
  ],
  "KINGDOM HEARTS Birth by Sleep; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Master Xehanort's plan was revealed at last. Terra, Aqua, and Ventus entered into a grueling final battle. As they fought, Xehanort summoned Kingdom Hearts. Terra's body became a vessel for Xehanort, but his lingering will and devotion to Aqua and Ventus remained attached to his armor. Even knowing that his heart would be destroyed in the process, Ventus fought to stop the χ-blade from forming. As Ventus struggled, Aqua confronted Vanitas, who had taken control of Ventus's body. Drawing strength from her friends, she destroyed the χ-blade."
    }
  ],
  "KINGDOM HEARTS Birth by Sleep; Chapter 4": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Ventus's heart fell into a deep sleep. Aqus faced off against Terra whose body was controlled by Master Xehanort. To restore his heart to him, Aqua fought with all she had. Xehanort drove Terra's heart out of his body. Terra fell to darkness. Refusing to lose her friend, Aqua sent him back to the realm of light. But he awoke with no memories and called himself \"Xehanort.\" Trapped in the realm of darkness and all alone, Aqua was about to give up the endless battle with darkness, when her connections to her friends appeared in the form of a brilliant light and saved her. Sora, still just a child, had previously joined his heart with Ventus's. The connection they shared brought Ventus's wounded heart back to him."
    }
  ],
  "KINGDOM HEARTS 0.2 Birth by Sleep -A fragmentary passage-; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "As Aqua wandered alone through the realm of darkness, familiar worlds from the realm of light appeared. Something was wrong... As she hurried onward, silent visions of Terra and Ventus emerged before her...and she was even forced to fight against a vision of herself. Aqua began to realize the vulnerability of her own heart, and desperately chased after her friends'  images. After defeating a massive Heartless, Aqua was finally able to speak with Terra, who had ties to the realm of darkness. But moments later, he was taken over by Master Xehanort. Aqua was saved just in time by Mickey. He was there searching for the Keyblade that belonged to the realm of darkness. Together, they arrived at Destiny Islands, which had fallen into darkness.  Aqua realized that she had been to this world before and mentioned that this was where she had met Sora and Riku, which helped Mickey find the Keyblade he was searching for. They had everything they needed, now they just had to close the door. Suddenly, Heartless appeared, and Aqua faced them knowing she'd be trapped in the dark realm. Having fulfilled her duty as a Keyblade Master, Aqua watched the world regain its light before her eyes as she fell to the depths of darkness. Years passed and preparations were made to search for Aqua. We all set off toward different destinations, each with our hearts as our guiding key..."
    }
  ],
  "KINGDOM HEARTS 3D [Dream Drop Distance]; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Master Yen Sid knew that Sora and Riku still had a lot to learn before they could stop Master Xehanort, so he prompted them to take the Mark of Mastery exam. The exam required the two to dive into Sleeping Worlds and reawaken them by unlocking their Keyholes. But an unfortunate encounter caused Sora and Riku to be flung into different worlds. Fighting alongside benevolent Dream Eaters, or Spirits, they carried on. Suddenly, a boy in a black coat appeared."
    }
  ],
  "KINGDOM HEARTS 3D [Dream Drop Distance]; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora and Riku continued traveling from dream to dream. However, the cloaked boy, Ansem, and Xemnas appeared everywhere Sora and Riku went, misleading them with every encounter. Meanwhile, Mickey was caught up in one of Maleficent's schemes. But he was saved by Lea, formerly known as Axel, from Organization XIII. Master Yen Sid agreed to make Lea a Keyblade wielder to catch Xehanort off guard in hopes of defeating him."
    }
  ],
  "KINGDOM HEARTS 3D [Dream Drop Distance]; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora thought he had completed his exam but found himself in the World That Never Was. There, he was lured into the depths of darkness and captured to become the thirteenth vessel for Master Xehanort. Meanwhile, Riku had arrived to find Sora trapped in a bad dream. Riku learned that he had unwittingly dived into Sora's dream and protected him from nightmares as he slept. Master Xehanort managed to regain his form, but he was caught off guard and was unable to carry out his plan. Then he vanished, his parting words foretelling a war that was yet to come..."
    }
  ],
  "KINGDOM HEARTS 3D [Dream Drop Distance]; Chapter 4": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "In order to wake Sora, Riku dived into his dream once more. Riku continued deeper into Sora's dream, where he encountered those whose hearts were sleeping inside Sora's heart. Thanks to their help, Sora managed to wake up safe and sound, and Riku was made a Keyblade Master. Lea had become a Keyblade wielder... and I was brought in to become a new member of the guardians of light."
    }
  ],
  "KINGDOM HEARTS III; Chapter 1": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "To prepare for the final battle with Master Xehanort, Sora set out in search of a way to regain his power of waking. In Olympus, he learned to fight for someone with all his heart. In Twilight Town, he searched for clues about Roxas. In a fairy-tale kingdom, he met one of the New Seven Hearts... and in Toy Box, he learned hearts can reside where you least expect them. Meanwhile, Lea and I were hard at work training to become Keyblade wielders... and Riku and Mickey found a clue to where Terra was."
    }
  ],
  "KINGDOM HEARTS III; Chapter 2": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Sora's journey continued. In Arendelle, he encountered a love true enough to thaw a frozen heart... and at the laughter factory in Monstropolis, he learned that Ventus resided within his heart. In San Fransokyo, he saw hearts that were being constructed from data. Meanwhile, Riku and Mickey were forced to confront Aqua, whose heart has fallen into darkness. With some help from Sora, Aqua was finally able to return to the realm of light. And the Land of Departure returned to its former glory. Ventus awoke thanks to Sora's regained power of waking, and he was able to save Aqua from Vanitas."
    }
  ],
  "KINGDOM HEARTS III; Chapter 3": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "\"Darkness will prevail, and the light expire.\" It all unfolded just as the Book of Prophecies foretold. But Sora refused to give up. His heart persisted against all odds. He used the power of waking and fought long and hard to save his friends. And so, the light's defeat was overwritten, and the guardians of light reassembled at the Keyblade Graveyard. The deciding battle with the True Organization XIII was about to begin. As the battle raged, Terra, Roxas, and Xion were revived and joined the guardians of light. But Master Xehanort still succeeded in summoning the true Kingdom Hearts. To stop Kingdom Hearts from unleashing its power, Sora went to the ancient city of Keyblade wielders, Scala ad Caelum, and the final battle began. As the fierce struggle ended, Master Xehanort gave up the χ-blade and abandoned his plans. Kingdom Hearts was sealed away. But it was still far from over. I had disappeared during the battle, and Sora was determined to bring me back. He set off on his journey once more, alone."
    }
  ],
  "Arrival": [
    {
      "Order": 0,
      "Character": "Even",
      "Line": "What's happening!?"
    },
    {
      "Order": 1,
      "Character": "Ienzo",
      "Line": "And just when things were going well."
    },
    {
      "Order": 2,
      "Character": "Ansem the Wise",
      "Line": "Something's wrong. Shut it down!"
    },
    {
      "Order": 3,
      "Character": "Kairi",
      "Line": "This place..."
    }
  ],
  "Lost Memories": [
    {
      "Order": 0,
      "Character": "Terra-Xehanort",
      "Line": "This world will be engulfed in darkness--everything you care about and everyone you love. If you truly possess the power of a princess of heart, your heart will resonate with a Keyblade wielder's, and I believe you can lead me to that wielder's world. That is the only possible way to save ours. You see, this is more than an experiment-- it's hope. Like most, you probably believe that nothing exists outside of this world you live in. And yet, there are countless other worlds. You can see them sparkle brilliantly in the night sky. Through that sea of stars, fate will guide your ship to where you are meant to be. However, if you arrive in a world that's neither of light nor darkness, but somewhere on the other side, your task will be far from easy. If that happens, you must abandon your search-- we have failed."
    }
  ],
  "Fated Meeting": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Who are you? Show your face!"
    },
    {
      "Order": 1,
      "Character": "Master Xehanort",
      "Line": "Not so fast, my dear."
    },
    {
      "Order": 2,
      "Character": "Kairi",
      "Line": "You're the one who keeps messing with my fate. If it weren't for everything that you've done, then Sora and everyone would be safe. Even if you're not really here and this is just a memory or illusion... I won't let you walk away!"
    },
    {
      "Order": 3,
      "Character": "Master Xehanort",
      "Line": "You're right. I set you adrift in another world and drastically altered the course of your fate. In the end you were destroyed by my hand, paving the way for Sora's disappearance."
    },
    {
      "Order": 4,
      "Character": "Master Xehanort",
      "Line": "You've become quite the Keyblade wielder! For a retired master, Yen Sid prepared you remarkably well. This world was created from the memories contained within your heart. You seek clues to Sora's whereabouts by using your memories of him to search through your own heart. But there's nothing for you to find here. I'm afraid the answer you seek lies in memories that are long gone."
    },
    {
      "Order": 5,
      "Character": "Kairi",
      "Line": "I have had enough of this!"
    },
    {
      "Order": 6,
      "Character": "Master Xehanort",
      "Line": "Ah, look who joined us. As I thought, your voice can't reach us here. Now I'm certain of where your heart is."
    }
  ],
  "The Answer": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "Thank you...Sora."
    },
    {
      "Order": 1,
      "Character": "Master Xehanort",
      "Line": "On the day that I sent you out from your world... Do you remember what it is I said to you? Those words hold the answer you seek. I may cause you to suffer, but I am a product of your heart. For that reason, I shall give you your answer."
    },
    {
      "Order": 2,
      "Character": "Terra-Xehanort",
      "Line": "Before, when my heart and body were still united as one, I told you about what would happen if we were to fail. \"If you arrive in a world that's neither light nor darkness but somewhere on the other side, your task will be far from easy.\" That is the answer I have for you."
    },
    {
      "Order": 3,
      "Character": "Kairi",
      "Line": "What does that mean?"
    }
  ],
  "Fictional World": [
    {
      "Order": 0,
      "Character": "Ienzo",
      "Line": "\"If you arrive in a world that's neither of light nor darkness, but somewhere on the other side, your task will be far from easy.\""
    },
    {
      "Order": 1,
      "Character": "Kairi",
      "Line": "Yes, he said that's the answer."
    },
    {
      "Order": 2,
      "Character": "Even",
      "Line": "Not of light or darkness, but on the other side?"
    },
    {
      "Order": 3,
      "Character": "Ienzo",
      "Line": "I've never heard of a place like that..."
    },
    {
      "Order": 4,
      "Character": "Even",
      "Line": "Something else he said perplexes me... \"Your voice can't reach us... I'm certain of where your heart is.\""
    },
    {
      "Order": 5,
      "Character": "Ienzo",
      "Line": "You would assume that he's referring to the realm of darkness, but... that clearly isn't the case here, wouldn't you say?"
    },
    {
      "Order": 6,
      "Character": "Ansem the Wise",
      "Line": "Where voices can't reach... The other side of our world, of reality... Unreality? A fictional world?"
    },
    {
      "Order": 7,
      "Character": "Ienzo",
      "Line": "Fictional?"
    },
    {
      "Order": 8,
      "Character": "Ansem the Wise",
      "Line": "I'm afraid such mysteries are beyond our comprehension."
    },
    {
      "Order": 9,
      "Character": "Kairi",
      "Line": "Maybe Mickey or Master Yen Sid knows."
    },
    {
      "Order": 10,
      "Character": "Riku",
      "Line": "Any news?"
    },
    {
      "Order": 11,
      "Character": "Kairi",
      "Line": "Riku!"
    },
    {
      "Order": 12,
      "Character": "Riku",
      "Line": "Kairi! You woke up!"
    },
    {
      "Order": 13,
      "Character": "Kairi",
      "Line": "Yeah, just now. How come you're here?"
    },
    {
      "Order": 14,
      "Character": "Riku",
      "Line": "Well, actually I found some info about Sora."
    },
    {
      "Order": 15,
      "Character": "Kairi",
      "Line": "Really? We got something too!"
    },
    {
      "Order": 16,
      "Character": "Riku",
      "Line": "You did?"
    },
    {
      "Order": 17,
      "Character": "Fairy Godmother",
      "Line": "Oh, excuse me, dears, I certainly didn't mean to startle you. If you're not expecting magic, it can be a surprise."
    },
    {
      "Order": 18,
      "Character": "Riku",
      "Line": "No kidding."
    },
    {
      "Order": 19,
      "Character": "Fairy Godmother",
      "Line": "Now then, I am the Fairy Godmother. And it's a pleasure to meet you all."
    },
    {
      "Order": 20,
      "Character": "Riku",
      "Line": "She came here at Yen Sid's request. He said she's got a clue that might help us find Sora."
    },
    {
      "Order": 21,
      "Character": "Kairi",
      "Line": "Yen Sid sent you?"
    },
    {
      "Order": 22,
      "Character": "Fairy Godmother",
      "Line": "That's right. To find Sora, we need three keys. First, Riku, and then of course there's you, dear Kairi."
    },
    {
      "Order": 23,
      "Character": "Kairi",
      "Line": "Okay..."
    },
    {
      "Order": 24,
      "Character": "Fairy Godmother",
      "Line": "With Riku's dreams and Kairi's memories, you two have already done your part."
    },
    {
      "Order": 25,
      "Character": "Riku",
      "Line": "Kairi's memories?"
    },
    {
      "Order": 26,
      "Character": "Ienzo",
      "Line": "Yes. We performed an examination of Kairi's heart and obtained an important clue from the lost memories it contains, which is that... there's another world on the other side of ours that's not of darkness or light."
    },
    {
      "Order": 27,
      "Character": "Kairi",
      "Line": "Riku, what did you dream?"
    },
    {
      "Order": 28,
      "Character": "Riku",
      "Line": "Oh, well since Sora disappeared, I've been having dreams about a large city with tall buildings. Apparently, that's the clue."
    },
    {
      "Order": 29,
      "Character": "Even",
      "Line": "A city..."
    },
    {
      "Order": 30,
      "Character": "Ienzo",
      "Line": "Maybe that's what Xehanort was talking about. A fictional world..."
    },
    {
      "Order": 31,
      "Character": "Riku",
      "Line": "A fictional world?"
    },
    {
      "Order": 32,
      "Character": "Ansem the Wise",
      "Line": "Yes, perhaps. The three realms of our world--light, darkness, and between-- these are all places we can travel to because they are on \"our side.\" This also includes the worlds of memories, data, and dreams. If I am correct, then this \"other side\" of our world from which voices cannot reach must be a place outside of our reality. Namely, it must be unreality, or fiction. But... that is the extent of our knowledge."
    },
    {
      "Order": 33,
      "Character": "Kairi",
      "Line": "So, I thought we should go to Mickey and Master Yen Sid to ask about it."
    },
    {
      "Order": 34,
      "Character": "Fairy Godmother",
      "Line": "Mmm, I'm not quite sure they'll be able to help you, my dear."
    },
    {
      "Order": 35,
      "Character": "Riku",
      "Line": "Then what now?"
    },
    {
      "Order": 36,
      "Character": "Fairy Godmother",
      "Line": "Oh, you forget; there are three people who hold the key. There's still one more. One with a strong will and a very precious dream."
    },
    {
      "Order": 37,
      "Character": "Kairi",
      "Line": "Who is it?"
    },
    {
      "Order": 38,
      "Character": "Fairy Godmother",
      "Line": "You'll see. I'll introduce you!"
    },
    {
      "Order": 39,
      "Character": "Riku",
      "Line": "Huh?"
    }
  ],
  "To the Other Side": [
    {
      "Order": 0,
      "Character": "Kairi",
      "Line": "This place..."
    },
    {
      "Order": 1,
      "Character": "Riku",
      "Line": "You know it?"
    },
    {
      "Order": 2,
      "Character": "Kairi",
      "Line": "Yeah... I came here with Sora, and also in my dreams while I slept. This is... the Final World. But there's no one here."
    },
    {
      "Order": 3,
      "Character": "Fairy Godmother",
      "Line": "That's not true. Why don't you look closer?"
    },
    {
      "Order": 4,
      "Character": "Kairi",
      "Line": "The stars. I never noticed."
    },
    {
      "Order": 5,
      "Character": "Fairy Godmother",
      "Line": "Yes, strong hearts gather here after death until they are ready to move on. I'm sure she's around here somewhere."
    },
    {
      "Order": 6,
      "Character": "Riku",
      "Line": "She?"
    },
    {
      "Order": 7,
      "Character": "Fairy Godmother",
      "Line": "The final key. We found you! We've been searching all over for you, my dear."
    },
    {
      "Order": 8,
      "Character": "Nameless Star",
      "Line": "Do I know you?"
    },
    {
      "Order": 9,
      "Character": "Kairi",
      "Line": "I'm Kairi. It's a pleasure to meet you."
    },
    {
      "Order": 10,
      "Character": "Nameless Star",
      "Line": "You're all able to retain your appearance in this world. I met someone else who could do that."
    },
    {
      "Order": 11,
      "Character": "Riku",
      "Line": "Um, so she's the final key?"
    },
    {
      "Order": 12,
      "Character": "Fairy Godmother",
      "Line": "That's right, dear. Now we finally have all three."
    },
    {
      "Order": 13,
      "Character": "Riku",
      "Line": "But how exactly can she help?"
    },
    {
      "Order": 14,
      "Character": "Fairy Godmother",
      "Line": "It's simple. She came from the world on the other side."
    },
    {
      "Order": 15,
      "Character": "Kairi",
      "Line": "What?"
    },
    {
      "Order": 16,
      "Character": "Fairy Godmother",
      "Line": "You see, she's very special. Her form was taken from her, but she managed to find her way here. If she goes back to her world, her heart will certainly be stolen. Right, dear?"
    },
    {
      "Order": 17,
      "Character": "Nameless Star",
      "Line": "Oh... yes. It seems you know a lot about me."
    },
    {
      "Order": 18,
      "Character": "Fairy Godmother",
      "Line": "A little, and I would use my magic to change you back if I could. But I'm afraid that's impossible while you're in this form. Don't fret, though. I believe that we'll find a way to make your dream come true very soon."
    },
    {
      "Order": 19,
      "Character": "Nameless Star",
      "Line": "My dream... come true?"
    },
    {
      "Order": 20,
      "Character": "Riku",
      "Line": "I want to help make that happen. Will it lead us to Sora?"
    },
    {
      "Order": 21,
      "Character": "Fairy Godmother",
      "Line": "Oh, I'm afraid it's not that simple. First, we must get to her world. She can open a path for us, and you can use the power of waking to go there."
    },
    {
      "Order": 22,
      "Character": "Riku",
      "Line": "The power of waking..."
    },
    {
      "Order": 23,
      "Character": "Nameless Star",
      "Line": "Sorry, but did I hear you say \"Sora\"?"
    },
    {
      "Order": 24,
      "Character": "Kairi",
      "Line": "Wait. Do you know him?"
    },
    {
      "Order": 25,
      "Character": "Nameless Star",
      "Line": "Yes. He was here. He encouraged me not to give up. Did something happen to him?"
    },
    {
      "Order": 26,
      "Character": "Riku",
      "Line": "Yeah. Sora disappeared. He's a good friend of ours, so we've been looking for him. Right now, we think he's in a big city full of tall buildings. Ring any bells?"
    },
    {
      "Order": 27,
      "Character": "Nameless Star",
      "Line": "A city full of tall buildings... Quadratum? It has more skyscrapers than any other city I know. That must be it."
    },
    {
      "Order": 28,
      "Character": "Riku",
      "Line": "Quadratum... Is that where Sora is?"
    },
    {
      "Order": 29,
      "Character": "Fairy Godmother",
      "Line": "There's no way of knowing, but I believe it is possible."
    },
    {
      "Order": 30,
      "Character": "Riku",
      "Line": "All right... Think you can help us?"
    },
    {
      "Order": 31,
      "Character": "Nameless Star",
      "Line": "I'm not sure exactly what's happening. But if Sora is in trouble, I want to help. Please, let me know what you need from me."
    },
    {
      "Order": 32,
      "Character": "Riku",
      "Line": "Thanks."
    },
    {
      "Order": 33,
      "Character": "Fairy Godmother",
      "Line": "I'm afraid this is as much as I can do. It's up to you, Riku, to take care of the rest."
    },
    {
      "Order": 34,
      "Character": "Kairi",
      "Line": "I want to go."
    },
    {
      "Order": 35,
      "Character": "Riku",
      "Line": "Kairi, that's not--"
    },
    {
      "Order": 36,
      "Character": "Kairi",
      "Line": "Yeah, I know. I want to go with you. But... I know that I can't. I need to finish training. I need to become stronger. And when I do, I'll be right there next to you and Sora."
    },
    {
      "Order": 37,
      "Character": "Riku",
      "Line": "Good."
    },
    {
      "Order": 38,
      "Character": "Kairi",
      "Line": "But first I'll go explain everything to Donald and Goofy and to Mickey and Master Yen Sid."
    },
    {
      "Order": 39,
      "Character": "Fairy Godmother",
      "Line": "Be careful out there, dear. And try not to do anything too reckless. Come straight back if you encounter any trouble."
    },
    {
      "Order": 40,
      "Character": "Riku",
      "Line": "I will."
    }
  ],
  "Another Key": [
    {
      "Order": 0,
      "Character": "Mickey",
      "Line": "Riku went alone!? But that's way too dangerous! I hafta go after him now!"
    },
    {
      "Order": 1,
      "Character": "Yen Sid",
      "Line": "Do not be hasty, Mickey."
    },
    {
      "Order": 2,
      "Character": "Mickey",
      "Line": "But Master Yen Sid, he's all alone in a world we know nothing about!"
    },
    {
      "Order": 3,
      "Character": "Yen Sid",
      "Line": "Precisely. We have never faced something like this before, which is why we must remain calm."
    },
    {
      "Order": 4,
      "Character": "Mickey",
      "Line": "But--"
    },
    {
      "Order": 5,
      "Character": "Yen Sid",
      "Line": "Kairi. This information you bring us, it comes from Xehanort during his time as a researcher?"
    },
    {
      "Order": 6,
      "Character": "Kairi",
      "Line": "Yes."
    },
    {
      "Order": 7,
      "Character": "Yen Sid",
      "Line": "Then that means he must have been aware of this other world for quite some time."
    },
    {
      "Order": 8,
      "Character": "Mickey",
      "Line": "But we defeated Xehanort. Is there anybody else we can ask?"
    },
    {
      "Order": 9,
      "Character": "Yen Sid",
      "Line": "When I was still serving as a Keyblade Master, it was known that the ancient masters had crossed over into another world. I surmise that Xehanort looked more deeply into that world."
    },
    {
      "Order": 10,
      "Character": "Mickey",
      "Line": "The ancient Keyblade Masters..."
    },
    {
      "Order": 11,
      "Character": "Yen Sid",
      "Line": "For now we must reach out to those in Radiant Garden, the Land of Departure, and Twilight Town who are searching for Sora to inform them of what we have learned and have them halt their respective efforts. Donald, Goofy, I leave this to you."
    },
    {
      "Order": 12,
      "Character": "Donald",
      "Line": "Yes, sir!"
    },
    {
      "Order": 13,
      "Character": "Goofy",
      "Line": "Yes, sir!"
    },
    {
      "Order": 14,
      "Character": "Yen Sid",
      "Line": "And Kairi, will you continue your training as you were before?"
    },
    {
      "Order": 15,
      "Character": "Kairi",
      "Line": "Actually, I'd like to study under Master Aqua."
    },
    {
      "Order": 16,
      "Character": "Yen Sid",
      "Line": "That is an excellent idea. I approve."
    },
    {
      "Order": 17,
      "Character": "Kairi",
      "Line": "Thank you."
    },
    {
      "Order": 18,
      "Character": "Yen Sid",
      "Line": "And you, Mickey."
    },
    {
      "Order": 19,
      "Character": "Mickey",
      "Line": "Yes."
    },
    {
      "Order": 20,
      "Character": "Yen Sid",
      "Line": "I task you with the investigation of this new world and how it is related to the ancient Keyblade Masters."
    },
    {
      "Order": 21,
      "Character": "Mickey",
      "Line": "But how?"
    },
    {
      "Order": 22,
      "Character": "Yen Sid",
      "Line": "You'll begin... in the world of Scala ad Caelum."
    }
  ]
}