{
  "Script": {
    "None": [
      {
        "Order": -1,
        "Character": "None",
        "Line": "None"
      }
    ],
    "Promise of a Reunion": [
      {
        "Order": 0,
        "Character": "Marluxa",
        "Line": "Along the road ahead lies something you need. However---in order to claim it you must lose something that is dear to you."
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Huh?"
      }
    ],
    "To Lose or Claim Anew": [
      {
        "Order": 0,
        "Character": "Goofy",
        "Line": "Hey, ya think it's OK to barge in? The king?! King Mickey's here? Really? 'Cause now that ya mention it, I was kinda thinkin' the same thing. A-hyuck! Guess great minds think alike. Gawrsh, maybe it's contagious. Hey, fellahs, shouldn't we shut the door behind us before we go? Sora!"
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "But we gotta do it, if we're gonna find the king...Something just told me he'd be here, OK? Oh, no, Jiminy. Ya don't mean that— No, no. Something's screwy. We gotta go take a look. Wak! Where are you going?! Aw, don't be ridiculous! Come on, let's go, Goofy! Wak! Heartless! Oh yeah? I'll try some magic! THUNDER! Come on. THUNDER! THUNDER!! Come on… Blizzard? FIRE! Why isn't it working?"
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "Seriously? Me too! One look at this castle, and I just knew- Our very best friends---they're here. All right. That way. To the door. Are ya scared? That's it! Who are you? Castle Oblivion? I miss? Riku! You mean Riku's here?! Huh? What'd you do?! What's this, a card? C'mon---let's go."
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "Wait, hey, hold on! It can't be just a coincidence! Yep, I had it too, mm-hmm! I had the exact same feeling."
      },
      {
        "Order": 4,
        "Character": "Marluxia",
        "Line": "I should think it's obvious. The moment you set foot in this castle, you forgot every spell and every ability you ever knew. In this place, to find is to lose, and to lose is to find. That is the way in Castle Oblivion. Here you will meet people that you have known in the past. And you will meet people you miss. If what you want...is to find him...I merely sampled your memories. And from them, I made this. To reunite with those you hold dear---It is a promise for the reunion you seek. Hold the card to open the door. And beyond it, a new world. Proceed, Sora. To lose and claim anew, or to claim anew only to lose..."
      }
    ],
    "Got It Memorized": [
      {
        "Order": 0,
        "Character": "Marluxia",
        "Line": "Well, Sora? Did you enjoy meeting your memories? What do you have to give? What do you want? Then perhaps you'd like to test him."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Yeah, it was good to see everyone. But what do you really want from me? Uh...sure."
      },
      {
        "Order": 2,
        "Character": "Axel",
        "Line": "Hello! No hogging the hero. Perhaps I would. My show now, Keyblade master. Who am I? Oh, my name's Axel. Got it memorized? Good, you're a quick learner. So Sora, now that we're getting to know each other better...don't you go off and die on me now!"
      }
    ],
    "When Sleeping Memories Awaken": [
      {
        "Order": 0,
        "Character": "Goofy",
        "Line": "Another one. What's it do? You mean King Mickey and Riku? Sora---do ya need it?"
      },
      {
        "Order": 1,
        "Character": "Jiminy Cricket",
        "Line": "Hmm. Kinda looks like the card you used when you made Traverse Town. "
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "Then I guess we're gonna need it to keep going...You were testing us. Why me? The light within darkness...I'm gonna figure it out for myself. If you're in my way---"
      },
      {
        "Order": 3,
        "Character": "Axel",
        "Line": "That's right. Did you really think after that introduction, I would give up oh so easily? And you passed. Congratulations, Sora! You're ready now---ready to take on Castle Oblivion. You will need to follow your memories. Trust what you remember and seek what you forget. Then you will find someone very special. You will just have to give some more thought to who it is that's---most important to you. Our most precious memories lie so deep within our hearts that they're out of reach. But I'm sure that you can find yours, Sora. You have lost sight of the light within the darkness. And it seems that you've forgotten that you forgot. Would you like me to give you a hint? Good answer. Just what I'd expect from the Keyblade master. But be forewarned... When your sleeping memories awaken, you may no longer be who you are now."
      },
      {
        "Order": 4,
        "Character": "Donald",
        "Line": "Axel! Don't worry, Sora! We'll protect you!"
      }
    ],
    "An Adventure Forgotten": [
      {
        "Order": 0,
        "Character": "Jiminy Cricket",
        "Line": "Hmm...Well, ya see, what Axel said back there worries me. What could he have meant by, \"You may no longer be who you are\"? Of course. Still, you can't be too careful."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "What's wrong, Jiminy? I may no longer be me? How can I be anyone else? We'll be okay. Whatever it is they're cooking up, we'll be able to handle it together. Hmm... When was that? Goofy, sure you didn't make it up?"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Yep. Feels like just about anything could happen here in Castle...Oblivi - Oblivi - Obliv---Oh, yeah! Now I remember! 'Course we will, like at that creepy castle we explored together, the one with all those weird contraptions. Gawrsh, oh it was, uh... Holla... Holly... Holler... Sorry. I can't remember. I don't think so..."
      },
      {
        "Order": 3,
        "Character": "Donald",
        "Line": "Castle Oblivion! Uhh... I can't remember. What was it called? Wak! Stop goofing around."
      }
    ],
    "Journal Pages Vanished": [
      {
        "Order": 0,
        "Character": "Goofy",
        "Line": "Hmm...It's that creepy castle that I was talking about earlier... I know I didn't imagine it. 'Cause that was the castle where Sora had to use the Keyblade to free Kairi's heart. Then he just disappeared! And I was so worried. How could I ever forget that? What's the matter?"
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Huh? What's the matter? Aww... You forgot that? 'Cause I remember perfectly. That's easy! It was...Jiminy, help me... Is it in your journal? What'll we do?!"
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "Oh! It was when I turned into a Heartless! Wait. That happened...in a castle? Then what's it called? The journal's blank... What's going on?"
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "Every word! I finished the first volume right before we got to this castle. Now then, if I can just find it... Oh, here we go! Let's have a look... Oh! How could it be?! All my entries--- They're gone! Every page is blank! How could this have happened? I'm so careful with the journals! All that hard work is gone…"
      }
    ],
    "Are We Losing Our Memories?": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Something's screwy. Journal pages don't just vanish! Huh? Losing? Our memories? So the higher we go, the more we'll forget? Does that mean everything and everybody will be forgotten? Do you want to go back? I don't know...So, if there's nothing here that can make you forget about your friends...then we have nothing to be scared of! Let's go! How come you didn't forget about that?!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "What if...it's more things? Goofy was telling us about another castle we'd been to... But none of us really remembers it. Do ya think... Could it be that we don't remember because we're losing our memories? So if we keep going, we'll lose more... Guess it really is Castle Oblivion. Riku and Kairi too...Of course I didn't! Huh...You're right. Thank you, Goofy. But when I turned into a Heartless...who was the one who took forever to notice and kept clobbering me?"
      },
      {
        "Order": 2,
        "Character": "Jiminy Cricket",
        "Line": "Hold on! Remember what that mystery fella said? \"In this place to find is to lose, and to lose is to find.\" It musta been our memories he was talking about losing!"
      },
      {
        "Order": 3,
        "Character": "Goofy",
        "Line": "Don't worry, fellahs! We might forget about where we've been or what things we've seen, but we won't forget who are friends are. C'mon, Sora, when you turned into a Heartless, did you forget about me and Donald? There ya go! No matter what happens, you won't forget your friends."
      }
    ],
    "What’s Important": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Aw... I hope the king is gonna be okay...I had to be sure that I hadn't forgotten him. Good! I remembered---we're on a quest to find the king. You got it, Goofy! That's good. 'Cause I don't want to forget..."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Why bring that up? And me--- I'm looking for Riku. He was with the king when the door closed. Hm. I guess there's no way we'll forget the most important memories."
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "How'd that go for ya? I remember that too. The king helped save everything by staying on the other side of the door to darkness. I think..."
      }
    ],
    "The Smiling Siren": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "You seem pretty intrigued by this Sora kid. Haven't decided yet... I think what intrigues me more is what you see in him. They lose their minds and their feelings... They're consumed by the darkness. It's the strength of his heart... That's what interests you. Why the Keyblade chose Sora's heart."
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Are you telling me you're not, Larxene? There was a time he became a Heartless. And if one becomes a Heartless— Right. But not Sora. He held on to his feelings, even as a Heartless. And there's only one other man who's been able to do just that. To unlock the mysteries of the heart. Isn't that the Organization's mission?"
      }
    ],
    "The Good Luck Charm": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Hey, I wonder if there's anything we've forgotten...What is it? Hey, Sora. Where did you go?"
      },
      {
        "Order": 1,
        "Character": "Goofy",
        "Line": "Hmm... If we did, what would it have been? I can't think of anything, so maybe that means that I really am losing my memories.But whatever they were, they couldn't have been very important memories, right? We better keep goin'."
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "Right, or else I don't think you would have forgotten it. Look. A good luck charm Kairi gave me. It's special to her, so I promised that I would return it. I'll never forget making that promise. It's why I could never forget Kairi. Am I right, Kairi? Huh?! Oh... Do I know...that girl? Sorry. Never mind."
      }
    ],
    "Memories Come Awake": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Who could that have been before in my memory? It wasn't Kairi... But another...girl? Maybe... I think her name was...Aah! Um, sure. Man. It was right on the tip of my tongue..."
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Sora! Let's go! You want to find Riku and the king, don't you?"
      }
    ],
    "Memory of Another": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "I remember! There was another girl! No, no, I mean on the islands where I used to live. Besides Kairi and Riku, there was one other girl I was friends with. The four of us played together all the time. Yeah...I guess I forgot all about her. I think...she just suddenly went away when I was still really little. I'm not sure. But it's been coming back in pieces as we go through the castle. I don't remember. I feel kinda dumb. We said we weren't gonna forget our friends, and well now... I can't even remember her name. Sora..."
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Huh? What do you think made you remember that now?"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Huh? What? A girl? Where? Gawrsh, do ya remember her name? Aww, you shouldn't be worryin', none! If it's been coming back to you in pieces... You're sure to remember her name just like everything else!"
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "Sora... Seems to me that's the first time you've mentioned her."
      }
    ],
    "Girl on the Island": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Sora, is there anything else you remember about that other girl? Oh, I bet you'll remember it in no time! Come on, Goofy! Let's get going. We've got to forget things faster."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Hmmm...just bits and pieces. Well, uhh...She was quiet...and always drawing. When we'd go to the beach, she'd draw a picture instead of swimming. Sometimes she'd draw us, too! She was really good. I remember Riku and I fighting over who she'd draw next. But one day, she was gone, just like that. I think the grown-ups knew the reason. They might even have tried to explain some of it to me. But I was little. I probably didn't understand what was happening. I remember crying after she was gone. But...that's all. I still don't remember her name. Like those guys said... \"Our most precious memories lie so deep in our hearts, that they're out of reach.\" All that stuff about finding being losing and losing being finding... I didn't get it at first, but maybe this is what they meant."
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Maybe you could try tellin' us some more stuff about her. Who knows? It might even help ya remember other things. So we should forget in order to remember? Gawrsh, Sora, I think I'm a little jealous of ya. How come me and Donald and Jiminy aren't rememberin' more of the stuff from our memories?"
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "I must point out. Sora keeps remembering things instead of forgetting them. It seems to me forgetting things may be the only way---to reach the memories buried deeper down inside each of us."
      }
    ],
    "The Key to the Plot": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "Just as we intended. You had your fun on the first floor. So this time, it's my turn. I'm not going to just give it to him. Well... Do I detect a soft spot? I'm not going to break the toy. I'm not dumb. I know that you're in on it, too... But keep it under your hood at least until the time is right."
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "We'll continue with our plan. Let's see how far this group will go. Don't break him. Don't forget. Sora is the key. We need him if we're going to take over the Organization. You would have been wise to have done the same, Larxene."
      }
    ],
    "Larxene the Ruthless": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "I bet you work with Axel!"
      },
      {
        "Order": 1,
        "Character": "Larxene",
        "Line": "Too clever. I'm Larxene. So...are you enjoying your stay at the castle? I bet it's nice to peel away all the worthless memories and awaken the true memories...that lie deep in your heart. Although...it seems that you're still forgetting the most important thing here. When that poor girl hears that you've forgotten her name, why...it'll just...it'll break her heart. Yes, she is. You see, the bad guys are holding her captive somewhere deep inside the castle. And you obviously are the hero, so you have to go save her. Although...I'M a bad guy, so you have to go through me! What a shame... You've been wearing it all this time and forgot? No...That's not possible. The memory has to be engraved somewhere deep inside your heart. Sora---you think carefully, now. What oh what could it be? And who gave it to you? Sora... Sora... You're getting it now! Release the memory from within your heart! Well, it's about time. That's right...Naminé. Yes, she's the one that gave you that tacky little good luck charm. Not that you even bothered to remember. No surprise, seeing as you also couldn't remember her NAME. Talk about heartless! I can't believe you! It'd serve you right if I decided to smash this piece of junk! Oh, it's important to you? Ten seconds ago, you didn't even know what it was!"
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "True memories? Poor girl? Do you know her?! Is she...here? What's that? Is that thing mine? Na... Na...mi...? Nami... Naminé. Let it go! Naminé gave me this. It's very important to me!"
      },
      {
        "Order": 3,
        "Character": "Goofy",
        "Line": "Sora!"
      }
    ],
    "A Card for the Baby": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "Hmph. You're not as bad as I thought. You really are a hero. A heartless hero. Oh, does it hurt because it's the truth? You are just a baby. And if you're gonna be a baby, then here ya go. I created another card from your memories, you know. Be a good boy and say \"thanks.\" Ta-ta!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Who asked you?! Wait, Larxene! Where are you? Don't you dare hide from me! Show yourself! I hate this... Why'd I need someone like that to bring back...Naminé's memory?"
      },
      {
        "Order": 2,
        "Character": "Jiminy Cricket",
        "Line": "Sora, calm down! She's not coming back."
      },
      {
        "Order": 3,
        "Character": "Goofy",
        "Line": "Sora?"
      }
    ],
    "Vexen the Scientist": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "Whew... Throwing that battle wore me out. How dare you! You don't appreciate the nuances of— Huh? Vexen! Grr...Hmph. Well, here we go again. It's just an excuse so you can carry out your little experiments. That's all. What he actually is is a toy."
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Really? It looked to me like you just plain lost. How can we help you, Vexen? It's not very often we see you topside. Whatever. You can do what you want. But you know, I think testing Sora is just a cover for testing your valet. Anyway... Since you came all this way, you're gonna need this. A humble gift to my elder. I hope you use it to put on a very good show for us."
      },
      {
        "Order": 2,
        "Character": "Vexen",
        "Line": "An ungainly effort. How could you be humbled by someone of such limited significance? You shame the Organization. I came to lend you a hand. You obviously believe this Sora has much potential, but I remain unconvinced he is truly worth such coddling. I think an experiment would show if he really is of any value to us. I'm a scientist. Experiments are what I do, yes. Valet? He's the product of pure research. Hmph. You should just learn to be quiet."
      }
    ],
    "To Save Naminé": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Sora, not so fast! You'd be too. He just remembered a friend but found out she's in trouble!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "We don't have time! They've got Naminé. We gotta rescue her!"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Phew, Sora sure does seem like he's upset. Good point. I guess if we heard that the king was in danger, we would be pretty upset about that, too."
      }
    ],
    "Reunion with Riku": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "You're... Riku?! What are YOU doing here? Huh? I didn't mean that...Are you crazy? C'mon. I came all this way looking for YOU! Naminé's...? Why not?! Did I... Did I do something? Is it my fault? Riku...What's---What's wrong with you?! We're supposed to be friends! Riku, stop it!"
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Not happy to see me? Lemme know if I'm getting in the way---ya know, of something that's more important. Hmph. Spare the excuses. I bet that you had all but forgotten about me. But you're not anymore, right? Now it's only Naminé that you're looking for. You don't care about me. Just like you never cared... ...at all about her feelings. Hmph. I knew it. Never even gave it a thought, did you? Just cuz you want to see Naminé---sorry---doesn't go both ways. Tell ya the truth, Naminé doesn't even want to look at your face. You should ask your memories...why Naminé disappeared from the islands. Remember that, and you'd know. Go home, Sora. I'll care for Naminé. Anyone who goes near her......goes through me! Please, Sora. Since when have you ever cared about me? Naminé's not the only one who's sick of looking at you. So am I!"
      }
    ],
    "The Wordless Friend": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Riku! Please wait!"
      }
    ],
    "Always Smile": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Riku! Where are you? Don't worry about me. Riku...what happened? But we got rid of Ansem for good. Ya sure? So he just forgot? Yeah. Okay. Huh? You're right."
      },
      {
        "Order": 1,
        "Character": "Goofy",
        "Line": "Sora, are you okay? Then I wonder what is wrong with Riku...Jiminy's right. You shouldn't push your friends away. Always smile! That was the promise we made to each other the first time we met! We promised to never forget to keep smiling!"
      },
      {
        "Order": 2,
        "Character": "Jiminy Cricket",
        "Line": "Hmmm... Sure was strange. Almost like Ansem was back controlling Riku again. I know... You're thinking Riku isn't your friend... But that's just not true. Well, I know he said some awful things to you back there... But you gotta remember---we are in Castle Oblivion. Why, folks lose their memory here a little bit at a time. Riku's probably just forgotten that the two of you were such close friends. That's all. My guess is that's so. But Sora...instead of being sad, we have to figure out a way to help Riku get his memory back. If we all work together, why, we're sure to get you through this. No need to mope."
      },
      {
        "Order": 3,
        "Character": "Donald",
        "Line": "Hold on... The king! If he's with Riku, he might be in danger! Sora... Sora, do you remember our very first promise? Always smile!"
      }
    ],
    "Fighting Friends": [
      {
        "Order": 0,
        "Character": "Riku Replica",
        "Line": "Take the hint... I told you to go home. I don't remember ever asking you to rescue me. You're the one who forgot. I told you at Kingdom Hearts when we closed the door... \"Take care of Kairi.\" Give it up. I'm not going back to the islands---for anything. You can have those losers. Already forgot 'em. What about you, Sora? Do you actually remember what they all look like? Don't feel bad. That's what this castle does to you---after a while. It's good. You forget all the useless stuff and remember for the first time what really matters. I remembered it, Sora. I now know the one thing that is most important to me. Protecting Naminé. Nothing else matters---not a thing. Go ahead and try."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Not until I rescue you 'n Naminé. Did you forget? Kairi's there---waiting for us both to come home. It's not just for Kairi! What about the rest? That's enough! Of course I rememb— Hey...Riku... I think I'll jog your memory."
      }
    ],
    "Out of Reach": [
      {
        "Order": 0,
        "Character": "Riku Replica",
        "Line": "Hmph. Too bad, Sora. You can fight me all you want, but I still won't remember a thing. Together---right. So like you......Sora---you're always trying to worm your way into my heart! Hmph, you forgot that, too? You never cared. It never mattered to you!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "C'mon, Riku... Let's quit fighting---let's go help Naminé. Hold on! When did I ever do that? You won't push me away."
      }
    ],
    "We Nobodies": [
      {
        "Order": 0,
        "Character": "Axel",
        "Line": "Does it hurt, Naminé? Watching your two childhood friends fight all because of you? You have my sympathies. From the heart. But don't waste your time. We Nobodies can never hope to be somebodies."
      }
    ],
    "Sora, Riku, and Naminé": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "I don't get it. Riku and I---we both want the same thing. Both of us want to help Naminé out. How come we're fighting each other? I mean, Riku and I have argued about stuff in the past, but...Hm... I really thought so, too, but...maybe Riku doesn't...You're right. We three were never apart. Me 'n Riku... ...and Naminé."
      },
      {
        "Order": 1,
        "Character": "Goofy",
        "Line": "Could be 'cause ya care what happens to each other."
      },
      {
        "Order": 2,
        "Character": "Donald",
        "Line": "You can't give up. You're friends---tied together. Sora, Riku, and... and... What was her name?"
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "Hm. It seems our memories are fading mighty fast. Sora, we gotta hurry. I bet Riku will come around if you just talk to him."
      }
    ],
    "Where is Riku?": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Where'd Riku go?"
      },
      {
        "Order": 1,
        "Character": "Goofy",
        "Line": "Guess he must've finally got tired of fightin' with ya."
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "I sure hope so."
      }
    ],
    "Marluxia’s Graceful Blade": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "So what's going on, Vexen? Your Riku was supposed to counter Sora. What's he waiting for? Where is he?  A-ha! Oh, I see now! I would have never guessed that. So sorry, Vexen. Predictable response. Forget it. Men without hearts are so boring. Who needs a half-baked good-for-nothing, anyway?"
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "He's hiding somewhere to lure Sora deeper into the castle, right? I suppose we should just leave it at that, you know. \"Traitors are eliminated.\" I believe that's what the rules say. You give a challenge like that to Vexen and he'll seriously want to eliminate Sora."
      },
      {
        "Order": 2,
        "Character": "Vexen",
        "Line": "Silence! You're one to talk. As if you have such a heart to speak of yourself. Marluxia! Disappoint YOU? You go too far! In this Organization, you're No. 11! I'm No. 4 and I will not have you— Ng...Pity to be so ignorant. As you're only able to see the surface of things, I should not expect you to appreciate my true might. What? Your insincerity is comforting."
      },
      {
        "Order": 3,
        "Character": "Marluxia",
        "Line": "That's enough. Vexen, the simple fact is that your project was a failure. You'd best not disappoint us again.I've been entrusted this castle and Naminé by our leader. Defying me will be seen as treason against the Organization. Vexen, you cannot win against Sora. Oh? Then let us watch as you prove it. None of us wish to be suspicious of a comrade. That would be an unfortunate denouement. What to do? Your hero is soon to be wiped from existence. But I believe there is a certain promise that he made you. Isn't that right, Naminé?"
      },
      {
        "Order": 4,
        "Character": "Naminé",
        "Line": "...Yes."
      }
    ],
    "A Promise to Naminé": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "WOW! The tenth floor... We've gotten up pretty high."
      },
      {
        "Order": 1,
        "Character": "Jiminy Cricket",
        "Line": "And that must mean we've lost ten whole floors' worth of our memories. Sora, it's still not too late. Don't you think we should turn back? An old promise? What would that be? Of course. We understand, Sora."
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "Can't do it...because...that would break an old promise that I made. On the islands, I promised Naminé---that I'd keep her safe, no matter what. But I forgot it... I didn't remember until I started forgetting everything else! A promise between the two of us... That's why I can't leave. Now that I remember the promise, I have to keep it."
      }
    ],
    "I Am Vexen": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Who are you?! Come on, of course not. You don't mean— Then...you're the one... You're the one who's been controlling him! What have you done with him?"
      },
      {
        "Order": 1,
        "Character": "Vexen",
        "Line": "I am Vexen. I have come to collect your debt, Sora. Oh, but you do. You owe me for reuniting you with your former friend. Indeed, I do. I'm the one who brought Riku to you. I see no need to give you information about where Riku is. After all— Why trouble you in your final hour?"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "A debt? Sora, do you owe somethin' to this guy?"
      }
    ],
    "A Forbidden Memory": [
      {
        "Order": 0,
        "Character": "Vexen",
        "Line": "As I expected, you weren't one to die very easily. I wouldn't be so sure. Did you even notice? I was delving deep into your memory as we fought. And here... Look what I found. A card crafted from all the memories that are locked in the other side of your heart."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "As if I'd ever lose to you! Wait! Memories...in the other side?"
      }
    ],
    "Eliminate the Traitor": [
      {
        "Order": 0,
        "Character": "Axel",
        "Line": "If Sora disappears, that would mess up the Organization's plans. Haven't a clue, really. Maybe you could spell it out for me. No taking that back later."
      },
      {
        "Order": 1,
        "Character": "Marluxia",
        "Line": "I trust that you know what you need to do. Vexen has clearly committed a treasonous act against the Organization. You must eliminate the traitor."
      }
    ],
    "The Card of Mystery": [
      {
        "Order": 0,
        "Character": "Jiminy Cricket",
        "Line": "A card made outta memories from \"The other side of your heart\"? Hmm, I wonder what it does."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "We'll find out soon enough. It's the only one we have left. No other way to move forward."
      }
    ],
    "Memories That Bind": [
      {
        "Order": 0,
        "Character": "Goofy",
        "Line": "What's wrong? It could be like with Naminé. You forgot lots of other stuff---and that's why you remember this place now. It could be like with Naminé. You forgot lots of other stuff---and that's why you remember this place now."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Something...feels really strange. I'm sure I don't know this place, but it's starting to feel like it's familiar to me...No, and that's what's strange...No... It's different. With Naminé---my memories...sort of came drifting back to me, a little piece at a time. But not now. It's not memories---just this idea that I must have been here before. Naminé, of course! Whatever it is that I'm feeling, I bet it's just another one of your mean little tricks! Cut the riddles! You're wrong! I don't know this place! Like YOUR Riku? Worth nothing? That's enough! YOU'RE the one who changed Riku! Every word you've said is a lie! I'd never throw away my heart! I'm gonna take you down and save Riku and Naminé. THAT'S what's in my heart!"
      },
      {
        "Order": 2,
        "Character": "Donald",
        "Line": "You must have come here sometime before."
      },
      {
        "Order": 3,
        "Character": "Vexen",
        "Line": "So, feeling nostalgic? Sora...a question, then, for you... Your memories of Naminé or your feelings here---which of the two of these is more real, I wonder. The memory's wiles can be cruel. In its silence, we forget. In its obsession, it binds our hearts. I told you--- This place was created solely from another side of your memory. It is on the other side of your heart that the memory of this place exists. It is your heart that remembers. If you remain bound by the chain of memories and refuse to believe what is truly found inside your heart... ...then throw it away. You are not a Keyblade master---just a slave to twisted memories. Yes... Exactly like my Riku. Your existence is worth nothing!"
      }
    ],
    "Vexen’s End": [
      {
        "Order": 0,
        "Character": "Vexen",
        "Line": "Urrgh... You have such strength, even at the mercy of your memory— Just put him back? The Riku you speak of...has but one fate, to sink into the darkness---and you will share that fate, Sora! If you continue to seek the girl, Naminé, the shackles will tighten, you'll lose your heart...and end up becoming Marluxia's pawn! Axel, why...? No... Don't do it! No... Please don't! I don't want to---"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "None of that matters! Just put Riku back! Marluxia? What does Naminé have to do with— Axel! What are you--- What ARE you people?!"
      },
      {
        "Order": 2,
        "Character": "Axel",
        "Line": "Yo, Sora. Did I catch you at a bad time? I came to stop you from talking too much...by eliminating your existence. We are just Nobodies who have no one to be, yet we still \"are.\" But now you can be nothing instead of just being a Nobody. You're off the hook. Goodbye. Hm... Don't know. I wonder about that myself."
      }
    ],
    "Conspiracy of Rebellion": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "Nice work. I say good riddance to that blabbermouth. Not just Sora's. It was yours, too. We weren't sure if you actually had it in your bones to take out a fellow member. Well, I guess that you did. It's time to join up. Taking over the Organization will be like child's play with the three of us. Of course. He wants to see Naminé, so why don't we just give him what he wants? But I'm warning you. You'd better not do anything to betray Sora's feelings. Do you understand me, little one?"
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Marluxia... You used Vexen to test Sora's strength, didn't you? So that's where Sora comes in."
      },
      {
        "Order": 2,
        "Character": "Marluxia",
        "Line": "Rejoice, Naminé. The time is near for you to meet the hero that you've been longing for. All you need do is layer Sora's memories, and bring his heart closer to you."
      },
      {
        "Order": 3,
        "Character": "Naminé",
        "Line": "I'm...glad. I understand. Sora... Even if you come for me---what then?"
      }
    ],
    "Matching Memories": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Riku! You still want to fight? But Vexen's gone, so now you're free! You did? You made a promise! With a toy sword! Because...that was the promise I made to her that night! I would protect her! I said it! YOU're the one who wasn't there! That was when she gave her good luck charm to ME! See? Huh? Wha--- TWO of them?!"
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "You'll hurt Naminé if you go further. It doesn't matter what happens to him. I'm protecting Naminé from you. That's what's in my heart. Sora, I made a promise to Naminé. I promised to...keep her safe. There was a meteor shower...this one night when she and I were little...Naminé got scared and said, \"What if a shooting star hits the islands?\" So I told her- \"If a shooting star comes this way, I will protect you!\" What... How do you know about that? Don't lie! You weren't the one there that night! Her what?! Tell me... Where did you get that? Sora...good try. That must be a fake. I've got the real one right here! Fakes should be destroyed!"
      }
    ],
    "The Fake Charm": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Riku...Huh? It's just like mine. How'd he get this? Whoa!"
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Isn't that Naminé's good luck charm? Whoa!"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Whoa! It turned into a card!"
      }
    ],
    "The Falling Out": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Aww...I don't understand what's going on...It DOES matter. How can two of you have the same memory? You can't both be right. Now Naminé is the only thing you talk about. No, that's not it— Sora!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Let's just keep moving, okay? It doesn't matter. I'm wrong? Fine, then don't believe me! Then let's ask Naminé! That should clear it up. Look, we don't have time to sit around. So let's GO. What's THAT mean? Think ahead? What is the matter with you guys? Do you want me to abandon her?! Then do whatever you want! You can lay back and take a nap for all I care! I'M going to find Naminé!"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "That's not what he meant. We're just kinda worried. Sora, what happened to ya? Well, ya always get real touchy when it comes to stuff about Naminé...But before we came to this castle, you didn't even remember what her name was. It doesn't make sense. Maybe you should just slow down and think ahead about some of these things. Sora!"
      }
    ],
    "The Islands Falling Apart": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "The island!"
      }
    ],
    "The Girl That Never Was": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Okay...I have to keep her safe... Naminé! Can you hear me? Naminé...It's you... It's really you. I've been through so much just to see you. Naminé? Don't worry. I'm here because I promised that I would protect you. Huh? Naminé?! What... What are you saying? What's gotten into you? Weren't we inseparable, always together? But then you had to go away... I came here so I'd never lose you again! Of course it was! I know I've forgotten a lot of things in this castle, but never anything about you! Look! You gave this to me, didn't you? What am I supposed to do...Who's most special to me? That's an easy one. It's you, Nami---"
      },
      {
        "Order": 1,
        "Character": "Naminé",
        "Line": "Sora... You really came for me. Yes. I wanted to see you, too. But this isn't right. I messed up. I wanted to see you... But this isn't the right way. I was lonely for so long. I just couldn't bear it anymore. So I called out to your heart and had you come all the way out to this place. You came for me and I'm so...so happy, but...but to your heart I had to— Sora... Thank you. And I'm sorry. I'm not supposed to be in this picture. That's true. That isn't me. I'm not there. I don't really exist inside your heart. I don't exist in anyone's heart. I never have existed anywhere. Was it really me you wanted to see? You have it! My good luck charm. No, Sora! You can't believe me! Think, Sora. Think just one more time. About who's most special to you. Call out to that piece of memory that glimmers faintly deep inside your heart. No matter how far away the light gets, your heart's voice will always reach it."
      }
    ],
    "The Person Most Special": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Naminé! It isn't you. The person most special to me--- It's not you...Right? But then who...who is she? Cuz I can't...think of her name. If she's so special to me, then why can't I remember?"
      },
      {
        "Order": 1,
        "Character": "Naminé",
        "Line": "No. The girl you really care about... The one who was always with you... It's not me. It's her. Because I went into your memories and---"
      },
      {
        "Order": 2,
        "Character": "Riku Replica",
        "Line": "Let ME explain this. Plain and simple. Your memory is a train wreck. You're not the one who's meant to protect Naminé. It's supposed to be me! But you and your messed-up memories are always in the way, Sora!"
      }
    ],
    "Larxene’s Sneer": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Riku! Aah! Riku...Riku...? Riku! RIKU! What did you do? What did you do to him? Smashed...his heart?! Then...what's gonna... What's gonna happen to Riku? What do you mean? Quit the games! Not Riku? A fake?! Naminé...Then...my memories...are all...You'll pay...Naminé! Maybe not. But still...I made...a promise. A promise I made to Naminé to keep her safe. Maybe my memories are fake.But the promise is real to me. That's why---I'll keep it. Huh? Donald! Goofy! You found me!"
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Want some more? Looks like I win. You are through!"
      },
      {
        "Order": 2,
        "Character": "Naminé",
        "Line": "Sora! Riku, stop! I said STOP! Don't! I know, but---"
      },
      {
        "Order": 3,
        "Character": "Larxene",
        "Line": "Broke his heart. I'd say more like she smashed it, really. Oh, you're so much fun to watch. If it's Riku you're worried about, then don't. Because Riku was never really here. Do you really think I'm just gonna say it? That's too easy! Oh, what to do? All right, have it your way, then. I know it'll kill you to hear this, but I think I can live with that. That thing lying there is just a puppet that Vexen made as an experiment. No more than a toy. It's laughable, really. It called you a fake, but IT was a fabrication all along. Fake in every possible way. It was only finished recently. How could it remember anything? You get it? Its memories with Naminé were just planted, not real. Yup. That means, all this time, it's been picking fights with you over memories---that were counterfeit, trumped up, and completely bogus. Isn't that the truth, Naminé? Oh, so cute...but behind this little face, you do awful things. You're so stupid. Don't you get it now? That's what Naminé's powers are about! She can enter, rearrange, and even create new memories---of anything, even things that never happened. The girl you've been trying to protect all this time---is really a manipulative witch who shackles people's hearts! Oh, you do get it! Lies, lies, all lies! Just Naminé's illusions, nothing more. Binding you in the chains of your own memory was central to our trap. It makes me tingle to think how easily you were duped. So close to it— we were almost there. This was our only chance to turn the Keyblade master into our puppet, but--- That jerk Axel---he used Naminé to betray us! So now, I'm left with no choice but to eliminate you! Huh? It's a little late for the witch to grow a conscience. Last time I checked---YOU'RE the one who fooled around with his memories creating this mess. I should tell you that I'm in an EXTREMELY foul mood. Thanks to you, all our plans are ruined! What's this? Are you upset? And you don't even actually know her! What? Hmph. You're such an idiot. There is no promise and there never was! You're just delusional. Must you insist on playing the hero? Whatever. If that's the way you want it... You're going down alone! Okay... Have it your way. More pain for you means more fun for me!"
      },
      {
        "Order": 4,
        "Character": "Donald",
        "Line": "Not if we can stop you! And we promised! We promised that we would protect you! And that is how it's going to stay!"
      },
      {
        "Order": 5,
        "Character": "Goofy",
        "Line": "Of course we did. We were worried about you! You won't ever be alone. It's always been the three of us and we stick together..."
      }
    ],
    "Fake Memories and Real Feelings": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "No... No! I refuse to lose to such a bunch of losers! I think I'm...I'm fading?! No, this isn't...the way I... I won't...ALLOW..."
      },
      {
        "Order": 1,
        "Character": "Goofy",
        "Line": "You must be Naminé! It's good to meet ya. We're friends of Sora's and my name is— Congratulations, Sora! You finally found your friend. I'm so happy for ya! So ya did what he told ya to do because you were lonely? It's okay. Sora always gets like this every time he's around a girl! Naminé, Marluxia is gonna be up there, so maybe you'd better stay down here."
      },
      {
        "Order": 2,
        "Character": "Naminé",
        "Line": "You're Goofy, and you're Donald. Of course. It's my fault, after all. I took the people and memories that were inside Sora's heart...and little by little, I replaced them with false memories. Made up. It was fake. Sora never really promised me anything. Me being with him on the islands---that was a lie, just like everything else. We never met. I was never Sora's friend— No. You see, in all of your true memories, I was never really there. I can fix everything if we go to the thirteenth floor. But Marluxia, he— If I didn't obey, he said I'd be locked in this castle forever. I've been alone for so long…I'm so sorry...Oh... Of course. I know I really don't have the right to. What? Sora...Thank you. Okay. Please be careful, Sora."
      },
      {
        "Order": 3,
        "Character": "Donald",
        "Line": "Yeah, but how did you know that? Hey... What about Sora's promise? Oh, brother! That's a bit much. Too bad. Good friends don't forget the good stuff! Oh boy! I can't wait to get my memory back!"
      },
      {
        "Order": 4,
        "Character": "Jiminy Cricket",
        "Line": "Gee, there sure are a lot of questions... Naminé, I know this probably won't be easy for ya...but could ya tell us what happened? Gee, then that must mean it was your magic that made the rest of us lose our memories, too. Is there any way for us to ever get 'em back? Bet I know who that is. Was he the fellah who made you tamper with all of our memories?"
      },
      {
        "Order": 5,
        "Character": "Sora",
        "Line": "And you were never anything more---either...Don't be. Please don't cry...That's not what I meant! It's like this... I'm really not happy about you messing with my memories. But...you know---I can't really get mad at you for it, either. These memories you gave me... In my head, I know they're lies---but they still feel right. Like the promise I made. I said I would protect you and that I wouldn't make you cry...not ever. Naminé...if you cry now---I'll feel guilty, like I let you down. So don't cry...please. Until I get my memories back, smile and try to be happy. It's easier on me that way. Aw, cut it out! I thought you both lost your memories, too! Come on...There! That's it! That's the Naminé I remember. Yeah...I really liked it when you used to smile. Of course, that was really only in my fake memories. But what I'm feeling now definitely isn't fake. It's real. Well, then, let's go. Yeah. Maybe you could look after Riku? We'll come get you when it's over. I'll be okay... I promise!"
      }
    ],
    "A New Promise": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "Who was it? Who's most important to me? Nothing...No. I only remember Naminé. C'mon, do you guys remember anything at all? Huh? Courage...Whatever happens---we're friends."
      },
      {
        "Order": 1,
        "Character": "Donald",
        "Line": "Can't you remember? No. Sorry, Sora. It's important, but I just can't remember... I don't want to be, but I'm getting scared. Huh? Yeah! Let's do it! Even if we get scared, or in trouble---or even if we get separated---All for one, and one for all!"
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Then we should really make a promise! What you said back there kinda got my brain a-thinkin'. Whenever you make a promise that's super-duper big--- Maybe it gives you the courage to face the scary stuff! or even if we sorta forget each other---"
      }
    ],
    "Axel vs. Marluxia": [
      {
        "Order": 0,
        "Character": "Marluxia",
        "Line": "You have some nerve to show your treasonous face around here...some nerve indeed— Why let Naminé go? If it weren't for your needless meddling--- We could have turned the Keyblade master to come and serve us. Since when were you suspicious of us? So you only eliminated Vexen to obtain proof of our plan? Oh..."
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Treasonous? I don't know what you could possibly be talking about. Ohh, right, your big plan. You use Naminé to rewrite Sora's memory piece by little piece. And he turns into her total puppet. Then, using Naminé and Sora together, you and Larxene overthrow the Organization. Am I right? I would say that YOU are the traitor, Marluxia. Do either one of us have the heart to believe anyone? That, I didn't want to do, but it was your order. Remember the order- \"You must eliminate the traitor.\" I always follow orders, Marluxia."
      }
    ],
    "Axel’s Dancing Flames": [
      {
        "Order": 0,
        "Character": "Axel",
        "Line": "Larxene paid the price for disloyalty when she disappeared... You must do the same! The Organization's betrayed. In that name, I will annihilate you. Well, had to try it once, you know. Is that your shield? Won't do you any good, I'm afraid. Oh? Oh, come now. You're Marluxia's puppet already? Hmph. Now, Sora. We've got more in common than you might think. I'd really rather not fight you... But I can't dishonor the Organization, now, can I?"
      },
      {
        "Order": 1,
        "Character": "Marluxia",
        "Line": "That line's not you. I wonder. Are you listening, Sora? Axel says he's willing to harm Naminé to get me. You won't let that happen, will you? Hmph."
      },
      {
        "Order": 2,
        "Character": "Sora",
        "Line": "After I finish you, he's next!"
      }
    ],
    "Axel Vanishes": [
      {
        "Order": 0,
        "Character": "Axel",
        "Line": "You're better than I thought you'd be. It was worth saving you after all. Sorry, I would hate to kill the suspense."
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Saving me? What d'ya mean? Axel!"
      }
    ],
    "Phantom Promise or Not": [
      {
        "Order": 0,
        "Character": "Marluxia",
        "Line": "You've defeated Axel. The Keyblade's power---how I've longed to make it my own. You've no chance of winning. Naminé... Erase Sora's memory. That's right. Sora's heart will be destroyed. I'd rather have preferred him unmarred, but he can be rebuilt---more to my liking with time. Naminé, do it. Then you will— You ignorant fool. If Naminé uses her powers to erase your memory,you'll be nothing but an empty shell. Your heart will no longer be able to feel or to care. Just like---Vexen's pathetic imitation of your Riku. It can't be! You're a shell---a shell who has had everything taken! Everything! Imbeciles...You would knowingly shackle your heart with a chain of memories born of lies? You would be one who has a heart, yet cast aside your heart's freedom? You turn from the truth because your heart is weak--- You will never defeat me!"
      },
      {
        "Order": 1,
        "Character": "Sora",
        "Line": "Let Naminé go! Do it, Naminé! I don't care! You can erase my memory! Because who will I look after if I don't have Naminé? So just do it! Erase my memories. Destroy my heart. I promised! I'll always protect you! You have to believe me! I don't need any memories to take on someone like Marluxia! See, I'll have all my friends' memories, so I can piece my own together again! Riku!"
      },
      {
        "Order": 2,
        "Character": "Naminé",
        "Line": "But if I do that…No. Sora forgave me even when I deceived him. So how could I destroy his heart? There's no way! I don't care what happens to me. I won't hurt Sora! I won't do it! Sora..."
      },
      {
        "Order": 3,
        "Character": "Goofy",
        "Line": "His heart, destroyed? Sora, why'd you say that?! Donald's right. He and I can remember everything for Sora!"
      },
      {
        "Order": 4,
        "Character": "Donald",
        "Line": "You can do that? You bet! Even if Sora forgets it all, Goofy and I won't forget!"
      },
      {
        "Order": 5,
        "Character": "Riku Replica",
        "Line": "Take another guess. No. Just an imitation. What can you possibly think I ever had? Both my body and my heart are fake. But...there is one memory I'll keep...even if it's just a lie! Whether it was a phantom promise or not... I will protect Naminé!"
      }
    ],
    "To the Last Battle": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "Is he gone?"
      },
      {
        "Order": 1,
        "Character": "Marluxia",
        "Line": "You could say that. However, what you destroyed was merely an illusion of me."
      },
      {
        "Order": 2,
        "Character": "Riku Replica",
        "Line": "So what! Another imitation. You don't...mind? All right."
      },
      {
        "Order": 3,
        "Character": "Sora",
        "Line": "He's really...in there? I knew it. I can feel his power. It's trying to destroy my heart. Riku... Protect Naminé. Should I?"
      },
      {
        "Order": 4,
        "Character": "Naminé",
        "Line": "Yes."
      },
      {
        "Order": 5,
        "Character": "Goofy",
        "Line": "Gawrsh, we'll just take care of him together!"
      },
      {
        "Order": 6,
        "Character": "Donald",
        "Line": "Sora! C'mon!"
      }
    ],
    "The Heart-Lorn World": [
      {
        "Order": 0,
        "Character": "Marluxia",
        "Line": "Soon the emptiness will shatter your heart---here in this world of nothingness! As lightless oblivion devours you---drown in the ever-blooming darkness!"
      }
    ],
    "Your Own Heart": [
      {
        "Order": 0,
        "Character": "Sora",
        "Line": "You okay, Riku? Wait! Who cares if someone created you? You are you and nobody else. You have your own heart inside you. Those feelings and memories are yours and yours alone. They're special! Riku! Riku… All right. We all really trust you. Not even you? Do I have to...to choose? Make me like I was."
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Not Riku. I'm a fake. I can't remember why I was created or where or when... All that's inside of me---is time with you and Naminé. But I know those memories are not real. It's all right. I'll deal. Sora, you're a good guy. I don't have to be real to see how real your feelings are. That's good enough."
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Gee, Naminé, can't you use your magic to put Riku's memory back to normal? What d'ya mean?"
      },
      {
        "Order": 3,
        "Character": "Naminé",
        "Line": "Well, I— Yes. Not remembering something doesn't really mean that it's gone. When you remember one thing, that leads to remembering another---and then another and then another. Our memories are connected. Many pieces are linked together like they're in a chain---that makes up each of us. I don't actually erase any memories---just take apart the links and rearrange them. You still have all your memories. Yes, but first, I have to undo the chains of the memories I made on my own. After I've done that, I have to gather up the memories scattered across each of your hearts and then reconnect them. It might take some time. But I think it might work. No---it will work. I'm sure. It's my turn to look after you. Yes. You won't be able to remember anything about what happened here. I'm sorry. It's the only way, I'm afraid. Sora, you have a choice. You can lose your memories of this castle and reclaim your old ones...or keep your memories here and give up the memories that you've lost. Yes. Oh, okay. Nobody needs to keep a bunch of memories that aren't real, right? You want to remember all of the people who are really important to you. Anybody would choose that."
      },
      {
        "Order": 4,
        "Character": "Donald",
        "Line": "Can you put our memories back?"
      },
      {
        "Order": 5,
        "Character": "Jiminy Cricket",
        "Line": "So you can put 'em back together? Oh... Wait a second! You said you had to undo the links of the memories you made. But that means—"
      }
    ],
    "Promise in the Light": [
      {
        "Order": 0,
        "Character": "Donald",
        "Line": "To remember again, we have to sleep in that? But how are we gonna thank you? Oh, good. That makes me feel better."
      },
      {
        "Order": 1,
        "Character": "Naminé",
        "Line": "Yes. It's going to take a little time, but I'll take care of you. Good night, Goofy. You too, Sora. All of this may have started with a lie...but I really am glad that I can meet you, Sora. Goodbye. You're going to forget making that promise. Yeah, you're right. Okay, it's a promise. A promise... Huh... Sora, some of your memories' links are deep in the shadows of your heart and I won't be able to find them. But don't worry--- You made another promise to someone who you could never replace. She is your light. The light within the darkness. Remember her, and all the memories lost in the shadows of your heart will come into the light. Look at the good luck charm. I changed its shape when I changed your memory--- But when you thought of her just once, it went back to the way it was. Don't worry. You might forget about me...but with our promise, I can come back. Yes. One day the light---it will be ours, and it will bring us together. Til then---I'll be in your heart."
      },
      {
        "Order": 2,
        "Character": "Goofy",
        "Line": "Gawrsh, when we wake up, we won't remember who you are anymore... Well, good night, then, Naminé."
      },
      {
        "Order": 3,
        "Character": "Jiminy Cricket",
        "Line": "Don't worry about that! I'll just make a big note in my journal. And it will say, \"Thank Naminé.\""
      },
      {
        "Order": 4,
        "Character": "Sora",
        "Line": "Okay. Yeah, me too. When I finally found you, and even when I remembered your name, I was happy. The way I felt then--- That was no lie. No, not goodbye! When I wake up, I'll find you. And then there will be no lies. We're gonna be friends for real. Promise me, Naminé. If the chain of memories comes apart, the links will still be there, right? So the memory of our promise will always be inside me somewhere. I'm sure of it. Good. Until later. Another promise...Kairi! My friends... Naminé? A promise is a promise. Right. Forgotten---but not lost."
      }
    ],
    "REVERSE/REBIRTH": [],
    "The Slumber’s End": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Where am I...Who's there?! Between...what? The king! Where's the king?! Together we closed the door to darkness. After that— Hmph. As if I'm some kind of demon. What's this? This seemed like a boring place to take a nap anyway. A door to the truth, huh..."
      },
      {
        "Order": 1,
        "Character": "Ansem the Wise",
        "Line": "Stay asleep. You should remain asleep. Here, between light and dark. You came drifting here by yourself. You did not have the strength to overcome the darkness. Or...maybe you were close to it. Hmm. Turn from the light. Shut your eyes. Here blanketed by the darkness, sleep is safety. Sleep is eternal. But... It is a door to the truth. Take it and your sleep ends, as you take the first step toward the truth. But know this- the truth will bring you pain. Will you still go? There is no return to the security of sleep. That was very well said, Riku."
      }
    ],
    "Ansem of the Dark": [
      {
        "Order": 0,
        "Character": "Ansem the Wise",
        "Line": "Why do you shun the darkness? Darkness is your weapon. It is time you learned you must accept it. Stop resisting. Accept the darkness. You have no choice......if you are to serve me again! Oh. You don't seem surprised. Clever boy. I knew you'd be the one to most appropriately serve me. And now, surrender to me again---Did you really think you could do me harm? A weakling like you couldn't even defeat Sora---and you had darkness on your side. You are weak. You need darkness. Surrender. Bow to darkness. Bow to me. Only the darkness can offer to you all of the strength that you will need. You think that feeble little light can save you from the darkness that I command? You shall feel my dark powers---in your bones! "
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "Hmph. Come on, I know you heard me---every word I said to Maleficent. What do you mean? I thought it was you...Ansem.All you have been talking about is the darkness. I can only assume you wanna pull me back in...so you can play puppet master. You're crazy!  Not a chance! Excuse me...for being weak...Grr... That's not gonna happen! That voice...! Your Majesty?! I got it. I won't lose to darkness. Not today. Give me all you've got. I'll give it right back!"
      },
      {
        "Order": 2,
        "Character": "Mickey",
        "Line": "You're wrong! That's right! Remember Riku, you're not alone. Listen close. The light'll never give up on you. You'll always find it, even in the deepest darkness!"
      }
    ],
    "Ansem’s Offer": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "What, that all you got? Huh? Don't worry, I'm not running. Give it. I'll enter the world and in the end, if I haven't given in to the darkness... Then I win. What'd you do?! You still think that I'd rely on darkness?"
      },
      {
        "Order": 1,
        "Character": "Ansem the Wise",
        "Line": "It seems to me that you are intent on resisting the darkness. All right. Then see it for yourself. This is a card crafted from your memory. Advance through the world it creates and soon, you will understand... Chasing after light is not the way. It will not give you distance from the darkness. There is no running from the darkness. I have one more gift for you. I simply tempered the darkness that yet remains in your heart. To use it or not is your choice. I'll be waiting, Riku...for you to sense it and yield to the darkness in your heart!"
      }
    ],
    "The Organization": [
      {
        "Order": 0,
        "Character": "Zexion",
        "Line": "Don't I even warrant a hello, Lexaeus? Nice to see you too, Vexen. It's such a shame. The Organization used to be the rope that bound us together. Visitors. I picked up two scents in the castle's lowest basement. One of them was Maleficent---If you would let me finish... The scent belonged not to the real Maleficent but to a very convincing double. But I truly cannot say much beyond that since the double is no more. Our other visitor saw to that. I do not know for sure... But the scent was very similar to that of the Superior. Now---what to do?"
      },
      {
        "Order": 1,
        "Character": "Vexen",
        "Line": "What is going on here, Zexion? I want an explanation. You're only number 6! How dare you— Don't be absurd. The witch is gone. She cannot return from the realm of darkness of her own volition. And yet, not exactly the same, was it? This truly piques my curiosity."
      },
      {
        "Order": 2,
        "Character": "Lexaeus",
        "Line": "Let it go, Vexen. Zexion, tell us. What did you detect? And who is it? We wait---see what develops."
      }
    ],
    "The Smell of Darkness and the King’s Light": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Something smells...funny... What's that scent? It's so familiar...Darkness. It's the smell of darkness. I can't believe this is happening. The darkness even seeped into my skin...Your Majesty! What happened? I can see...right through you. Request? Light within darkness...Okay... I'll do my best. You're an illusion...Guess we are."
      },
      {
        "Order": 1,
        "Character": "Mickey",
        "Line": "Don't worry, Riku. Funny, huh? I can only send a bit of my power to this place. That's why I've got a request for ya. Listen, Riku. Just because darkness holds you, don't let go of who you are. You've got to fight the darkness inside you! It won't be easy to do, I know. But please don't forget. Even in the darkest darkness, there's always a little bit of light. You and I have seen it. The far welcoming light inside the door to darkness... The light of Kingdom Hearts---it will show you the way. Please don't give up. Believe in the light. That's a request from my heart. Trust me. I'll try to find a way to reach you. I'll get there, I promise. Don't worry. We shook hands in our hearts, remember? We're connected, you and me."
      }
    ],
    "The Other Hero": [
      {
        "Order": 0,
        "Character": "Zexion",
        "Line": "I have identified the scent. It is Riku. His existence---it was once doubled in the darkness. What I want to know is why he appeared here in Castle Oblivion. Sora is in the castle? Without even bothering to consult us."
      },
      {
        "Order": 1,
        "Character": "Vexen",
        "Line": "Riku, you say? Has he emerged from the realm of darkness? Fascinating... That's why you mistook him for the Superior. The dark power given to Riku facilitated his escape from its realm. That's really quite simple. His existence resonates with that of another hero. He arrived earlier. Marluxia is already using Naminé's unique powers to meddle with Sora's heart. It seems he desperately wants the Keyblade master for himself--- What a foolish plan, indeed. Sora's is not such an interesting existence. The entity that holds true value---is Riku, the hero of darkness."
      }
    ],
    "One Who Walks in the Twilight": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Huh? Are you with Ansem? Riddles were never my thing. Try again. Maybe... Like you said, there really is darkness left inside of me. But so what? Darkness is my enemy! And so are you for reeking of that awful smell!"
      },
      {
        "Order": 1,
        "Character": "Vexen",
        "Line": "I take it you're Riku. You are half correct. Let us say that he is not the Ansem with which you are familiar. He is Ansem and he is not Ansem. Perhaps a \"Nobody\" best conveys the idea. He belongs to neither the light nor the dark but walks the twilight between. Catching on now? Oh yes, you also stand in between the light and the darkness. It appears we have much in common. Oh ho! So it's a fight you want. Very good---I shall take you on!"
      }
    ],
    "Stolen Data": [
      {
        "Order": 0,
        "Character": "Vexen",
        "Line": "I find, coursing through you, there is a darkness of formidable power growing! Well worth the trouble of aggravating you. All this excitement has provided me with invaluable data. Many thanks, Riku!"
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "What?! Tch... It was a trick all along."
      }
    ],
    "Zexion the Tactician": [
      {
        "Order": 0,
        "Character": "Lexaeus",
        "Line": "What's happening to Sora? And then there is Axel. Who knows what that one is thinking...But Vexen despises Marluxia. Think of the mess it would make."
      },
      {
        "Order": 1,
        "Character": "Zexion",
        "Line": "Naminé's powers are being used to shuffle his memories as we speak. Marluxia may well succeed in getting his puppet. Sora would be a valuable asset to the Organization...but Marluxia and Larxene's actions, they---leave me quite Uneasy. Vexen should take care of this. His replica is soon to be completed. So we must tell him. Isn't it better that Vexen clean up the mess than leave it to us?"
      }
    ],
    "Riku vs. Riku": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Huh?! What are you supposed to be? So you're a fake me. Are you calling me a coward? Grr..."
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Surprised? I guess you should be. After all, I look just like you. I'll tell you what I am. I'm an exact replica of you that Vexen made from your data. Not a \"fake\"! I don't care if you're \"real\"! You're not better! We share the same body and the same talents. But there is one easy way to tell us apart, though! Unlike you, I fear nothing. You're afraid of the dark! The darkness inside you still frightens you, no matter what you say. But I'M different. I embrace the darkness. I can make it do whatever I want. So... I can wipe the floor with you!"
      }
    ],
    "A Replica’s Pride": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Hey, Fake. I thought I heard you say you were gonna wipe the floor with me. Then let's fight now! Enough! Come back! No way. I'm not a coward..."
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Hmph. Don't forget, I'm still new. I'll get stronger and stronger. The next time we fight, you're finished! It's nice having darkness on my side. You are SO missing out. How could you be scared of something that can be so thrilling? Hmph. So now the coward is playing tough. So long, Real Thing. Hope you don't miss me."
      }
    ],
    "Vexen’s Replica": [
      {
        "Order": 0,
        "Character": "Vexen",
        "Line": "So, how was the real thing? In the meantime, would you be interested in meeting another who's considered a hero? We'll see... Yes... I intend to make good use of you."
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "He's spineless. In no time at all, I'll be better than him. mean Sora. I hear he's somewhere in the castle. You want me to take care of him? No worries. The real Riku was nothing. Sora won't be, either. They're no match for me."
      }
    ],
    "What You Should Be": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Come out! Show yourself, Fake! What are you saying? Isn't he just a copy of me? When have I been afraid of the dark? I... Be quiet!"
      },
      {
        "Order": 1,
        "Character": "Ansem the Wise",
        "Line": "Fake? Oh, no... That's not exactly the right word. More like a model. He is an example of what you should try to be. He accepts the darkness...just like you once couldn't help but accept me. But now you are afraid. Perhaps YOU are the one who is being fake. Fake when you pretend to have no fear. Inside of the card-worlds...you grappled desperately with the darkness. Desperation is fear. You fight the darkness because it is what frightens you. Stubborn boy. Then continue your fight, if you must. Eventually, you will learn. You cannot resist the darkness."
      }
    ],
    "Memories of Lies": [
      {
        "Order": 0,
        "Character": "Axel",
        "Line": "How can we help you, Vexen? It's not very often we see you topside. Whatever. You can do what you want. But you know, I think testing Sora is just a cover for testing your valet. Anyway... Since you came all this way, you're gonna need this. A humble gift to my elder. I hope you use it to put on a very good show for us. That card holds the memories of Sora and Riku's home."
      },
      {
        "Order": 1,
        "Character": "Vexen",
        "Line": "I came to lend you a hand. You obviously believe this Sora has much potential, but I remain unconvinced he is truly worth such coddling. I think an experiment would show if he really is of any value to us. I'm a scientist. Experiments are what I do, yes. Valet? He's the product of pure research. Hmph. You should just learn to be quiet. It must be done. I told you I would make good use of you, didn't I?"
      },
      {
        "Order": 2,
        "Character": "Larxene",
        "Line": "Hmph. Well, here we go again. It's just an excuse so you can carry out your little experiments. That's all. What he actually is is a toy. With a little help from Naminé, you'll have all the real Riku's memories. Maybe we can get her to make you forget you're nothing but a fake. In other words, we'll remake your heart so you can be---exactly the same as the real Riku, 'kay? Any objections, Vexen? After all, you do want to test Sora, don't you? Relax, kiddo. I don't think it's going to hurt that much! Stupid little toy! Think you could defeat me? Where would you ever get a thought like that? But---look on the bright side. Along with everything else in your head, Naminé will erase the memory of me knocking you flat. Instead, she will implant the loveliest little memories you could ever hope for! It's no big deal if they're all lies."
      },
      {
        "Order": 3,
        "Character": "Riku Replica",
        "Line": "It's just a card. What good is that? You want to remake my heart?! The real Riku is a wimp who's afraid of the dark! What do I want with the heart of a loser?! How can you? Are you betraying me?! No— I'll hurt YOU! No...NOOO!!!"
      }
    ],
    "Kairi’s Shadow": [
      {
        "Order": 0,
        "Character": "Larxene",
        "Line": "Why so glum, Naminé? Is there something that's been troubling you? Are you feeling awful about tinkering with Sora's memory? Or maybe you--- Is that so? That's just amazing. It's almost like you completely made his heart from scratch. Nice touch with the good luck charm. I didn't know you could use memories to transform objects like cards into keepsakes. You used the same trick on Sora, right? You changed Kairi's good luck charm with your magic, didn't you? It won't be long before Sora forgets about Kairi completely! And then he'll be all yours to— Huh? What's your problem with that? That should be your incentive not to screw anything up. Just do a good job rewriting Sora's heart. Then you can actually be somebody---and no longer just Kairi's shadow. You'll be real in Sora's heart."
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Cut it out, Larxene. Naminé---she doesn't want to remember Sora. Don't worry. Whatever's hurting you, I'll make it go away. I swear it on this---the good luck charm you gave me. See ya."
      },
      {
        "Order": 2,
        "Character": "Naminé",
        "Line": "He won't forget. No matter how much I change his memory, Sora will never forget Kairi. Memories of me--- More false memories of me will just make his feelings for Kairi even stronger than before. Because...I'm the shadow of Kairi."
      }
    ],
    "Obtaining Riku": [
      {
        "Order": 0,
        "Character": "Lexaeus",
        "Line": "Vexen is no more. Our problem is Sora. Vexen proved to be no match for him, yet he's still under Naminé's control. Correct. For our Superior---he is in dire need of the hero of light. When light loses sight of its path---we may find use for the dark. What we must do---is obtain the darkness."
      },
      {
        "Order": 1,
        "Character": "Zexion",
        "Line": "Yes, his scent is gone. Axel struck him down...something I find deplorable--- Agents of the Organization striking each other down. But we cannot eliminate Sora, can we? Riku... Of course."
      }
    ],
    "Ridding Myself of the Dark": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Just one card left. If I get through this, will I be free of the darkness?"
      }
    ],
    "Lexaeus the Taciturn": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "That scent... You're another one of those \"nobodies.\" I do not...fear it! And if I say no?"
      },
      {
        "Order": 1,
        "Character": "Lexaeus",
        "Line": "You've done well thus far. But to possess your powers, and yet fear darkness... What a waste. I sense that you do. You're also capable of controlling the darkness. Cast away your useless fear. Open your heart. Embrace the darkness. Then you lose both light and darkness---and disappear! I, Lexaeus, will not yield to the frail heart---of an infantile coward! Now, stop resisting---and let the darkness in!"
      }
    ],
    "In a Flash of Darkness": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "You're finished! Too slow. Heh..."
      },
      {
        "Order": 1,
        "Character": "Lexaeus",
        "Line": "Don't mock me! You were too much trouble. You are the Superior's---Forgive me, Zexion. This was a fight I should not have started."
      }
    ],
    "The World of Darkness": [
      {
        "Order": 0,
        "Character": "Ansem the Wise",
        "Line": "I see you now...clearly. Riku... I can see your heart...That's it, remember me... Let me drift into your heart... You called out my name. You have been thinking about me... You're afraid of the darkness I command. Good... The more you think of me, the closer my return draws. And when I have awoken, I will take hold...Your heart will be mine! You meddlesome king!"
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "Huh? Lexaeus?! No...it's not. Darkness this foul could only...only be---.Ansem! Your Majesty!"
      },
      {
        "Order": 2,
        "Character": "Mickey",
        "Line": "Riku, fight! Don't let him win!"
      }
    ],
    "The King’s Heart": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "The king... He protected me... Your Majesty, where are you? Please answer! You're with me, aren't you…"
      }
    ],
    "The Tactician’s Move": [
      {
        "Order": 0,
        "Character": "Zexion",
        "Line": "Lexaeus is gone as well... I thought perhaps it might be you. Yes, we were going to set him off against the traitors... But with Marluxia gone, there is no more need. He is nothing but a nuisance now. You know that is not how I do things. Tell me, did you obtain the data on Riku's home?"
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Vexen, Larxene, Lexaeus... I wonder who will be next in line. Me? No way. I already took my pounding from Sora. He thinks I'm done for good. Nope, I think it'll be Marluxia next. For defying the Organization and targeting Sora. I hope he moves exactly as his heart commands him to. So, what about you? I thought you guys had plans for Riku. And he's dangerous, as well. After all, he took down Lexaeus."
      }
    ],
    "A Card of Home": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "What? One of the scents has died---a really strong one. Huh? Keyblade... You mean Sora! Sora is here?! What's that mean? This card! This is our---"
      },
      {
        "Order": 1,
        "Character": "Zexion",
        "Line": "The keeper of this castle, Marluxia, has just been felled by the Keyblade master. Yes. Want to see him? But...can you face him? The world of darkness, and Ansem's shadow, still nest within your heart. Do you plan to face Sora like that? Are you not ashamed? Sora's fate is to battle the darkness. He must oppose anyone who hosts the dark---in other words, it's you. If you don't believe the words I say...then you had best see the truth with your own eyes. Yes, it is your home."
      }
    ],
    "One Who Destroyed Home": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "This is...that night!"
      },
      {
        "Order": 1,
        "Character": "Zexion",
        "Line": "All of the islands you grew up on were sundered, scattered. Many hearts were forever lost to the darkness. Because of what YOU did! You hated being an islander, so you opened the door to darkness and destroyed the islands. It was YOU! You were pulled into the darkness then, and now you belong to the darkness. You should look---look at what you truly are!"
      }
    ],
    "A Friend’s Back": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Sora?! Sora!"
      }
    ],
    "Yours Alone": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Sora, it's me---What?! Stop it, Sora! Don't you recognize me? I'm...fading... Fading away...into the light. Make me stronger? Darkness too? All this time I've tried to push the darkness away— ---and I'll be able to see through the brightest light— Can I face them? You know I do. Of course. And I will! With my strength--- My dark strength! Darkness! You reek of darkness. Even the light can't block the smell. I guess I followed the darkness right to you."
      },
      {
        "Order": 1,
        "Character": "Kairi",
        "Line": "You won't fade. You can't fade. There's no power that can defeat you---not the light, not the dark. So don't run from the light---and don't fear the darkness. Because both will make you stronger. Yeah. Strength that's yours. The darkness inside your heart---it's vast and it's deep...but if you can truly stare into it and never try to look away, you won't be afraid of anything again. You've gotta just remember to be brave. Know that the darkness is there and don't give in. If you do that, you will gain strength---the kind that's unlike any other. You'll be able to escape the deepest darkness— Follow the darkness. It'll show you the way to your friends. You don't want to?"
      },
      {
        "Order": 2,
        "Character": "Naminé",
        "Line": "You don't want to?"
      },
      {
        "Order": 3,
        "Character": "Zexion",
        "Line": "Yeah, I recognize you. I can see exactly what you've become! How can the light hurt you? Riku... Have you really become a creature of the dark? You're not Riku anymore... You're just a pawn of the darkness. So be it. It's time for you to face the light! Impossible! How is it that you found me when you were there in the light? This is absurd... Then I shall make you see... That your hopes are nothing---nothing but a mere illusion!"
      }
    ],
    "Accepting the Darkness": [
      {
        "Order": 0,
        "Character": "Zexion",
        "Line": "After all your protests, you're still like us, on the side of darkness. When did that happen? You were always terrified of the dark before---"
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "I know who I am. Not anymore!"
      }
    ],
    "The Tactician’s End": [
      {
        "Order": 0,
        "Character": "Zexion",
        "Line": "What IS he?! No one's EVER worn the darkness the way that he does! It's impossible! Oh... Oh, yes. The replica, of course. We can use this Riku to defeat the real one. Axel? Axel! What are you saying to him?! You can't do this!"
      },
      {
        "Order": 1,
        "Character": "Axel",
        "Line": "Wouldn't you like to be real? All you need is the kind of power that the real Riku doesn't have. If you can get that, you can be a new person---not Riku, nor anybody else. You won't just be a copy of someone. You will be unique, your OWN self. You know, he's as good a place to start as any. So sorry, Zexion. Hm... You just found out way too much."
      }
    ],
    "Reunion with the King": [
      {
        "Order": 0,
        "Character": "Ansem the Wise",
        "Line": "Riku... Riku...I know you can feel it... The grip that I have on your heart. You have let in the darkness, Riku. That means very soon your heart shall become an all-consuming darkness. Yes, you are. The deeper the darkness runs inside you, the stronger I become. Controlling you is effortless. Ugh... Must you interfere again?!"
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "Who's there? I'm not like that now! Can't move! Huh? Your Majesty, is it you? This time, you're not an illusion. I'm so glad that you could make it here. Ahh..I'm okay. Don't worry. Guess I'm just relieved. I've---I've been alone so long that having someone else around is...is a little...overwhelming. But...uh, how did you make it here? I thought it was too far. Maybe you are right."
      },
      {
        "Order": 2,
        "Character": "Mickey",
        "Line": "Phew! Sure glad I made it in time! Heh! That oughta keep Ansem busy for a while. Sorry I couldn't come here sooner, Riku. Uh-huh! Whoa! That tickles! I made a promise to you that I would find a way, didn't I? Oh! I found a card to help me. I needed a way outta the realm of darkness, and then suddenly, this card appeared right in front of me. When I picked it up, I could see your heart beyond the darkness. That's what let me find you. I guess the card thought its place was to be with you."
      }
    ],
    "DiZ": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Where am I? What is this place? Oh! Your Majesty? You're not the true Ansem. Your scent is different. The Ansem in my heart smells darker. The odor is more foul. But your scent just isn't that. It's not darkness. It's something else. I finally understand. You're the one who guided me when it started. You came to me pretending to be Ansem. You gave me the card--- To make me face the darkness. Really. Who are you? And what do you want from me? Choose? Naminé? Who's that?"
      },
      {
        "Order": 1,
        "Character": "Ansem the Wise",
        "Line": "You must battle me all alone. Against my dark powers! What's this? Are you giving up? Finally ready to surrender to your fate? Hm. That is correct. DiZ, or so I am known. You---I've watched you all along. For you to choose. You are a special entity. You exist between light and dark. You stand in the twilight. You are to meet Naminé, then choose. You will know soon."
      }
    ],
    "The Last One-on-One": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Maybe Naminé is here...Huh? How can you tell? No, I'M me. Huh?!"
      },
      {
        "Order": 1,
        "Character": "Riku Replica",
        "Line": "Hold it. Hmph. You've changed. Your own darkness---it doesn't frighten you anymore. Because I'm you. \"I'm me,\" he says. Must be nice being real. A fake like me could never get away with saying that. That's right, I'm a phony, a fake! The way I look, the way I feel, everything I remember! And even this newfound power! I thought by finding some new strength, I could finally be someone---someone who is not at all you! But...nothing changes... I'm still just empty! Everything about me is borrowed. As long as you're around, I'll never be more than a shadow!"
      }
    ],
    "The Same Place as Mine": [
      {
        "Order": 0,
        "Character": "Riku Replica",
        "Line": "So...it's over. Hmph. Death doesn't frighten me. Good riddance to a phony life. My heart was never real. I'm sure even what I'm feeling now is probably all fake. What happens when a fake dies---one like me? Where will my heart go? Does it disappear? Tsk. A faithful replica until the very end. That's...okay."
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "What are you feeling? It'll go somewhere. Maybe to the same place as mine."
      }
    ],
    "Riku’s Choice": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Are you Naminé? I see... That was you...Forget it. Nothing. Sora! What have you done to Sora? So Sora chose to forget about this castle...and get his old memories back? Why me, too? No one's messed with my memories. What happens to me if I let you do that? Will I forget everything like Sora? I'll have to. He doesn't even look worried. Will I sleep like that, too? Figures. Sora always did as he pleased. Whatever we'd be doing together, he'd find a way to slack off. Even trying to leave the islands---I did all the work on the raft by myself. That's it. When this slacker wakes up, I'll tell him off. I told him to take care of Kairi and here he is just taking a nap! But I can't chew him out like he deserves---if I've been asleep. I don't need my heart locked. I'm ready---I'm gonna fight Ansem. If that happens, then the darkness will show me the way. Why do I get the feeling that you knew I would say that? So that's the reason---that's why you came to my rescue inside that light... ...in the form of Kairi. I knew when I met you. You and Kairi smell the same. Look after Sora."
      },
      {
        "Order": 1,
        "Character": "Naminé",
        "Line": "Yes. Huh?  Please... Come this way. Nothing. He's just asleep. To get his memory back. You have a choice to make, too. It's not your memories. It's your darkness. In your heart there is darkness, and in that darkness is Ansem. He may be at bay for now---but eventually he'll wake, and he will take over you just like he did before. But I have powers you can use. With my powers, I can put a tight lock on your heart. That way, Ansem could never come out from inside you. The darkness in you will be sealed tight just like your memory. You'll stop remembering the darkness. You'll go back to how you were. Riku, please choose. Yes. But what if his darkness overtakes you? Yes... That's true. I didn't know. I hoped. I wanted you to face the darkness, because you're the one who can. When'd you know?"
      }
    ],
    "DiZ’s Guidance": [
      {
        "Order": 0,
        "Character": "Mickey",
        "Line": "Gosh, I guess you decided not to go to sleep. I heard it from DiZ. Well, I'm not sure. Gotta feelin' that I've met him...somewhere..."
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "How'd you know that? Do you know him? Hey. Who are you? Boy, you really like pushing decisions on other people. Do you think I'm reckless? Are you supporting me? Or are you abandoning me? What's this? Doesn't matter. I won't run from the darkness. Come on. Let's go"
      },
      {
        "Order": 2,
        "Character": "Ansem the Wise",
        "Line": "I could be nobody or anybody. It is up to you whether you choose to believe in me or not. And you have pushed away slumber making the choice to face Ansem. You have chosen your own path. That will be your choice as well. The Organization will pursue you. Like a pack of hunting dogs, they will sneak up on you if they sense your presence. However---this cloak that is worn by Nobodies will render their eyes and noses useless. The ears, not so...They wear this to give themselves protection from being devoured by darkness. Is it clear? Even the Organization cannot rule the darkness. Hmm. The card will draw out your heart's darkness. Finish your business with Ansem."
      }
    ],
    "Riku’s Resolve and the King’s Determination": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "He said this card will draw Ansem out...Sorry... I've gotta face him alone. There's no point in doing this if I can't do it on my own. But I do need a favor. If Ansem is the victor, he's going to enslave me. If that happens, use your powers to destr— Huh? No that's not it. I want you to destr— I choose to believe in you---always, Your Majesty. Thanks."
      },
      {
        "Order": 1,
        "Character": "Mickey",
        "Line": "Don't worry! We can defeat him together! But why?! O'course! I'll be right there to save ya! No way! No matter what happens, I'm gonna be right there to help ya. I promise ya that. Unless...you don't believe I'll come through for ya...And I in you. You're not gonna lose, I know it."
      }
    ],
    "To the Heart of Darkness": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Ansem! Where are you? Show yourself! Huh?"
      },
      {
        "Order": 1,
        "Character": "Ansem, Seeker of Darkness",
        "Line": "Why in such a hurry? I'll be here at the very heart of darkness… Watching you plunge into the same darkness---inside of you."
      }
    ],
    "The Foul Stench": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "I smell you, Ansem. Show yourself. That's not it. The truth is…I just can't stand your foul stench. Yeah, I know. Or did you forget? I used all the power you had to give---and Sora still beat me. I'm not at all impressed with your powers!"
      },
      {
        "Order": 1,
        "Character": "Ansem, Seeker of Darkness",
        "Line": "I have watched you fight. I know your strength. Your skill with darkness has grown. It has become more mature. And yet, why... Why do you accept the darkness---but still refuse me? You know you and I are similar. We both follow where the darkness leads. Indeed, we are the same, so why? Does some part of your heart still have a fear of the dark? You are a fool. You should know my powers well by now. Very well. In that case— You shall sink into the abyss!"
      }
    ],
    "Darkness Released": [
      {
        "Order": 0,
        "Character": "Riku",
        "Line": "Huh?"
      },
      {
        "Order": 1,
        "Character": "Ansem, Seeker of Darkness",
        "Line": "Hm!"
      }
    ],
    "After the Battle": [
      {
        "Order": 0,
        "Character": "Ansem, Seeker of Darkness",
        "Line": "Insolent brat! Huh? This...is hardly...the end... Your darkness---I gave it...all to you… My dark shadow...lingers... Someday... Someday... I will return!"
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "Ansem! This is the end! Sora... Kairi..."
      },
      {
        "Order": 2,
        "Character": "Mickey",
        "Line": "Gosh, Riku, I know you wanted to do this alone...but ya don't mind gettin' a LITTLE help, do ya?"
      }
    ],
    "Where the Road Leads": [
      {
        "Order": 0,
        "Character": "Mickey",
        "Line": "So, Riku...what happens next? Are you goin' home? Your darkness belongs to you. Just the same way your light does. Up till now, I thought darkness was something that should never exist. Then I spent time with you and changed my mind. The road you chose---I didn't know. Light and dark, back to back. With you, I think they might meet in a way nobody's seen before. Wonder where that road leads. I'd like to see myself. I'd like to walk the road with ya. Gosh, Riku, you know you don't have to call me that now. We're pals."
      },
      {
        "Order": 1,
        "Character": "Riku",
        "Line": "I can't go home---not yet. It's still here. It's really faint, but I can sense him. So I think his darkness may still have a hold on me. Hm? Your Majesty, I'm really flattered... I don't know what to say. Fair enough, Mickey. What are you making me choose now? Neither suits me. I'm taking the middle road. No. It's the road to dawn."
      },
      {
        "Order": 2,
        "Character": "Ansem the Wise",
        "Line": "Between the road to light---and the road to darkness. Do you mean the twilight road to nightfall?"
      }
    ]
  }
}